---
api_data:
  post:
    author: Leo Maia
    body: "Ol\xE1 a todos os 21.588 que acabam de receber esse email :)\r\n\r\nMoro\
      \ em Bras\xEDlia, Brasil. Tenho 20 anos.\r\n\r\nConheci o The Listserve no in\xED\
      cio do ano, por um post do Youpix. Coloquei meu email no mailing e desde ent\xE3\
      o recebo diariamente v\xE1rias hist\xF3ria. Fa\xE7o quest\xE3o de ler cada uma\
      \ dessas historias, elas me inspiram. J\xE1 sorri, chorei e at\xE9 respondi\
      \ alguns emails agradecendo pela mensagem que foi compartilhada.\r\n\r\nUma\
      \ dica que levo para a vida \xE9 que devemos correr atr\xE1s dos nossos sonhos,\
      \ independente de qu\xE3o grande ele \xE9. Aproveite cada minuto dessa busca,\
      \ mantenha o foco e n\xE3o se esque\xE7a de aproveitar a paisagem do caminho.\
      \ Fa\xE7a tudo o que voc\xEA pode fazer, corra atr\xE1s das minimas oportunidades,\
      \ mostre que voc\xEA tem um sonho, corra atr\xE1s e seja feliz.\r\n\r\nGostaria\
      \ muito de saber onde essa mensagem chegou, se poss\xEDvel me envie um Ol\xE1\
      \ e diga qual seu pa\xEDs.\r\n\r\nAbra\xE7o!\r\n\r\n\r\nLeo Maia /  @LeoMaia\
      \ _\r\nleomaia.bsb@gmail.com\r\nBrasil\r\n\r\n"
    date: [2012, 10, 24]
    subject: '[The Listserve]'
  post_html: {body: '<p>Ol&#225; a todos os 21.588 que acabam de receber esse email
      :)</p>

      <p>Moro em Bras&#237;lia, Brasil. Tenho 20 anos.</p>

      <p>Conheci o The Listserve no in&#237;cio do ano, por um post do Youpix. Coloquei
      meu email no mailing e desde ent&#227;o recebo diariamente v&#225;rias hist&#243;ria.
      Fa&#231;o quest&#227;o de ler cada uma dessas historias, elas me inspiram. J&#225;
      sorri, chorei e at&#233; respondi alguns emails agradecendo pela mensagem que
      foi compartilhada.</p>

      <p>Uma dica que levo para a vida &#233; que devemos correr atr&#225;s dos nossos
      sonhos, independente de qu&#227;o grande ele &#233;. Aproveite cada minuto dessa
      busca, mantenha o foco e n&#227;o se esque&#231;a de aproveitar a paisagem do
      caminho. Fa&#231;a tudo o que voc&#234; pode fazer, corra atr&#225;s das minimas
      oportunidades, mostre que voc&#234; tem um sonho, corra atr&#225;s e seja feliz.</p>

      <p>Gostaria muito de saber onde essa mensagem chegou, se poss&#237;vel me envie
      um Ol&#225; e diga qual seu pa&#237;s.</p>

      <p>Abra&#231;o!</p>

      <p><br />Leo Maia /  @LeoMaia _<br />leomaia.bsb@gmail.com<br />Brasil</p>',
    date: October 24 2012, desc: 'The Listserve post on October 24, 2012: [no subject]',
    title: '[no subject]'}
layout: post
tags: ['2012-10-24']
title: '[no subject]'

---
