---
layout: post
post_data:
  author: Mariana Gazulha
  body: "foi exatamente isso que eu pensei quando recebi o email avisando que eu tinha\
    \ sido selecionada, o que eu vou escrever? depois de um tempo pensando, resolvi\
    \ come\xE7ar escrevendo sobre o tempo, n\xE3o tem melhor t\xF3pico pra come\xE7\
    ar uma conversa com quem n\xE3o conhecemos.. Moro no estado mais ao sul do Brasil,\
    \ e aqui o clima vai de muito quente a muito frio, e no momento estamos no muito\
    \ frio, embora ainda n\xE3o seja inverno, j\xE1 teve at\xE9 temperatura negativa\
    \ em algumas cidades, e segundo not\xEDcias, na pr\xF3xima semana as temperaturas\
    \ j\xE1 ficar\xE3o bem altas de novo. N\xE3o h\xE1 como entender o clima daqui\
    \ mesmo!\r\n\r\nBom, eu sou estudante de arquitetura, e por mais exaustiva que\
    \ seja  a faculdade, n\xE3o me arrependo da escolha feita, que, por sinal me permitiu\
    \ viajar a outros pa\xEDses (amei todos!). Estou mais para fim do meu curso, e\
    \ ultimamente tenho pensado o que eu vou fazer depois de formada, mas isso \xE9\
    \ uma preocupa\xE7\xE3o pra mais adiante.\r\n\r\nAgora uns t\xF3picos mais aleat\xF3\
    rios (ainda!) pra fechar o email:\r\n\r\n assista Greys Anatomy, How I Met Your\
    \ Mother, Community, White Collar, TBBT, Modern Family, Raising Hope, New Girl,\
    \ 2 broke girls, Parenthood. A  lista \xE9 grande, mas vale a pena, eu garanto!\
    \ :)\r\n\r\nLeia todos os livros do John Boyne, principalmente O Pal\xE1cio de\
    \ Inverno. \xC9 \xF3timo!\r\n\r\nAssista Uma Linda Mulher, \xE9 excelente!\r\n\
    \r\nE pra fechar, sempre pense duas vezes antes de agir, e tenha sempre f\xE9\
    , seja em algu\xE9m ou em alguma coisa.\r\n\r\n\r\nAbra\xE7os, Mari\r\nmari_gazulha@hotmail.com\r\
    \nCanoas, RS, Brasil\r\n\r\n"
  date: [2012, 6, 12]
  subject: '[The Listserve] Ganhei na loteria, e agora??'
post_html: {body: '<p>foi exatamente isso que eu pensei quando recebi o email avisando
    que eu tinha sido selecionada, o que eu vou escrever? depois de um tempo pensando,
    resolvi come&#231;ar escrevendo sobre o tempo, n&#227;o tem melhor t&#243;pico
    pra come&#231;ar uma conversa com quem n&#227;o conhecemos.. Moro no estado mais
    ao sul do Brasil, e aqui o clima vai de muito quente a muito frio, e no momento
    estamos no muito frio, embora ainda n&#227;o seja inverno, j&#225; teve at&#233;
    temperatura negativa em algumas cidades, e segundo not&#237;cias, na pr&#243;xima
    semana as temperaturas j&#225; ficar&#227;o bem altas de novo. N&#227;o h&#225;
    como entender o clima daqui mesmo!</p>

    <p>Bom, eu sou estudante de arquitetura, e por mais exaustiva que seja  a faculdade,
    n&#227;o me arrependo da escolha feita, que, por sinal me permitiu viajar a outros
    pa&#237;ses (amei todos!). Estou mais para fim do meu curso, e ultimamente tenho
    pensado o que eu vou fazer depois de formada, mas isso &#233; uma preocupa&#231;&#227;o
    pra mais adiante.</p>

    <p>Agora uns t&#243;picos mais aleat&#243;rios (ainda!) pra fechar o email:</p>

    <p> assista Greys Anatomy, How I Met Your Mother, Community, White Collar, TBBT,
    Modern Family, Raising Hope, New Girl, 2 broke girls, Parenthood. A  lista &#233;
    grande, mas vale a pena, eu garanto! :)</p>

    <p>Leia todos os livros do John Boyne, principalmente O Pal&#225;cio de Inverno.
    &#201; &#243;timo!</p>

    <p>Assista Uma Linda Mulher, &#233; excelente!</p>

    <p>E pra fechar, sempre pense duas vezes antes de agir, e tenha sempre f&#233;,
    seja em algu&#233;m ou em alguma coisa.</p>

    <p><br />Abra&#231;os, Mari<br />mari_gazulha@hotmail.com<br />Canoas, RS, Brasil</p>',
  date: June 12 2012, desc: 'The Listserve post on June 12, 2012: &quot;Ganhei na
    loteria, e agora??&quot;', title: 'Ganhei na loteria, e agora??'}
tags: ['2012-06-12']
title: Ganhei na loteria, e agora??

---
