---
api_data:
  post:
    author: Laura
    body: "Durante los \xFAltimos a\xF1os he conocido gente de muchos tipos, de diferentes\
      \ maneras de pensar o actuar. Pero de la que m\xE1s me he cruzado es de ese\
      \ tipo de gente  que no hace nada m\xE1s all\xE1 de lo obligado, que va a la\
      \ universidad, asiste a sus clases y vuelve a su casa. Es cierto que suelen\
      \ salir con sus amigos y dem\xE1s\u2026 pero nada que les saque de su rutina,\
      \ de su camino trazado.  Y me sorprende porque de todo lo que he  vivido hasta\
      \ ahora, los recuerdos m\xE1s valiosos que tengo son aquellos en los que sal\xED\
      \ de lo habitual o necesario.\r\n                De hecho algunos de mis \"\
      momentos\"  favoritos son  de cuando formamos un equipo de f\xFAtbol sala. Imaginaros\
      \ la situaci\xF3n: un grupo de chicas de una escuela de ingenier\xEDa (en  las\
      \ que las mujeres no abundan precisamente) que pr\xE1cticamente nunca hab\xED\
      an tocado un bal\xF3n, jugando al f\xFAtbol sala.  \xC9ramos mal\xEDsimas. Una\
      \ vez nos ganaron trece a cero (hay que decir que el otro equipo era de la facultad\
      \ de deportes) y cualquiera hubiera abandonado en ese mismo instante, pero ah\xED\
      \ seguimos nosotras pues porque nos lo pas\xE1bamos bien, nos re\xEDamos y \xE9\
      ramos un equipo curtido en batallas de cuarenta minutos. Y las pocas veces que\
      \ conseguimos ganar, la satisfacci\xF3n y alegr\xEDa era grandiosa.\r\n    \
      \            En definitiva lo que intento decir,  es que vale la pena salirse\
      \ del camino trazado. Vale la pena intentar algo nuevo de vez en cuando, aunque\
      \ pueda parecer que no vamos a ganar nada con ello o que se nos va a dar horriblemente\
      \ mal. Vale la pena no ajustarse al m\xEDnimo para conseguir sobrevivir.  Vale\
      \ la pena disfrutar  viviendo porque s\xED.\r\nY si algui\xE9n te pregunta y\
      \ \xBFpor qu\xE9? o \xBFpara qu\xE9 haces eso\u2026?  Responde pues porque s\xED\
      , porque me gusta. Y a vivir que hay tiempo para todo.\r\n\r\n\r\nTema aparte,\
      \ me hace ilusi\xF3n copiaros un trozo de un escritor que me encanta,  a ver\
      \ si os gusta.\r\n\r\n                \"Tema aparte, me hace ilusi\xF3n copiaros\
      \ un trozo de un escritor que me encanta,  a ver si os gusta.\r\n\r\n      \
      \          Los enamorados m\xE1s famosos del Disco fueron, sin lugar a dudas,\
      \ Mellius y Gretelina, cuyos apasionados y encendidos amor\xEDos habr\xEDan\
      \ chamuscado las p\xE1ginas de la historia si, por un inexplicable capricho\
      \ del destino, no hubieran nacido con doscientos a\xF1os de diferencia, en continentes\
      \ bien alejados el uno del otro. Sin embargo, los dioses se apiadaron de ellos\
      \ y a \xE9l lo convirtieron en una tabla de planchar** y a ella, en un peque\xF1\
      o noray de bronce.\r\n\r\n                ** Cuando se es un dios, no es preciso\
      \ aportar argumentos.\u201D\r\n\r\n                Mort - Terry Pratchett\r\n\
      \r\n\r\n\xA1Un abrazo! y que vaya todo bien.\r\n\r\npd.-  si os apetece leer\
      \ un poco de ciencia ficci\xF3n os recomiendo el cuento corto de Isaac Asimov\
      \  \" La \xFAltima pregunta\".\r\n\r\n\r\nLaura\t\r\nlra.dlsz@gmail.com\t\r\n\
      Valencia, Espa\xF1a\r\n\r\n"
    date: [2013, 3, 7]
    subject: '[The Listserve] woo!!'
  post_html: {body: "<p>Durante los &#250;ltimos a&#241;os he conocido gente de muchos\
      \ tipos, de diferentes maneras de pensar o actuar. Pero de la que m&#225;s me\
      \ he cruzado es de ese tipo de gente  que no hace nada m&#225;s all&#225; de\
      \ lo obligado, que va a la universidad, asiste a sus clases y vuelve a su casa.\
      \ Es cierto que suelen salir con sus amigos y dem&#225;s&#8230; pero nada que\
      \ les saque de su rutina, de su camino trazado.  Y me sorprende porque de todo\
      \ lo que he  vivido hasta ahora, los recuerdos m&#225;s valiosos que tengo son\
      \ aquellos en los que sal&#237; de lo habitual o necesario.<br />          \
      \      De hecho algunos de mis \"momentos\"  favoritos son  de cuando formamos\
      \ un equipo de f&#250;tbol sala. Imaginaros la situaci&#243;n: un grupo de chicas\
      \ de una escuela de ingenier&#237;a (en  las que las mujeres no abundan precisamente)\
      \ que pr&#225;cticamente nunca hab&#237;an tocado un bal&#243;n, jugando al\
      \ f&#250;tbol sala.  &#201;ramos mal&#237;simas. Una vez nos ganaron trece a\
      \ cero (hay que decir que el otro equipo era de la facultad de deportes) y cualquiera\
      \ hubiera abandonado en ese mismo instante, pero ah&#237; seguimos nosotras\
      \ pues porque nos lo pas&#225;bamos bien, nos re&#237;amos y &#233;ramos un\
      \ equipo curtido en batallas de cuarenta minutos. Y las pocas veces que conseguimos\
      \ ganar, la satisfacci&#243;n y alegr&#237;a era grandiosa.<br />          \
      \      En definitiva lo que intento decir,  es que vale la pena salirse del\
      \ camino trazado. Vale la pena intentar algo nuevo de vez en cuando, aunque\
      \ pueda parecer que no vamos a ganar nada con ello o que se nos va a dar horriblemente\
      \ mal. Vale la pena no ajustarse al m&#237;nimo para conseguir sobrevivir. \
      \ Vale la pena disfrutar  viviendo porque s&#237;.<br />Y si algui&#233;n te\
      \ pregunta y &#191;por qu&#233;? o &#191;para qu&#233; haces eso&#8230;?  Responde\
      \ pues porque s&#237;, porque me gusta. Y a vivir que hay tiempo para todo.</p>\n\
      <p><br />Tema aparte, me hace ilusi&#243;n copiaros un trozo de un escritor\
      \ que me encanta,  a ver si os gusta.</p>\n<p>                \"Tema aparte,\
      \ me hace ilusi&#243;n copiaros un trozo de un escritor que me encanta,  a ver\
      \ si os gusta.</p>\n<p>                Los enamorados m&#225;s famosos del Disco\
      \ fueron, sin lugar a dudas, Mellius y Gretelina, cuyos apasionados y encendidos\
      \ amor&#237;os habr&#237;an chamuscado las p&#225;ginas de la historia si, por\
      \ un inexplicable capricho del destino, no hubieran nacido con doscientos a&#241;os\
      \ de diferencia, en continentes bien alejados el uno del otro. Sin embargo,\
      \ los dioses se apiadaron de ellos y a &#233;l lo convirtieron en una tabla\
      \ de planchar** y a ella, en un peque&#241;o noray de bronce.</p>\n<p>     \
      \           ** Cuando se es un dios, no es preciso aportar argumentos.&#8221;</p>\n\
      <p>                Mort - Terry Pratchett</p>\n<p><br />&#161;Un abrazo! y que\
      \ vaya todo bien.</p>\n<p>pd.-  si os apetece leer un poco de ciencia ficci&#243;n\
      \ os recomiendo el cuento corto de Isaac Asimov  \" La &#250;ltima pregunta\"\
      .</p>\n<p><br />Laura\t<br />lra.dlsz@gmail.com\t<br />Valencia, Espa&#241;a</p>",
    date: March 07 2013, desc: 'The Listserve post on March 07, 2013: &quot;woo!!&quot;',
    title: woo!!}
layout: post
tags: ['2013-03-07']
title: woo!!

---
