["[The Listserve] Three disparate things", "David", "First, I wanted to share a quote from a better wordsmith than I:\r\n\r\n“Every one of us is, in the cosmic perspective, precious. If a human disagrees with you, let him live. In a hundred billion galaxies, you will not find another.” - Carl Sagan\r\n\r\nThe brain is too amazing and too capable to be wasted on hate.\r\n\r\nSecondly, a story as part of Bill Bryson's book A Short History of Nearly Everything:\r\n\r\n[Discussing the international scientific venture to measure the transit of Venus from different spots on the globe to determine the distance of the Earth from the Sun.  The story concerns one man’s hapless plight in 1761.]\r\n\r\n“[Guillaume] Le Gentil set off from France a year ahead of time to observe the transit from India, but various setbacks left him still at sea on the day of the transit -- just about the worst place to be since steady measurements were impossible on a pitching ship.         Undaunted, Le Gentil continued on to India to await the next transit in 1769.  With eight years to prepare, he erected a first-rate viewing station, tested and retested his instruments and had everything in a state of perfect readiness.  On the morning of the second transit, June 4, 1769, he awoke to a fine day, but just as Venus began its pass, a cloud slid in front of the Sun and remained there for almost exactly the duration of the transit:  three hours, fourteen minutes, and seven seconds.         Stoically, Le Gentil packed up his instruments and set off for the nearest port, but en route he contracted dysentery and was laid up for nearly a year.  Still weakened, he finally made it onto a ship.  It was nearly wrecked in a hurricane off the African coast.  When at last he reached home, eleven and a half years after setting off, and having achieved nothing, he discovered that his relatives had had him declared dead in his absence and had enthusiastically plundered his estate.”\r\n\r\nLastly, a question.  I am a monolingual English speaker and wish to learn a new language.  Given the breadth of the Listserve audience, what language should I try and why?\r\n\r\nThanks for reading!\r\n\r\n\r\nDavid\r\ndavid.listserve@gmail.com\r\nWashington, DC\r\n\r\n", [2012, 12, 17]]