["[The Listserve] Extraordinary forces", "René Dijk", "I want to share a short story with all of you. A short fantasy story with a true heart and message, written by myself many a year ago, when my life was much more complicated, restless and chaotic. I wrote this one for a close friend who needed a positive message at the time, but now, looking back at it all, I think I could've just as easily have written it for myself. Since then, you should know, my state of being has been transformed from being unsure, insecure and unaware, to being genuinely happy, secure, cognizant and reasonably untroubled. How, you might ask? Well, it turned out to be fairly simply / incredibly difficult: by finding true love and by finding (part of) my true self...\r\n\r\n********\r\n\r\nChacaroc’hcracha-cocrochy lived in an old abandoned gnome dwelling at the foot of a ridiculously gigantic and, in addition, awfully ancient oak tree, covered in strange smelling dark greenish mold. Chacaroc’hcracha-cocrochy (I’m really terribly sorry, but that’s just what she was called) looked very much like a cockroach, but, to be honest, she actually wasn’t one and, for that matter, never had been one either. She herself had no idea though, of what she actually was and why she did look like what she looked like. No idea about the extraordinary forces that quietly bubbled within her either.\r\n\r\nThe thing is, Chacaroc’hcracha-cocrochy was in fact the only existing creature in existence that perceived Chacaroc’hcracha-cocrochy as an ‘ugly creepy crawly creeper’, as she indeed often mumblingly referred herself to. Obviously, there was no one around to tell her otherwise, being the only Earthborn in that particular part of the forest (throughout that particular span of time that we now so whimsically, or rather ironically, denote as \"Origin\" or \"Chacaroc’hcracha-cocrochy\").\r\n\r\nYes, this is true; she had once met Garwocketwicket, Garwocketwicket the gnome. He was a surprisingly mute gnome, however, only able to communicate with birds (or other animals with beaks that whistled) by mimicking their cries and colourful tunes, simultaneously flapping his arms and legs. A strange sight for some perhaps, but Chacaroc’hcracha-cocrochy, by her very nature, understood immediately and perfectly that a gnome being a mute gnome, communicating with birds and at the same time comically flapping his limbs, probably was the most beautiful spectacle she would ever had the privilege to witness.\r\n\r\nNever before had mute creatures told Chacaroc’hcracha-cocrochy that she was not what she thought she was. Neither did Garwocketwicket, nor did he want to if he could have done so. Which is to say, not in a direct or literal manner at any rate. As an owlish gnome of strong character and stupendous wisdom he kept himself to flapping his arms and legs, creating beautiul spectacles and letting Chacaroc’hcracha-cocrochy be Chacaroc’hcracha-cocrochy. Knowing she would undoubtedly one day see herself as her true self, knowing that she would one day see and feel the extraordinary forces that so quietly bubbled within her.\r\n\r\n********\r\n\r\nAs an aspiring writer, this kind of opportunity - possibly being read by literally thousands and thousands of Listserve members - is truly a once in a lifetime thing. So, thank you all for your time and attention.\r\n\r\nIf you have questions or comments, then, please, don't hesitate to send me an email: ik@renedijk.nl.\r\n\r\n- The end -\r\n\r\n\r\nRené Dijk\t\r\nik@renedijk.nl\t\r\nUtrecht, The Netherlands\r\n\r\n", [2012, 12, 31]]