["[The Listserve] A personal allegory", "Virginia Kidwell", "I wrote this years ago, on my way to boot camp. If you enjoy, feel free to respond. 600 words is hard.\r\n\r\n\r\nI look behind me and there is light. It shines with a great brightness.  I look ahead of me and see: Nothing.  I see darkness and despair, the unknown.  How silly I must look to anyone watching, up here standing between my past and my future.  The bright security of my past illuminates me from behind, making me visible to all I am yet to see.\r\nI turn and face the brightness.  How easy it would be to walk back there and stay where I am.  I look over my shoulder and shiver.  Surely the darkened path is steep, uneven and cluttered with debris that will make me fall.  I should just go back down the path I know.  I know it is level and clear.\r\nI start down the lighted trail, going back to smiling faces.  First the faces of those I know, faces of love.  The trail is steady and clear.  My past quietly whispers that I should return to the new path.\r\nThen I understand.  These are the people I would have, could have, should have met, had I risked the dark, the unknown.  Yet still I walk forward, further on the lighted path. The people of my past and missed future look on with concern, but still they let me continue on.\r\nSuddenly, I stumble.  What did I trip over?  There was nothing in the trail last time I was here.  I look, and see that I tripped over my desire to change; it lies here broken and defeated.  I have killed it. But WAIT, it still moves.  I have a chance to revive it.\r\nI know what I must do.  I must take it back the other way, into the unknown. I look to the darkness, back the other way. I can’t go there. I continue in the light.\r\nIn front of me there is a wall, it wasn’t there before.  I look at the wall, and recognize it immediately.  It is a wall of my disappointment.  Disappointment in myself.  I can go around it, but eventually it will appear again.\r\nI look back again, at the future I turned away from.  It seems a little brighter, grey now, not black, with light in the distance.  That light; hope, lets me know that the end of the path will bright.\r\nI walk toward the grey, and pick up my desire for change.  I look back on my familiar path.  Sure, it was a nice path, but I am done with it now.  Clearly I cannot go back that way.  I must continue on.\r\nSo here I am.  At the edge again, with the light at my back and the unknown trail ahead.  In my hands is the desire to change. I hesitate.. Is this my last chance to turn back?  No, but I am going to keep going on the unfamiliar path.  How can I turn back and kill a part of me?\r\nI take that first step forward, and the path ahead seems to lighten, just a bit.  I tell myself not to look back, and take another step. The light brightens more.\r\nMy desire for change has been revived, and become a part of me.  I know what is behind me, but ahead of me lay new challenges and excitement.  I will go forward, knowing that I am not leaving my old path.\r\nSo to my old path, goodbye for now.  To my new path: Ready or not Here I Come!\r\n\r\n\r\nVirginia Kidwell \t\r\nglimmermere@hotmail.com\t\r\nYakima, WA\r\n\r\n", [2012, 12, 24]]