["[The Listserve] The fear of \"No\"", "Kendelyn", "I'm a photojournalist, which means that I get to meet and talk to a lot of people that I normally wouldn't. I love it. But as an introvert it can sometimes be difficult for me to ask people for permission to let me into their lives. \r\n\r\nSome times I'm around a subject for mere moments and the assignment is complete, other times it takes me days/weeks to complete a story, which means spending a lot of time with the person. I have come to find that when I know that I'm only going to be around someone for a short period of time it's easier for me to ask if I can photograph them because I am able to convince myself that it doesn't matter what they think of me because I am likely never to see them again. \r\n\r\nIt is subjects that I have to return to multiple times in order to complete a story that I have a more difficult time with. I begin to worry about what they will think of me, and that they will not want to be photographed and followed around, and that they will find me to be a nuisance. All of these worries create a fear that can sometimes be paralyzing. Most of the time I just suck it up and ask if I can photograph them anyways, but I know there have been moments where I have let integral storytelling moments pass me by because I kept my mouth shut. \r\n\r\nAfter expressing my frustrations over my worries to a mentor, she said to me \"you already have the no, why not go for the yes?\" That simple phrase stopped me in my tacks. It made so much sense to me, why hadn't I thought of it before?!  If you don't ask the answer will always be \"no!\"  But if you take a chance you just might get the \"yes\" that you are looking for. I have also come to learn that \"no\" doesn't always necessarily mean \"no\", sometimes it means \"not right now.\" Sometimes a \"no\" can lead you down a path that you never would have imagined yourself on had you received your \"yes\". And sometimes the \"no\" path turns out better than the \"yes\" path. \r\n\r\nI would dare to say that this principle of \"you already have the no\" extends far beyond the world of photojournalism and can be utilized in every aspect of your life. I for one know the principle has opened many doors and lead me to do things that I would normally never do. \r\n\r\nI still struggle occasionally with the principle, but each day I challenge myself to go after the \"yes.\" You never know what kind of results you will get until you ask and you will be surprised at how often people will surprise you. So with that I leave you with a challenge: go after that yes and don't let the fear of no stop you! \r\n\r\nI wish you all the best on your journey chasing the \"yes.\"\r\n\r\n\r\nKendelyn\t\r\nkendelyn.ouellette@gmail.com\t\r\nWashington, D.C\r\n\r\n", [2012, 12, 27]]
