["[The Listserve] A bit of Iron", "The Listserve", "       To begin, let me say that I live a blessed life, surrounded by\r\nfriends and family that love and support me.  I attempt to appreciate\r\nsuch great fortune as much as I am able, especially as I have grown\r\nolder and seen such disparity between friends of mine who do not enjoy\r\nmy same socioeconomic advantages.  Even now, as I am preparing to\r\nleave for college, which promises to be a separate segment of my life\r\nentirely, I know I have my parents and friends to look to in times of\r\ntrouble.  That is not to say I haven't lived without struggle.\r\n       From the onset of my life, at the very inception of my beginning\r\ndays, I endured disappointment.  I was an unhealthily premature baby,\r\n8 weeks ahead of schedule by the doctors shared estimations.\r\nNaturally, this made me extremely fragile and unhealthy.  I had to\r\nextend my stay in the hospital from a single night to almost two weeks\r\nas my parents weighed the magnitude of the reality  they were facing:\r\nif their first-born son would die before even leaving his hospital\r\nincubator.  I had every device available monitoring my precarious\r\nstate of health, and I know that my parents listened to every one of\r\nmy heart beats in an attempt to be somewhat closer to me.  As you may\r\nhave guessed, I ended up recovering.\r\n       That was not to be the last of my health problems.  In third and\r\nfourth grade I got sick with pneumonia that threatened my life.  My\r\nsophomore year of high school, I had what doctors believed at first to\r\nbe a dangerous heart-arrhythmia from which I would also eventually\r\nrecover.   And, for good measure, I also had panic attacks so\r\nfrequently I had to be medicated, and was almost diagnosed with an\r\nanxiety disorder.\r\n       All of these things aside though, what one of my father's childhood\r\nfriend's posits is that I am able to persevere because of how I began\r\nmy life. She believes that because I was born so weak and had to\r\nfight, that I formed a large part of my person immediately. She\r\nbelieves, and has convinced me to believe, that enduring these\r\nstruggles so early instilled some bit of iron in me that enabled me to\r\novercome what challenges I faced, especially as they relate to health.\r\n       I in no way think that I'm extraordinary, or otherwise remarkable,\r\nbut I am thankful for the environment in which I live now.  I'm also\r\npressed to contemplate if my father's friend was correct in that my\r\nsocialization process was so drastic and so immediate that it formed\r\nmuch of my being.  Regardless, I find it to be a fascinating thought.\r\nIf we can all seek to find what is a large part of ourselves, perhaps\r\nwe can use that knowledge to secure better lives for ourselves, each\r\nother, and our children.  If I can do so, I give all appreciation and\r\nthanks to those who have made my life full of wonder.  Only the\r\nmistakes have been mine.\r\n\r\nmontoya0721@gmail.com\r\n\r\n", [2012, 4, 25]]