["[The Listserve] Building something awesome with friends - or the story of FarmFest", "Okke", "It is a happy coincidence that I got the invite to write something to you all in my favorite week of the year. It is the week prior to a festival I help organize: FarmFest. Let me tell you why I love this festival so much.\r\n\r\nI grew up on a dairy farm in Friesland, the Netherlands. Throughout our upbringing, my twin brother and I spent a lot of time together - building tree houses, doing chores on the farm, playing games. Both my brother and I went to study: he moved to Utrecht, while I moved to Amsterdam. I am currently finishing my Masters, and he decided move back after his BSc. He's going to continue the farm when my parents quit.\r\n\r\nMost friendships from back home have watered down through time. I only see my twin brother when I go back to visit the farm, and many other friends I only see on special occasions. Fortunately, there is something that brings a group of us together every year: FarmFest. \r\n\r\n10 years ago a couple of friends and I decided to celebrate our birthdays together. We got some bands, lots of beers, and invited friends. Saturday July 14th we will throw the tenth of these gatherings, which we named FarmFest. This festival has grown from a few dozen friends to more than 500 people, who come to listen to bands, bbq, drink beers, dance, and relax around bonfires. Every year we improve something: better audio, a larger tent, a second stage, more bands.\r\n\r\nYet, the most pleasure I get from FarmFest is not the party itself, but the preparation. In the months and weeks before FarmFest my old friends, twin brother and I get together and try and figure out how to organise a festival. And let me assure you: creating a festival with friends is the awesomest thing in my life. Because of the festival, I get together with my old friends and we renew our friendships by working together. \r\n\r\nWhat brings your friends together?\r\n\r\nKind regards,\r\nOkke\r\nokke@farmfest.nl\r\nScherpenzeel, Friesland, the Netherlands\r\n\r\n\r\nP.S. If you're in the neighborhood, don't hesitate to drop by!\r\n\r\n", [2012, 7, 18]]