["[The Listserve] “Oh god, I’m so old.”", "Bon Morrison", "I turned twenty-three last Friday and I now find myself at a bizarre crossroads in my life. I just hit the one-year mark of my first real career job. I’m in the industry that I went to school for. I’m sitting behind a desk inside an iconic building in Toronto where I schedule television shows for the largest Canadian television network. I have a salary, I have a benefit package, and I’m doing well enough financially to support myself for the next few years.\r\n\r\nGetting back to that bizarre crossroads now – I feel like I’m older than I actually am. I can’t go on Facebook now without seeing people I know getting pregnant or getting engaged or also getting career jobs. It doesn’t help though that this is counter-balanced by all the people on my Facebook that are still getting hammered every weekend and doing nothing with their lives. Who do you want to be, Bon?\r\n\r\n“Whoo! Dranks with mah gurlz!”\r\n“Cancun 2012!”\r\n\r\nYou know what I mean.\r\n\r\nGetting down to the nitty-gritty, I’m making a bold assumption that this is all stemming from the fact that I’m single and actively want to be in a relationship. No more of this going out and getting laid business. I think I’ve lost count of the amount of times I’ve made the joke, “We get it! You’re happy!” whenever a couple walks by – unfortunately there’s a half-truth buried in there somewhere. Truth be told, I haven’t had a steady girlfriend in a few years. Keyword: Steady. I’ve had a few “girlfriends” the few years that have always been on-off-on-off but never one steady enough to actually say, “Yo, I’m dating this girl.”\r\n\r\nMy problem is that I watch too many romantic comedies that star Ryan Gosling. Why can’t I be Ryan Gosling? Give me the rain moment – I totally earned it. I’ll totally renovate a house for you. Or I can pull that stunt from Love Actually where Andrew Lincoln shows up at Keira Knightley’s door with cue cards. You know what I’m talking about, don’t even lie. Now I just have to channel my inner Shane West in A Walk to Remember and name a star after my next girlfriend.\r\n\r\nWow, did I just write that last paragraph? Moving along.\r\n\r\nThis has played out like an overly long dating service video. It really isn’t. I’m not lying around going, “WHY CAN’T I FIND A GIRLFRIEND!?” It takes second-fiddle to whatever is going on in my life at the moment that is infinitely more important.\r\n\r\nI’ve literally written this as a stream of conscious and know what I realized? I’m twenty-three year old. I’m not old at all. My life is so fun and I honestly couldn’t care less that I’m still single. I have a concert to go to tonight. I have two birthday parties next weekend. I have another two concerts the following weekend. And then it’s the holidays.\r\n\r\nDid I say something about a crossroads earlier? Forget that. If anyone in the Toronto area wants to dance their heart out or have an evening of shuffling through my overly large collection of romantic comedies, let me know.\r\n\r\nI had to end it as if it was a dating service video, it was just too easy.\r\n\r\n\r\nBon Morrison\r\nbon.c.chan@gmail.com\r\nToronto, Ontario\r\n\r\n", [2012, 11, 10]]