["[The Listserve] Italy baby!", "Seppe", "Hi Listserve\r\n \r\nWhat’s up? I love hearing your stories, you know. I hope I’ll be as entertaining as you have been.\r\n \r\nFirst some words about me:\r\nI’m a 30 years old/young guy & have an amazing girlfriend, who luckily also has become my wife since January of this year!\r\nWhen I say married, I mean a civil marriage, not a religious marriage. To be honest, I don’t really understand why some people have a need to believe in something imaginative. In history, religion only has given us wars, disputes,try to control & influence their followers, .... Don’t start about all the values it gives us. ;-) Those are just human values that some religions have considered their’s, but in fact they are not. These values are culturally dependent human values. Nothing to do with religion if you’d ask me. You know... the world would be such a better place when people stopped believing in those religions and started believing in themselves, their friends & their neighbours. What a fun world it would be!\r\nShe is also pregnant. My wife I mean, not the religion ;-) It’ll be our first child, so it’s kind of spooky, fun, scary & really cool; All at the same time :-)I’m really looking forward to it.\r\nI’m currently working as a marketeer for Coca-Cola & am  living in the centre of the world (?!?): Belgium.\r\nFor those who don’t know Belgium, it is: Brussels / HQ of NATO & EU / Belgian fries (no they should not be called french fries!) / Belgian beers / Kim Clijsters / ...\r\nBy now, you probably know where Belgium is situated. ;-)\r\n \r\nBelgium is a tiny country, but it is awesome. I love living here. I do admit that sometimes people complain too much, but I guess that is the same everywhere ;-)\r\nEven though it is a fun country, I’m hoping to move, in a couple of years, to Sydney, Australia or Atlanta, USA. I already have lived in France & the UK and I love integrating in new cultures & getting to know them. Does anybody live in Atlanta & Sydney? Don’t hesitate to give your views about these cities!\r\n \r\nI’m sure you won’t believe me, but in 2 days I’m leaving on a holiday which is aweseome. Yeaeaeaeaeaeaeaaah!!!\r\nI’m going on a 3-week roadtrip with as an endgoal Tuscany/Umbria in Italy.I love travelling so much. Usually I only decide during the travelling where I’m going, where I’ll sleep, etc.\r\nIs somebody living there? Or has some good tips to visit there? Or where to sleep? Or what to do? I’d love to get some out of the box ideas :-)\r\n \r\nBut now, let’s get serious. What is it actually that I’d like to tell to you guys/girls:\r\n·         Only do those things you love doing! Life is way too short to lose time doing this you’re not passionate about!\r\n·         Be passionate and by being so, make the people around you passionate!\r\n·         Eat Nutella during breakfast (I do it every day). It’s just too good & too tasty to miss out. ;-)\r\n \r\nIf somebody is visiting Belgium, don’t hesitate to let me know & I’ll give you some tips or we’ll have a (Belgian) beer together!\r\n \r\nEnjoy life!\r\n \r\nSeppe\r\nseppe82@hotmail.com\r\nLeuven (close to Brussels (which is in Belgium (which is a country in Europe)))\r\n\r\n\r\n", [2012, 9, 3]]