["[The Listserve]  (In)opportune", "angeli.ca", "A long time ago, I was hit with a sudden fever on my way home. As I came out of the subway, I felt so sick I could barely keep my eyes open, and the ten minute walk to my door (in the rain) seemed unfathomable. As I dragged myself down the street, I was consumed with self pity, and didn't notice the two children near me, splashing in puddles, until one jumped up close to me, spraying me with muddy water.\r\n\r\n\"Watch what the fuck you're doing!\" I snapped at them, my anger suddenly as hot as my fever. The children, drew back and apologized. I composed myself, and gave one of my own. \"I'm sorry, I shouldn't have sworn at you, but please be more careful next time\". My head swimming, I turned and headed home. The kids followed. \"Do you live around here?\" they asked, and suddenly we were having a conversation about the neighborhood, their school, their friends. Before I knew it, we were at my corner. We said goodbye, parted ways, and I never saw them again.\r\n\r\nI am still deeply thankful to those kids. On what could have been a long march home, instead of feeling weak and disoriented and sorry for myself, they kept me distracted, and the trip flew by. I had no idea how much I needed it until it was offered to me. It can hard for me to remember to be open to people, especially when they make mistakes, just as I know how hard it can be to see what's going right when everything seems to be going wrong. That moment, like so many others in my life, was a reminder to give life the opportunity to show me what to be thankful for.\r\n\r\nI'll end this with a shoutout to a group of people that always threw opportunity my way, my second family, a college/community radio station in Montréal called CJLO 1690AM. For over a decade, CJLO has let me contribute to and be part of something bigger than myself, and for that, I will forever be thankful. I would also be remiss to not thank Renata and Andrew, two people who, in their individual ways, give me the chance to be a better person every single day.\r\n\r\nAnd finally, thank you to YOU, whoever you are, wherever you are in the world. You make someone's day better every day, and you might not even know it.\r\n\r\n\r\nangeli.ca\t\r\nlistserve@angeli.ca.\t\r\nMontréal, Quebec\r\n\r\n", [2012, 12, 18]]