["[The Listserve] Gift Giving", "Yoga Junkeez", "Why did I cling to him?  New neighborhood, new school, new hormones, summer before freshman year in high school, like a (not so innocent) moth to a (bonfire) flame.  From the age of 13 to 22, I took him in like poison, drop by drop.  I still occasionally fight the thoughts and self doubt put in place over 8 years ago.  You couldn't tell me anything; I would defend him and make you sorry you ever questioned our relationship.  Through cheating, verbal abuse, physical altercations, humiliation, and manipulation, I let that poison take over my young mind.  Like a drop of ink in water, it spread inside me, it took over my thoughts.  What he said about my imperfections had to be true, right? What he wanted, I would fight to give him.  I loved him more than I loved myself and destructively gave him everything I had so he would feel the same about me.  I knew deep down it wasn't what love was supposed to be.\r\n\r\nI had a loving home, with parents that still have me in awe of their love for one another. I had an example and I knew what a healthy relationship looked like.  I was going to change him, make him be the person I thought he could be!  In the 8th year, it was a spring day and we had been fighting.  I was on my way from college, at this point we lived together which made way for a whole new kind of control and manipulation.  I maneuvered my car down the winding back road, and as tears rolled down my face, I approached train tracks.  I so clearly remember thinking, feeling, so defeated.  “I DO NOT CARE, I GIVE UP, and I’M TIRED”, I graphically pictured the train coming, and me, in that defeat, not reacting, not caring what happened to me. Genuinely not caring.\r\n\r\nI cry now, for the feeble girl I was.  It was in that moment, on that familiar road, I realized that I was lost.\r\n\r\nThat was the start of the end for us.  That time in my life made me the wife, the woman, the mother, the daughter, the dreamer I am today.  I hope to bring young girls in schools, and in my community to the mat for self-love.  For I found the hard way, in life, like in yoga, all the strength and love I need, is within me.\r\n\r\nIn every pose, a building, I am the foundation, with unique lines and beautiful architecture, imperfections and clutter.  On the mat...every breath, a renovation.. letting way to off the mat... a revelation! Clearing the clutter, cleaning up the negative.  Self- love, positive body image, confidence in our uniqueness and intelligence…..strength in the positive, that’s what I want to teach, teach teachers to teach, mothers, fathers, communities.  My gift to you:  You are strong, you are enough, in you, find love and never be lost.\r\n\r\n\r\nxoxo 2013 Yoga Teacher Training Graduate,\r\n\r\nYJ\r\nyogajunkeez@gmail.com\r\nMaryland\r\n\r\n", [2012, 12, 4]]