["[The Listserve] I continue.", "Friederike Jahn", "Hello everyone!\r\n\r\nI am Rike and I am a medical student in my fifth year.\r\n\r\nMy parents have always been involved in several fields, they are active in the green party, town parliament, youth organizations and within something like the red cross. This stuff sometimes stretched my nerves when I was a teenager. It was not that I didn´t support them but I didn´t know what´s the magic behind volunteering.\r\n\r\nI began to study medicine and slowly but steady I became students representative, was engaged within our national association of medical students and organized several projects regional and national.\r\n\r\nA few months ago I thought of decreasing the amount of projects I had besides my medical education due to my success as a future doctor and my personal private life. But two things changed me: First there was an article in a popular German magazine about the inner conflicts German doctors have treating their patients in a humane way and meeting the controllers demands concerning economic aspects by the same time. This article made me think deeply and I was glad having applied for the second thing I want to mention here, which was the HEALTHCARE LEADERSHIP SUMMERSCHOOL in the Netherlands. Organized by some great Dutch medical students it was one of the best experiences I ever made. There were 73 soul mates (few of them are on that list I guess!) and we motivated each other in facing the challenges of our healthcare system and to SPEAK UP for our wishes in our 32 home countries as well as to inspire others with doing so. Due to social media we are still connected very close!\r\n\r\nI think you already know what these things did to me. I will somehow stay committed to several projects and associations. It gives me the chance to speak up, to create and to take part in proceedings around us!\r\n\r\nBeing some kind of volunteer allowed me to meet wonderful people, have inspiring friends and to make experiences I would surely not have made if I had just followed my schedule as a medical student. I will continue.\r\n\r\n\r\nI am sorry that it became more than 250 Words and hope it is still okay!\r\nWarm regards,\r\nRike\r\nrike.j@gmx.de\r\nGreifswald, Germany\r\n\r\nPS: If you feel connected to health care, apply for the next edition of the Health Care Leadership Summerschool in 2013!\r\n\r\n", [2012, 11, 23]]