["[The Listserve] Moving Day", "Luke Neff", "Since the email from the nice people at The Listserve caught\r\nme on the morning of moving day, I’m filling this email with\r\nfragments from journals I found during the move, flipping\r\nthrough them at random and typing out what I find interesting\r\nuntil I hit the word limit:\r\n\r\nRecent revelation upon looking at the books scattered around\r\nthe house: we’ve always been more into gnomes than genomes.\r\n\r\nI am most impressed by those who can find the signal in the\r\nnoise. People like David Foster Wallace, W.H. Auden, Amy\r\nHempel, Rob Greco, my sister, Matthew Weiner, Sherlock\r\nHolmes, Deron Bauman, Al Swearengen, Frank Chimero, Ira\r\nGlass, Noah Dennis, Patrick Rothfuss, Ze Frank.\r\n\r\nWould we think differently with our brains in our feet?\r\n\r\nBook idea: How to Look at People\r\n\r\nThe closest thing to a Mos Eisley experience = Colorado,\r\nmountain town bars, the characters, the eclecticism,\r\nthe realia of the local.\r\n\r\nDreams of megafauna are my favorite.\r\n\r\n\"[He] used to claim that there’s no freedom quite\r\nlike the freedom of being constantly underestimated.\"\r\n– The Lies of Locke Lamora\r\n\r\nNext project: put together a resource for a daily\r\n\"Lucky Ten Thousand\" for my students.\r\n\r\nMatt Thomas: \"To live in Iowa -- and to stay sane\r\n-- requires the cultivation of a vast inner geography.\"\r\n– yes, exactly, that’s how I survived, isn’t it?\r\n\r\nRemember, it's the cheese that keeps us connected like\r\nthe chips in Paula Deen's nachos.\r\n\r\nFor some reason I'm fairly confident that oompaloompas\r\nwould have loved Melanzanas.\r\n\r\n\"I like trees because they seem more resigned to the way\r\nthey have to live than other things do.\" – Willa Cather,\r\nO Pioneers!\r\n\r\nI wonder how much our current mental state is dependent\r\nupon our ability to imagine a happy/fulfilling, realistic\r\nfuture?\r\n\r\n\"He turns the empty glass in his hand, and considers\r\nbiting off the rim.\" – from Raymond Carver's \"What Is It?\"\r\n\r\nWriting prompt idea: Write a sentence that you are sure\r\nthat no one on earth has ever written before.\r\n\r\ncareworn = best adjective\r\n\r\n\r\nLuke Neff\r\nluke.neff@gmail.com\r\noutside of Portland, Oregon\r\n\r\n", [2012, 6, 7]]