["[The Listserve] A story about music, youth and culture", "Tom Davenport", "This is a story about music. It is also a call to arms for anyone interested in recording. Forward it to anyone it might help.\r\n\r\nA lot is said about DIY music, and plenty more about mainstream artists. But this is a story about the rung beneath all that; a rarely mentioned rite of passage for anyone who has performed a note of music in their life.\r\n\r\nWhen I was 12, a youth club opened by our school. It had a music room where a member of staff showed me how to play a simple drum beat. I didn't 'get' music as a kid, but then they started playing along with the baseline to 'Smoke on the Water'.\r\n\r\nSomething clicked. It was a huge rush, and I feel it again as I write this.\r\n\r\nA decade later I was taking a degree in music production. My classmates wanted to be songwriters or DJs, but my love for bands like At the Drive-In and Fugazi led me to a certain music culture based in Washington DC through the 1980s. There is plenty of literature describing DC's punk heritage (everyone from Beastie Boys to Moby were part of it), but it was essentially a community defining their own identity through DIY record labels and live shows.\r\n\r\nThrough an academic lens, I picked apart why this movement worked. It needed a town to call home, a live music venue to draw people together, a studio to document their efforts, and a bunch of people who are more interested in music than money. And then I remembered the now-defunct youth club I used to visit.\r\n\r\nSo a week before graduation, I put myself to work. I wrote a proposition on the Sunday (I find the funding, you provide the space, we create an environment where young people can use music to build their own community), drove across the country to my hometown on the Monday, changed into a suit in my car and walked into the council offices with a freshly-stapled business plan.\r\n\r\nThey said yes, but only if I can find the funding. Councils never say no to funding.\r\n\r\nI could write a book on the next part, but you'll have to settle for a summary. In one month I raise £25,000. Twenty per cent becomes a part-time wage. I order £22,000 worth in equipment, but negotiate it down to less than £17,000. We install a very competent recording studio with a rehearsal space, and let these ingredients simmer to see what happens.\r\n\r\nFor many young people, it was transformative. I'm reading through the old case studies now, and I'm fondly reminded of calls from teachers seeing improvements in class, or the mother whose daughter just seemed happier at home. Words like 'confidence' and 'ability' keep appearing, and I'm struck again at the story of the boy with Aspergers who wouldn't sing until his third week. These examples only skim the surface, but it was significant for all of those involved.\r\n\r\nTwo years later, I left the studio in their capable hands. The teenagers it was built for had taken charge of their own ship, and I had achieved my life's first serious ambition. My next was to become a journalist.\r\n\r\nI'm telling this story for a simple reason. I think it could be replicated in hundreds (maybe thousands) of towns around the world.\r\n\r\nAll that fundraising, studio engineering and management was hard work, but you're already connected to an internet which can guide you. Hell, I could recommend a tonne of books that would tell you everything you need to know. They worked for me.\r\n\r\nDo you know someone with enough drive to make it happen too?\r\n\r\nIs it you?\r\n\r\nIf so, send me an email. I still have all the business plans and equipment lists, and could throw in a bunch more tips to avoid certain pitfalls.\r\n\r\nMaybe some of you will take it on, and maybe culture will be a little richer for it. Who knows.\r\n\r\nAs for me? I'm working from home and enjoying family life in the English countryside. I've learnt that you can do anything if you plan it right and work hard. You can talk and talk, but nothing happens until you get up and do it.\r\n\r\n\r\nTom Davenport\r\nplaymusic@me.com\r\nWiltshire, England\r\n\r\n\r\n", [2012, 7, 15]]