["[The Listserve] Words", "Nadine", "I received the Listserve selection email the day I passed my test to become citizen of the U.S. I thought that’d give me something to write about, but then I found myself sitting in front of a blank word document. Nothing. Which isn’t to say I have nothing to express, but rather that I’m not quite sure how.\r\n\r\nThis happens more often than it should. I’m a college senior studying film and journalism; in essence, I’m building myself up for a career of words, yet I often struggle to use them.\r\n\r\nSo instead, I’d like to share some (rather random) words from others. Often when you don’t know what to say, someone already has:\r\n\r\n“We can have in life but one great experience at best, and the secret of life is to reproduce that experience as often as possible.” — Oscar Wilde\r\n\r\n\r\nMaude: The earth is my body; my head is in the stars.\r\n\r\n[pause]\r\n\r\nMaude: Who said that, Harold?\r\n\r\nHarold: I don’t know.\r\n\r\nMaude: Well, I suppose I did, then.\r\n\r\n— Maude, Harold and Maude\r\n\r\n\r\n“My drawing was not a picture of a hat. It was a picture of a boa constrictor digesting an elephant. But since the grown-ups were not able to understand it, I made another drawing: I drew the inside of the boa constrictor, so that the grown-ups could see it clearly. They always need to have things explained.” — The Little Prince\r\n\r\n\r\nThe White Rabbit put on his spectacles. \"Where shall I begin, please your Majesty?\" he asked. \"Begin at the beginning,\" the King said gravely, \"and go on till you come to the end: then stop.\" — Alice's Adventures in Wonderland\r\n\r\n\r\n“All writers are vain, selfish, and lazy, and at the very bottom of their motives there lies a mystery. Writing a book is a horrible, exhausting struggle, like a long bout of some painful illness. One would never undertake such a thing if one were not driven on by some demon whom one can neither resist nor understand.” — George Orwell\r\n\r\n\r\nIf you write (journalism, screenwriting, or otherwise), please feel free to send me tips, advice, stories you've written. I’d love to read them.\r\n\r\n\r\n- Nadine\t\r\nnadinelistserve@gmail.com\t\r\nPennsylvania\r\n\r\n", [2012, 12, 9]]