["[The Listserve] The Path With No Choices", "Mahar", "I was surprised when I finally got the chance to say something to you. I wrote this few years ago when I had an inner battle with my faith. You know, the kind of thing that makes you ponder why life sometimes can be so unfair. I hope this will answer the question you've been asking the Universe.\r\n\r\nFor these past few weeks, I’ve been thinking a lot. I’ve been trying to find reasons. Answers for my why(s). Then I came up with this :\r\n\r\nThere is no such thing as free will. I never had a choice.\r\n\r\nEven if there is, They always leave me with cruel choices They force me to make. I never had a choice.\r\n\r\nI’ve had my time thanking the Universe. I’ve also had time blaming it on the Cosmic Irony. I’ve been through anger and I’ve also been to acceptance, back and forth. I got to the point where I could not go with this wandering-around-the-vicious-circle anymore.\r\n\r\nYesterday, it just occurred to me that I was wrong.\r\n\r\nChoices. Yes they have always been cruel. Of course They would never give us the easy way with choices.\r\n\r\nFree will. All this time, I’ve been closing my eyes and choosing to not see the big picture. It’s not about the choices or how cruel they are. It’s about the way you see them. That’s our free will. Choosing the way you see those cruel choices. It’s either you keep bargaining and angry with it or just accept and be grateful, for in the end whatever choice we made, it would turn on a dime. Sure the journey will be tough. But you can make it less hard by seeing them differently now.\r\n\r\nThere’s nothing you can do about those choices. It has to be made. Just believe that someday you’ll thank Them for the cruel path They’ve given to you for it helps you grow.\r\n\r\n“Valuable things have a way of being misunderstood in their own time.\r\n\r\nEveryone wants a quick fix, they always have.”\r\n\r\n\r\nMahar\r\nfierce.as.fire@gmail.com\r\nIndonesia\r\n\r\n", [2012, 8, 2]]