["[The Listserve] Playing in the Sandbox", "Kassia", "When I was in elementary school, maybe eight or nine years old, the school threw a fun event at night. I don't remember what it was called or what activities it offered, save one: a classroom filled with hundreds of craft supplies where you could make anything you wanted. This room had fabric, pipe cleaners, paper, paints, glue, wood scraps, wire, glitter, pottery, plastic shapes… and so on. It was a kid's dream come true and I spent quite a while in the room, creating things. I don't recall what I made, but I do remember my awe at all the cool stuff in that room, and I wondered why there weren't more kids in there taking advantage of it.\r\n\r\nToday, I work at a company that is just like that room full of goodies, but for adults. It's called Sandbox Industries.\r\n\r\nSandbox is an entrepreneur's dream come true, just like that classroom was a child's. If you are fortunate enough to become a Founder-in-Residence at Sandbox, you're free to start your own company - anything you can imagine - and make use of Sandbox's metaphorical room full of craft supplies to do it. Our Startup Foundry offers development, design, copywriting, finance, PR, and social media services to entrepreneurs so that they can build whatever they want from scratch. In other words, we give founders the tools they need to start a business, and all they need to do is be creative and enterprising enough to use those tools to their advantage.\r\n\r\nIt's amazing to see what happens in an environment that is truly creative and collaborative. These entrepreneurs aren't competing against each other. They're working side-by-side toward a common goal, which means that they learn from each other's successes and mistakes as well as their own.\r\n\r\nWhen I first started searching for jobs, I had no idea there was anything this cool out there. I stumbled into Sandbox by accident, basically. And it got me to thinking… What other amazing things are out there?\r\n\r\nI hope that, if you're not excited or satisfied by what you do, you find the place that is as fun for you as Sandbox is for me.\r\n\r\n\r\nKassia\r\nChicago, IL\r\n\r\n", [2012, 5, 10]]