["[The Listserve] Hello, world!", "Adam Tonks", "I wasn't really expecting to be given the chance to send out an email to everyone, so I'm not totally sure what I want to say!\r\n\r\nI'm a student, and I can't really cook, so I think the best thing I can do is send out a couple of really simple to make (yet still quite nice) recipes. (It might give some ideas to other students out there!)\r\n\r\nFirst one: Toad in the Hole. This one takes about 35 minutes from start to finish, incl. cooking time.\r\n\r\nIngredients:\r\n3 fat sausages\r\n1 heaped teaspoon white flora / trex / oil (or another cooking fat)\r\n1 large egg\r\n3 fl. oz milk\r\n2 fl. oz water\r\nPinch of salt\r\n\r\n1. Heat your oven to 220 degrees\r\n2. Put the sausages in a roasting dish, and put in a heaped teaspoon of white flora (or something similar like trex). If you don't have anything like that, I've found oil works ok too.\r\n3. Put them in the oven for about 10 minutes.\r\n4. While they're cooking, put the flour, salt, egg, milk, water, and salt in a bowl together and whisk it together until all the lumps are gone. I usually need to scrape around the side of the bowl with a spoon to mix in the stuff that sticks to the sides.\r\n5. After the sausages have had their 10 minutes, pour the batter over the sausages and put it back in the oven for about 20 minutes.\r\n6. Serve with whatever you like! I like to eat it on it's own, but I've been told that's weird.\r\n\r\nSecond: spicy beef meatballs\r\nThis one isn't as simple because it needs a spice mix called ras el hanout. They don't sell it in the supermarkets around the university, but I usually pick up a pot from waitrose when I go home, and it lasts for ages. I've included it here anyway because it's really nice (it's a favourite of all my flatmates). It also takes a bit longer to cook, about an hour and 20 altogether.\r\n\r\nIngredients:\r\n20 small beef meatballs\r\n200g cherry tomatoes\r\n1 large onion\r\n2 tsp. ras el hanout.\r\n\r\n1. Heat the oven to 180 degrees\r\n2. Chop the onion up, and put it in the dish with the tomatoes and meatballs\r\n3. Sprinkle the ras el hanout on top\r\n4. Cover with tinfoil and put it in the oven for an hour.\r\n5. Take the tinfoil off, squash the tomatoes and give it a stir.\r\n6. Put back in the oven, without tinfoild, for another 20 minutes.\r\n7. Take out and serve with pitta breads!\r\n\r\nFinally: cookies!\r\nThis is the simplest (and one of the nicest) cookie recipes I've found.\r\n\r\nIngredients:\r\n100g butter\r\n100g sugar\r\n1 large egg\r\n175g plain flour\r\n1/2 tsp. baking powder\r\n1 big bar of chocolate (I like dairy milk best)\r\n\r\n1. Heat the oven to 200 degrees\r\n2. Mix together the butter and sugar\r\n3. Mix in the egg\r\n4. Stir in the flour and baking powder\r\n5. Stir in the chocolate\r\n6. Cover a tray with tinfoil/greaseproof paper, put the dollops of the mixture onto the tray, and cook for 12-15 minutes.\r\n\r\nThat's all I have! Hopefully this will give some ideas to at least a few of you.\r\n\r\n\r\nAdam Tonks\r\nadam@adam-tonks.co.uk\r\nUnited Kingdom\r\n\r\n", [2012, 5, 13]]