["[The Listserve] Blossom", "Emily", "      She was sick of it all.  Sick of the contradictions, sick of the distance, and most of all, sick of the silence that ricocheted back and forth across her ear drums, more deafening than a collapsing building.  Polite conversation, with its one-worded banter laced in falsity, could be tolerated.  But the silence between them was painful.  She wondered what had happened to their relationship.  At one point they had been much more than just roommates; they had been best friends.  They knew things about each other that no one else knew, and they shared secrets that ranged from romance to regrets, from insecurities to ideologies.  Their close friendship had helped make the transition from small towns to college life easier for the both of them.  Although they had differing personalities, they seemed to complement each other.  But, most importantly, they had trusted each other.  Recently, all of that had disappeared without warning.\r\n\r\n      When it was time to leave, she didn’t say that she was heading to class.  She didn’t want to interrupt the silence, an invisible yet unforgivable barrier that had formed between them.  She didn’t owe an explanation for her departure, and she knew she wouldn’t have received a response anyway.  Besides, she was sick of trying.  She forced her work into a tattered backpack, stuffing notebooks filled with messy, looping handwriting and elaborate margin doodles in between a handful of novels and a laptop.  Hoisting the bag over her shoulder, she pulled a battered iPod out of her pocket, inserted the small headphones into her ears, and pressed play.  She breathed a sigh of relief.  Though it was temporary, her music allowed her to escape from the silence that smothered her.\r\n\r\n      Her class started at 2 o’clock, but her dorm was a good distance away from the English building, so she left at exactly 1:30.  She decided to take a bus halfway and then walk the remainder, allowing her to be one of the first to class but still giving her the opportunity to enjoy the beautiful sunny day.  The afternoon temperature was unusually warm, and the day seemed to belong in May instead of February.  This unexpected heat wave baffled the local weathermen, but it thrilled the students.  As she stood at the bus stop, she noticed a few tan, bikini-clad girls were lounging on beach towels outside of her dorm.  Several drivers stared at them as they drove by.  The bus pulled up next to her, and she felt a familiar rush of warm air graze her cheek.  She realized she was sweating.  She greeted the bus driver, courteously taking her headphones out of her ears and making eye-contact.  An old man with a beard smiled at her, and she smiled back and sat next to him.  She fiddled with her iPod, which she had put on Shuffle mode, listening to each song for about five seconds until she changed it, briefly moving from soft jazz to classic rock to hip hop in a rhythmic pace.  Her musical taste was eclectic, to say the least, much like her personality.  She refused to associate with one particular stereotype.  Instead, she dabbled in each one with no notions of stylistic identity, wearing what she liked and listening to what she wanted.  Each song, no matter its genre, represented something to her.  Sometimes it reminded her of an old friend or a past memory, while other times the bass line just seemed to reflect her mood.  She let her emotions choose the song, letting her thumb repeatedly press the “next” button while she stared out the window.  Finally, she settled on a fast-paced, top-40 track that reminded her of high school, a track that she used to listen to with her friends while they drove around town with the stereo turned up and the windows rolled down.  It was a track of innocent love, something she had once experienced.  She had forgotten how it felt, but after the first few lines she could feel her heart beating along to the familiar melody of the chords.  She thought back to that time and briefly admired how much simpler life had been then.\r\n\r\n      The song abruptly changed to one with repetitious bass pounding and loud, heavy guitar riffs.  She quickly forgot of her past, as the nostalgia of blissful immaturity faded away, immediately replaced with the new track’s rapid lyrics. She silently tapped her foot to the pulsating beat.\r\n\r\n      The driver lurched to a stop just as a guitar screeched in her ears, and she held on to the pole next to her to prevent herself from being thrown forward.  She grabbed her bag, squeezed out from the area that encased her tiny seat, and carefully stepped off the bus onto the pavement and headed toward class.  She walked slowly, admiring the way the bright sun shone through the naked trees, trees that weren’t ready to bloom and probably wouldn’t be ready for a few months, if that.  The winter had been abnormally harsh that year, and it was predicted that the trees would probably bloom later than normal as a result.  The vivid, recent image of the trees covered in snow sprang into her mind, and she realized a week ago, she had to wear a winter coat and gloves while walking to class.  Now, it was forty degrees warmer and anyone wearing a coat would be scalding.\r\n\r\n      She briefly glanced at the people she passed by.  Class had just gotten out, so the pathways were crowded.  Several groups of rowdy boys walked past, describing their drunken hook-ups from the previous weekend and rambunctiously slapping each other on the back.  They were all dressed similarly, wearing khaki shorts and pastel-colored polo shirts, their dark hair sticking out from underneath backward baseball caps.  They were tall and handsome, and they all seemed to have similar features.  Their collective good-looks repulsed her.  There was no variety; they were all the same.  Next to them walked large packs of girls, most of them blond and tan with thin, dainty physiques.  Some of them wore brightly colored sundresses.  Others wore tennis shoes and running shorts, though their neatly combed back hair and flawlessly applied make-up gave no indication of exercise.  They were all beautiful, but they blended together, no one face standing out amongst the others.  In the beginning of the school year, she had envied their apparent mass perfection.  She began dressing up to go to class and started wearing makeup.  Though she rarely wore earrings, she began to stick pearls into her ears every day, regardless of her outfit.  She even abandoned her tomboyish wardrobe and occasionally wore dresses or skirts.  But, soon enough, she got sick of it.  She grew sick of waking up early every morning to straighten her hair, to put together a perfectly matching outfit.  She grew sick of pretending to be someone she was not just to fit into a crowd of people that she did not resemble in the slightest.  Instead, she forced herself apart from her classmates.  She gradually got used to the fraternity boys looking right through her, as if she didn’t exist, and to the girls in class talking to each other but not to her.  She watched them converse as they walked past, but her music pounded in her ears, preventing her from hearing them.  As she walked, she noticed that she was the only one wearing jeans.\r\n\r\n      She looked down at her iPod as she approached the building, checking the time.  About ten minutes early.  Not too bad.  She systematically entered the building, walked down three flights of stairs, took a left, then a right, then a left again.  Before entering, she turned off her music, wrapped up the headphones carefully, and put the iPod into her pocket.  Then she entered, just like always.  The only difference was that, this time, she was standing in a room of emptiness.  The light was off, and the lack of windows made her feel as if she were standing in a cave instead of a classroom.  It was completely silent, apart from the humming of a computer that sat in the corner, its screensaver a series of random twists and turns that filled the screen with color.  This computer was the only source of light, and the screensaver’s colors faintly shined across the room onto the wall.  A technological rainbow.  She was mildly surprised at the unexpected abyss she was standing in.  Even though she was ten minutes early, she was never the first one to class.  She felt as if she were trespassing, even though she was in the right place.  She watched as the computer went into sleep mode, the screen blackening like the room around her.\r\n\r\n      She considered waiting outside in the hallway for someone else to arrive, but she decided to turn on the light switch next to the door instead.  She went and sat down in her usual seat.  The song she had just been listening to was repeating itself inside of her head; she quietly hummed and tapped her foot to the rhythm.  Out of boredom, she pulled out one of her worn notebooks, its pages nearly filled up even though the semester had only started a month or two ago, and finished a doodle she had drawn of a man that had popped into her head but probably didn’t actually exist.  She shaded his cheekbones with a stubby pencil, drew then erased then redrew his thick eyebrows, and lightly added eyelashes to his bright, wide eyes that seemed to be staring directly at her.  His lips were turned slightly upward in a mischievous half grin, as if he knew something about her that no one else did.  Once she was satisfied with her finished sketch, she awoke from her artistic trance and realized that she was still alone.  She turned on her iPod and glanced at the clock.  3:02.\r\n\r\n      Confused and suddenly worried that she was in the wrong room, she opened the door and looked at the room number.  It was then that she noticed the blue post-it on the door.  “No class today.  Office hours will be held as usual tomorrow.  Sorry for any inconvenience.”  While most students would probably celebrate this cancelation, she felt empty, as empty as the room she was standing in.  Instead of the interaction she longed for, even if it was forced, she was once again thrust into an abnormal solitude.\r\n\r\n      She walked down the hallway and joined the throng of people walking home.  Although she was submersed by the crowd, she still seemed to be set apart from them somehow.  She turned on her iPod and inserted her headphones to escape from the nothingness that surrounded her.  Here, she was the queen of her own world, a world with only one citizen.  Her world made sense; it was one of sound and song.  The bass drum of her heartbeat set the 4/4 rhythm and her footsteps pounded along in harmonized reverberation.  This beat was steady and calming, unlike the confusion that she felt as she glanced at the people that passed her by. She watched the crowd around her as their lips moved, almost synchronized, but no sound came out.  Concentrating intently on the rhythm that surrounded her, she looked ahead at the trees in the distance.  The sun brightened their bare, crooked limbs, and though it was still early in the year, she saw what looked to be a single white blossom slowly emerging to greet the unfamiliar sun.  Her smile bloomed.\r\n\r\n\r\nEmily\r\nVirginia\r\n\r\n", [2012, 4, 21]]