["[The Listserve] \"You Will Hang\" and Other Things you don't want to hear on a Saturday Afternoon", "Kip Silverman", "Hi fellow ListServians!\r\n\r\nIn 1987, I was at a civil rights march in Cumming, GA (Brotherhood March II).  I was grabbed by a coordinator towards the end- I was told to flank the woman next to me who was with a child in a stroller; there were people on the ridge next to us throwing rocks and bottles and screaming obscenities. As I tried to turn my body into a shield I directly faced these people screaming the most hateful and violent words I have ever heard uttered. I thought I had understood racism and prejudice. I understood nothing.\r\n\r\nI was becoming enraged. I wanted to fight back. As I began looking for a rock or anything, a chant was growing in the stream of marchers; I expected a confrontation until I heard what they were chanting. To fight the shouts of \"Nigger Lovers\" and \"You will Hang\" was a chant of \"We Love You\" in return.\r\n\r\nI didn't understand. How can people met with lifelong hatred and discrimination act in return with Love? In the face of people threatening to kill you, they reply with \"I Love You\".\r\n\r\nI broke inside. I collapsed. The people around me grabbed me, pulled me up and helped me to my feet. I heard the words beside me \"It's okay brother, I have you\" and I regained my footing and made it to the end.\r\n\r\nThere is a picture of me sitting on a curb shortly afterward looking exhausted and dazed. 25 years later I am still exhausted and dazed.\r\n\r\nI try to inform everything I do in my life with this experience- the morals I raised my three amazing daughters with, how I still to this day try to make changes in this ever-broken world of ours.\r\n\r\nThere are so many awful things that humans do to each other. I truly believe they can only be resolved with a genuine love and caring for each other. Unequivocally, everyone should have the same opportunity to equal treatment under law, clean food and water, safe housing, health care and good education. And mutual respect. I have not ever heard a single argument to lead me to believe anything other than this.\r\n\r\nThis is the underlying theme of the Occupy Movement. It's about everything really. But most of all, it's about love and respect for us all.\r\n\r\nEmail me if you want to read some of my poems.\r\n\r\nMuch Love and Respect to you all\r\n\r\n\r\nKip Silverman\r\nkip.silverman@gmail.com\r\nPortland, Oregon\r\n\r\n", [2012, 5, 20]]