["[The Listserve] Wanna be a star?", "Maureen", "Hi!  I hope that you're having a great day, I sure am! I got this \"you won the listserve lottery\" email on my birthday!   OK, since I've got a big audience: I teach high school in a detention facility for teen-aged repeat offenders.  One of the many things that we try to do for the kids is to give them some exposure to the different kinds of opportunities they might have as adults if they manage to hang in there and finish their education.  Most of the students in our classrooms have had little exposure to the wider world beyond grinding poverty and limited adult support.  That's where you come in (I hope).\r\n\r\nI am using this platform to ask you to do something for my students.  And maybe for students everywhere, who knows?  I'd like you to make a video, maybe 3-5 minutes, about what you do for a living.  If you can try to answer the following questions, that would be awesome: 1. What kind of work do you do (day to day duties and overall) 2. How did you come to do your job? 3. What kind of education or training does your job require? 4. What kind of salary, benefits, life enhancing joy does your job offer (either now or a range of projected earnings for a career) 5. How could a young person learn more about the kind of work you do?\r\n\r\nPlease feel free to interview your co-workers, show (legal!) video of what you do and projects you're working on or have completed.  Please do not feel like your job is not interesting enough.  My goal is to show a broad range of career opportunities to my students.  I will preview all the videos before sharing them, although I'm sure that none of you would send along something inappropriate.\r\n\r\nPlease upload the video to YouTube and then email me the link to maureenlistserve@gmail.com with any commentary that you feel might help or support your video.\r\n\r\nPlease do *not*: Tell us your last name or contact information in the video, although I would be glad to have that in the email that you send. Use gratuitous language or depict any violent or inappropriate images. Worry about the quality of your video - the students will be able to get something from it!\r\n\r\nI have no idea how this will turn out.  I'm really excited to find out.\r\n\r\nI'd like to thank you in advance for doing something to help out a bunch of kids who were born between a rock and a hard place.  \r\n\r\n\r\nYours in teaching and learning, \r\nMaureen \r\nmaureenlistserve@gmail.com\r\nThe Collaborative for Educational Services is the school I work for, just so you know where your stuff is headed. \r\n\r\n", [2012, 11, 13]]