["[The Listserve] The Loneliness of Extraversion", "Lee-Anne Bigwood", "Hi Listservians! This is a shorter version of something I wrote in April, which can be found if you search the title.\r\n\r\nThe Loneliness of Extraversion\r\n On a recent Sunday morning, I slept until my eyes were ready to open, rearranged my apartment, ate cake for breakfast, and read online news in total silence. I did two loads of dishes, returned library books, and watched bike polo in the park. I then found my favourite tree and sat under it to think about how amazing the previous few weeks had been.\r\nI hadn’t had a day without social interaction in more than two weeks, but Sunday, when I finally had some time to myself, I found that I would keep looking at my phone and try to decide whether to text or call or email or chat or bbm or ‘like’ activity or comment or message people. Amidst the solitude I had been seeking I still sought out the technological company of my peers. Sharing these experiences with people is what fuels my life, but the problem with being an extrovert, and a busy, well-liked one at that (cry me a river, I know), is that in the moments when you’re not surrounded by love and friendship, you feel very much alone.\r\n\r\nEmpty spaces seem bigger. The quiet seems quieter.\r\n\r\nEventually, after resisting the thumbscializing cycle of Facebook, Twitter, Pinterest, and G-chat, I succumbed to the compulsion of checking what was making that red light blink, and I responded to a few of the alerts adorning my status bar. Though I don’t regret doing so, I am glad I was able to hold off on them until I had appreciated my surroundings. These lonely moments are necessary, particularly to an extrovert. We function by way of external stimulation, but if we don’t give ourselves the time to wipe the slate clean, we’ll just be trying to catch up with the alerts of the stimuli that just happened an hour ago, a minute ago, a second ago…\r\n\r\nExtroverts! We need some time off! We need to trust ourselves that whatever activity we choose for the hour, afternoon, or even whole day, will be the BEST one. During the times when we turn our phones to silent or better still, leave them at home, we will be significantly more capable of being the best participators in activities, because we give ourselves to them fully.\r\n\r\n\r\nLee-Anne Bigwood\r\nlittlebiteswithbig@gmail.com\r\nToronto, Ontario, Canada\r\n\r\n\r\n", [2012, 7, 17]]