["[The Listserve] Maxine and the Radio", "Max", "Hello. Because you are a friend I've just not met yet, I'm writing this so that we might be a little closer. In this email I will: \r\n\r\n1. Tell you a little about what work's been like for me lately. \r\n2. Choose and present to you some rad radio. I love NPR. I am a walking pledge drive. I am not paid by National Public Radio. They don't know who I am. So great is my love for it, though, that I'm sending the love along to all y'all. In some ways the segments I mention below are like the beginners version of radio-- Radiolab and TAL are classic NPR staples--but in other ways I feel that they represent the absolute finest in radio listening pleasure. \r\n3. Say a couple things that need to be said. \r\n\r\n\r\nReady? Ronward!\r\n\r\n1. A day of work\r\nI just got home a little while ago. A lot of my work consists of getting on the phone and talk to people. Sometimes, on these calls, I get pissed off and the forked vein in my forehead bulges (I know this because yesterday I was on a Skype conference call, and the vein popped out when I was trying to make a point that seemed really important at the time. I should probably get my blood pressure checked.) The window in my office looks right onto a lawn; a small woods starts at the edge of it, and beyond, there's a river. Every so often, when I'm sitting at my desk, two or three deer leap out of the foliage and nibble at leaves. I take pictures of them with my camera phone. Generally, the pictures do not turn out. \r\n\r\n2. This is NPR\r\nListen to THIS WHOLE SHOW: Radiolab, Season 6, Episode 2 'After Life'\r\nBe obsessive about THESE 14 SECONDS: Radiolab's original open, particularly the part where the lady says \"and this is NPR\". \r\nExperience the WEIGHT-LIFTING SNOWMAN: \"We did it!\", This American Life, Episode 323, Act 2, 'Super Duper'\r\nRegularly make yourself an actual good American by listening to THIS SHOW ALL THE TIME: American Roots\r\n\r\n3. The truth of the matter is:\r\nCompassion and forgiveness are the most important things. \r\nThe Hunger Games trilogy had engrossing, even great stories... but they were not actually that good as books. \r\n\r\nListen for the win,\r\n\r\n\r\nMax\r\nMaxineandtheradio@gmail.com\r\n\r\n", [2012, 5, 21]]