["[The Listserve] In praise of big fish in small ponds", "Keith Kahn-Harris", "Dear The Listserve people\r\n \r\nI doubt you'll recognise my name.\r\n \r\nI'm not famous. I'll never be famous.\r\n \r\nBut I have always aspired to be 'someone', a person who made some kind of small but significant contribution to 'something' . As it happened, I found such a modest niche. I'm a sociologist, working on two very specialised areas - the sociology of hevy metal and the sociology of the British Jewish community. Needless to say, there aren't many of us working in either area. I'm really just a reasonably big fish in a couple of pretty small ponds.\r\n \r\nSo for the last few years I've made a joke about being such a big fish in a small pond. I've said that really I'm just like 'the best water skier in Luxembourg'. Needless to say I didn't know anything about water skiing in Luxembourg.\r\n \r\nBut about a year ago I had a brianstorm: why not go and meet the best water skier in Luxembourg? Why not write a book about him/her and about other big fish in small ponds too? The idea seized me with excitement. This could be a polemic against power and celebrity, a celebration of the unknown heroes in obscure small worlds, a tribute to commitment and community.\r\n \r\nSo I've been working on the book. I actually met the best water skier in Luxembourg last year and I'm preparing further trips to visit such other obscure figures as the Icelandic special forces, the top novelist in Suriname and the best heavy metal band in Botswana.\r\n \r\nThe book is being crowd-funded so I need the help of strangers to complete my project. You can't post links on The Listserve but if you google 'best water skier in Luxembourg' or e-mail me, you can find out more.\r\n \r\nIn the meantime thank you to The Listerserve for making me a little bit famous for one e-mail.\r\n \r\nYours\r\n \r\nKeith Kahn-Harris\r\nLondon, UK\r\nkkahnharis@yahoo.co.uk\r\n\r\n", [2012, 7, 9]]