["[The Listserve] Olympic athletes and donuts", "Ken Childs", "Every four years the Winter Olympics comes strolling through and, if you’re like me, you become captivated by not just the sports (seriously, curling is awesome) but the athletes involved in them.  The various production companies tend to do a great job bringing life stories of athletes from across the world into your living rooms and getting you to not just care about how your respective country is doing (Latvia’s winning a gold medal in Men’s skeleton, you can quote me on that) but how important this chance of a lifetime is to someone you’ve never met.\r\n\r\nI’ve been fortunate enough over the last few years to get involved in writing about the winter sliding sports of bobsled (or bobsleigh if you’re not reading this in America), skeleton and luge.  In that time I’ve met some amazing athletes with amazing stories, not just those who are at the Olympic level, but with so many other people working hard to get to that level.  There are people who are working two and three jobs just to support a dream to one day represent your country in the Olympics, and the hard work and effort these men and women put in is definitely something to applaud, even if they never do reach their dream.\r\n\r\nThe more you read about people like Steven Holcomb, Elana Meyers, Noelle Pikus-Pace, John Daly (the Olympian, not the golfer, though I guess him too), Erin Hamlin and folks like that, you’ll likely find yourself more motivated to try to accomplish things you dream about.  Personally, learning about their selflessness, hard work and determination led me to try to better myself.  I’ve lost 55 pounds since April, have started learning some German and have really tried to not let “I can’t” be something I deal with anymore.\r\n\r\nAs Sochi 2014 comes inching closer and closer, please take the time to support your Olympians and National Team members in various sports.  They’ll appreciate it far more than the overwhelming majority of major league pro athletes ever do.\r\n\r\nA few other things:\r\n- If you’re looking to get a pet, make sure you check out your local shelter or rescue organization first.  My boston terrier, Deacon, is amazing, showed up crate trained and house broken and is by far the best dog I’ve ever had.  Why not help a poor little guy or girl out and make both of your lives better in the process?!\r\n- If you have one motorsports event to check out all year, make sure it’s either the Continental Tire Sports Car Series at a regional road course or the NASCAR Whelen All-American Series late model stock race at Martinsville Speedway.  Honestly, just go to Martinsville, you’ll feel better about yourself later.\r\n- You’re never completely finished with laundry until you’re naked.\r\n- Krispy Kreme is a far superior donut product to Dunkin Donuts for most flavors.\r\n\r\nKen Childs\r\nDurham, NC, USA\r\nken@kenchilds.com\r\n\r\n", [2013, 3, 5]]