["[The Listserve] Short Lived Opportunities and Lessons in Life", "Albert Mayzeles", "Dear Fellow Humans,\r\n \r\nWhat is our unifying core aspect at listserv? Our inherent humanity.\r\n \r\nRecognizing that our human experience transcends physical qualities, is a powerful notion. We as individuals are unique, but our commonality runs much deeper. As homo sapiens to our further primordial roots. \r\n \r\nWe each experience emotion through the same framework. Synapses and neural networks, electrochemical signals pulsating inside. \r\n \r\nI am honored to be granted this opportunity to share. The listserv is a special community. \r\n\r\nIf from this letter I can plant a seed in your mind and actions, that would benefit your experience, then my investment would forever be justified.\r\n----------\r\n \r\nYou cannot force lessons onto anyone. You can only offer ideas to ponder.\r\n \r\nA good teacher guides her students on a path of discovery. Through this self-discovery, we as students incorporate and ingrain lessons.  \r\n \r\nThere are learning opportunities all around us. We are entities perceiving and absorbing experience, and manifesting emotion. \r\n \r\nI am most amazed, at the power we have to influence ourselves and change our thinking. Novel experiences and ideas are the building blocks of growth.\r\n \r\nSelf-Talk: Helmstetter will help you choose, then reinforce or replace habitual patterns. This powerful strategy of self-influence has helped mold me and granted tremendous personal conviction.\r\n \r\nMy advice on moving past negative reactive states/triggers, is by recognizing the abstract space between stimuli and response. You will only find this within self-reflection.\r\n \r\nThe more you actively and consciously, focus on this space, the stronger you develop your internal locus of control.\r\n \r\nPause, before you have a typical reaction. Conceptualize on this gap of experience. Next time, pause a bit longer.\r\n \r\nYou will start to gain control over your own mind. This is a practical exercise for you to consider for increasing active engagement.\r\n \r\nAwareness is important. You must see yourself from beyond your ego. Observe your ego, be curious of it, but remember you're not solely your own self-identity. Identity is important, but what else guides us?\r\n \r\nStep outside of your mental map to discover alternative truths.\r\n \r\nPerception is what guides our beliefs, determination builds our values, and attitude shapes our future.\r\n \r\nPeace in Every Step,  practice taking conscious breaths, pausing, and reminding yourself of how special it is, that we are even here. Diaphragmatic breathing.\r\n \r\nIf you are curious to learn from some of my mentors, books that have had profound personal influence,\r\n \r\nMastery: Leonard \r\nFlow: Csikszentmihaly\r\nInfluence: Cialdini\r\nBuddha's Brain\r\nWhack on-the-side of the head\r\n \r\n-------\r\nLearn financial literacy. Start with fundamentals: Interest-rate, inflation, compound-growth, investing and savings.\r\n \r\nConsider each $ you spend an investment into your happiness. Evaluate both your short and long-term desires.\r\n \r\nLive as you'll die tomorrow, but plan as you'll live forever.\r\n \r\nDefend your credit vigilantly. In a world with unprecedented central banking manipulation, your credit will become more valuable as time moves forward.\r\n \r\n---Write your thoughts down!---\r\n \r\nEmpiricism is not the only form of knowledge. Our tools of measurement are still developing. Epistemology\r\n \r\n-------\r\nThere is much truth that is still elusive, keep listening and sensing.\r\n\r\nBalance is the key.\r\n\r\n-------\r\n\r\nI humbly ask, if you gained any value from this letter, that you too, email me your lessons of wisdom, insight, advice, inspiration, recommendations, or anything that you feel is valuable for others to hear. \r\n \r\nWhat impactful experience can you share?\r\n \r\nIf I get many responses, I will create a blog, to spread our collective lessons. It might take me a while.\r\n \r\nBut we are in this together, helping our collective conscious grow toward actualization. It starts with you first.\r\n \r\n\r\nWith sincerity, may you live the greatest life you can envision.\r\n\r\nAlbert Mayzeles\t\r\nShareAlesson@gmail.com\t\r\nVallejo, CA\r\n\r\n", [2013, 7, 21]]