["[The Listserve] a girl called Emily", "Ethan", "Three summers ago, I am a fourteen year old boy on a summer camp, trying to avoid accepting that I am gay. On that camp is a girl I’d never met before, with big brown eyes and great music taste. Her name is Emily and as fourteen year olds on summer camps do, we become friends. On the last night of the camp, Emily goes to the disco ’with’ a girl, and tells me later that she thinks she might be bisexual.\r\n\r\nAfter that conversation, I am inspired by seeing for the first time someone who could be open and proud about not being straight. On the spot I resolve to have come out by the last night of the next summer’s camp. I’d never before even considered telling people I was gay.\r\n\r\nThe camp ends, Emily and I speak online a few times, and somehow manage to always go to the reunion that the other one misses. Eventually, the conversations fizzle out, but I always have in mind the prospect of thanking Emily after I’d come out, of telling her that she’d changed my life without even realising.\r\n\r\nEaster Sunday 2011. Sitting in a tree, I come out to my best friend.  By the end of May, I am coming out to my sister, who whilst being supportive, asks me to postpone coming out to our parents and everyone else until her exams are over. I understand, and comply, putting off that conversation with Emily another few weeks.\r\n\r\nIn June, I find out Emily has killed herself. I never get to say thank you, never get to let her know what she did for me. I try to stop myself thinking about what could have been if I’d come out sooner, because there’s no point.  I’ll never know whether being aware what she had done for me would have saved her. It’s too late now.\r\n\r\nI don’t suppose that my story has a moral. But I know that I can never again allow myself to let friends slip away, thanks go unsaid or anything be left until tomorrow.\r\n\r\n**However, I want to use this opportunity to do more than tell a sad story. I’m asking you to donate some money to charity, however small or large a sum, in memory of Emily. What would then be amazing would be you emailing me the name of the charity you donated to and (if you want) the amount you gave. I could then email you all back, telling you how much money was donated by all of you in total, so you could see the difference the Listserve can make collectively.**\r\n\r\nMy friend deserves to be more than a sad story or a teen suicide statistic. Please, allow her to be your inspiration as well. I can’t change the past but you can all help to create a better future.\r\n\r\nThank you all so much,\r\n\r\n\r\nEthan\r\nethanfromlistserve@gmail.com\r\nLondon\r\n\r\n", [2013, 3, 27]]