["[The Listserve] Dear Friends", "Trevor Larch", "I admire a person who is passionate about something.  Whether it is their work, hobby, craft, or other subject of expertise.  I am constantly teaching myself new things, and I feel like I don't have one passion that I can really say defines who I am.  I'm afraid in the end, I'll be decent or good at many things, but not amazing at any one thing.  I love the learning process, and I wish I could get to the point where I could \"wow\" someone with what I can do.\r\n\r\nI'm a 25 year old mechanical engineer by trade, but outside of work, I'm a singer, songwriter, musician, producer, programmer, designer, gamer, adventurer.\r\n\r\nWhen I was younger I always wished I had a pen pal that lived on the other side of the world.  I've always wanted to get to know other people who live differently and with an open mind, coming from all different kinds of backgrounds and have all sorts of interests.  I'd love to hear about what you do, your passions, how you live, whether or not we share similar tastes and interests.  Please feel free send me an email.  I'd love to make your acquaintance, and maybe even become friends.  I apologize if I don't get back to you right away.  I have no idea how many of the Listserve may be interested, if any.\r\n\r\nThough extremely tempting, I don't want to plug any of my own projects, blogs, or music, but I do want to mention my fiancee's passion.  She is a ceramic artist who creates beautiful sculptural wall tile installations.  You can see her work at sarahheitmeyerceramics dot com.  Because of storage reasons, she's trying to focus on smaller work, but would love to create a larger scale piece for a business or public building that's looking for something different to fill a space.  Even if you aren't interested in buying any work, if you let her know you enjoy her work, I think it would mean a lot to her.\r\n\r\nAnd finally, a shout out to master improv comedian Matt Sears who introduced me to the Listserve.  If you're into video games, you'll likely enjoy his web comics (search \"seitbeit\").\r\n\r\nLooking forward to meeting you!\r\n\r\n\r\nTake care,\r\n\r\nTrevor Larch\r\ntrevorslistserve@gmail.com.\r\nAlfred, NY\r\n\r\n", [2013, 10, 4]]