["[The Listserve] Stateless Mojo", "Mojo", "Hi, my name is Mojo and I do not have a country.\r\n\r\nI hold an Eritrean passport like my father,\r\n\r\nbut I have never even been to Eritrea.\r\n\r\nThe country is unsafe.\r\n\r\nI am Saudi born and raised, but I cannot live in Saudi.\r\n\r\nThe country does not grant citizenship or residency rights by birth.\r\n\r\nI lost my temporary Saudi residency while in the US\r\n\r\nstudying at Texas A&M University.\r\n\r\nI am in a limbo.\r\n\r\nI cannot go to Eritrea.\r\n\r\nI cannot remain in Saudi Arabia.\r\n\r\nI cannot go to the United States.\r\n\r\nI have been removed from everyone I have ever known or loved.\r\n\r\nI have been a refugee for the past two years, traveling as a tourist to avoid persecution and deportation to one of the world's worst dictatorships and police states.\r\n\r\n\r\n\r\nWhat really matters to me?\r\n\r\nMusic.\r\n\r\nHowever, I have let my circumstances dictate my life.\r\n\r\nIn my religious Muslim family, music is considered the voice of the devil.\r\n\r\nI am torn between my passion and my fear of disappointing my parents.\r\n\r\nWe all have our excuses for not pursuing our dreams.\r\n\r\nI’m sure you can relate.\r\n\r\n\r\n\r\nI lost my voice the day I left the United States.\r\n\r\nI have been silent for two years.\r\n\r\nI cannot live in silence any longer.\r\n\r\n\r\n\r\nMy commitment: I will no longer live in fear.\r\n\r\nI turn 10,000 days old on February 5, 2014.\r\n\r\nOn that day, I will kick off my journey to travel the world.  I will release my first music project online.\r\n\r\nI may face hardships.\r\n\r\nI may face limitations.\r\n\r\nI will persevere.\r\n\r\n\r\n\r\nWhy travel the world? Beyond an obvious interest in people and culture, the reason I want to embark on a journey around the world is because I need to liberate myself and find a home. If I had a country I would just go to it but I carry a passport of a country that enslaves its own people. My nominal relationship with Eritrea has crippled me.  My fear of being sent there controlled me for the longest time and I finally said to myself:\r\n\r\n\"If I cannot go to Eritrea, I'll just go to every other country in this world.\"\r\n\r\n\r\n\r\nI’ll travel to get my voice back.\r\n\r\nI’ll travel to live my passion.\r\n\r\nThis is what this journey is about. If you want to follow my journey, I’ve created a blog: mojoyeah dot com.\r\n\r\n\r\n\r\nMy email is below. Please do write to me.\r\n\r\nI want to know your story, and what’s been holding you back.\r\n\r\nMaybe we can all help each other, and change life for the better.\r\n\r\n\r\nSincerely,\r\n\r\nMojo\r\nmrmojoyeah@gmail.com\r\nJeddah, Saudi Arabia\r\n\r\np.s. if you know a talented music producer who would be interested in working with me, please connect us.\r\n\r\n", [2013, 7, 28]]