["[The Listserve] happiness", "mon", "A bit rushed but, hello world!!\r\n\r\n\r\n Life is a funny little thing. \r\n\r\nYou try your hardest for something, but don't get it. You can get angry, cry, be frustrated and it will never happen. You don't expect it, and it shows up on your doorstep. The thing you never sought to pursue is all yours. \r\n\r\nIt could be as simple as a smile from a stranger. As rough as an argument. A struggle in your journey. The memories of the past.\r\n\r\nLife brings people together.\r\n\r\nIn the most strangest of ways. One day they are there, and the next day they are gone. And then they come back again, in a new light, and better than ever. It could be the start of something, or the realisation that there is something better.\r\n\r\nLife is about the moments.\r\n\r\nThe smiles, the laughs. The moments of butterflies and the moments of deep despair. It is about the roller-coaster we experience as we lean in for our first kiss, the pit in our stomach as we walk away. The way they feel when we run into their arms, when we see our children, when we are travelling across the world landscape.\r\n\r\nLife is simple.\r\n\r\nStanding in the rain. Smelling in the freshly cut lawn. Hearing the waves as they softly lap the shore. Feeling the heat from their hand.\r\n\r\nLife is happiness.\r\n\r\n-----------------------------\r\n\r\nAnd to you,\r\n\r\nI really enjoy spending time with you, even if we're just going to be sitting around and talking about nothing. There are a million things I love about you, like your nose or the way you smile, the way you look me in the eye, too. And I just get the greatest feeling when I make you laugh. I feel as if my company makes you happy, and that's what I wish for you; for you to be happy. And when I see you laugh at my clumsy ways, it just makes me want to spend the rest of my life with you so I can see a smile on your face.      -- from Tumblr\r\n\r\n-----------------------------\r\n\r\n\"To love at all is to be vulnerable. Love anything and your heart will be wrung and possibly broken. If you want to make sure of keeping it intact you must give it to no one, not even an animal. Wrap it carefully round with hobbies and little luxiries; avoid all entanglements. Lock it up safe in the casket or coffin of your selfishness. But in that casket, safe, dark, motionless, airless, it will change. It will not be broken; it will become unbreakable, impenetrable, irredeemable. To love is to be vulnerable.\"      -- CS Lewis, The Four Loves\r\n\r\n-----------------------------\r\n\r\n\"We often take for granted the very things that most deserve our gratitude.\"      -- Cynthia Ozick\r\n\r\n\r\n\r\nThank you ^^\r\n\r\nmon\t\r\nmoneeka91@gmail.com\t\r\nSydney, Australia\r\n\r\n", [2013, 1, 26]]