["[The Listserve] Some thoughts", "Maarten Pronk", "I was caught unawares by the mail that I’ve won the Listserve Lottery.\r\n\r\nI’m working for a deadline next Tuesday and I am quite stressed as an architecture student. But I realized this is a rare chance to broaden my worldview.  So please feel free to comment on my mail and point out where I’m wrong.\r\n\r\nI have a thirst for knowledge. I read a few books every month and try to discuss them with peers. Every interesting subject I come across leaves me knowing less about the world and wanting to know more.\r\n\r\nI am in a position to do something, brought up in one of the wealthiest countries in this world, and I am grateful for this. I don’t know if grateful would be a correct word, because for me thankful feels hypocrite, thanks I have it better than some kid in the slums. I want to do something about that.\r\n\r\nWhat is your vision of the future? Can you back-cast such a future? Imagine a future and think about what you need to do now  for that specific future. Is it naïve to think about green roofs and free energy in the next few decades? It leaves a huge food problem. How can we eliminate poverty. Is it possible to modernize the world. Do you think that family planning, emancipation for woman is the best way to do this?\r\n\r\nIn an ever changing world, how far can our empathy extend? In history from family to tribe, to religion, to country. Can we now feel empathy with the whole world? This mail reaches 21647 people. I can reach and read something from the other side of our little globe in space for the first time in the ~150.000 years of human existence. Boundaries, politics, factions, religions, nations, race seem to divide us, but we’re all humans, all even and all here.\r\n\r\nWhat is next? I wouldn’t say Mars. But it is a goal that is beyond this world.\r\n\r\nSo when I think about this I feel utterly inept. But am I so wrong? All those naïve dreams during all these centuries of human suffering, are those dreams finally possible?\r\n\r\nProbably I’ll lose my ideals in some years. Possibly I won’t change much in this world, if anything, before I die.\r\n\r\nBut until then I want to be aware of my fellow humans. So from me to you;\r\n\r\nHello.\r\n\r\nMaarten Pronk\r\nDelft, The Netherlands\r\nlistserve@evetion.nl\r\n\r\n", [2013, 1, 17]]