["[The Listserve] Apple pie for autumn", "David Garrison", "life is a bit hectic right now, but here is my grandma's apple pie recipe. It is the only apple pie that I will eat. She is the kind of person who would, for the dough, say \"mix it and then add water or flour until it feels right,\" so it was tricky turning that into a recipe, but these are the instructions that i follow when making it. (i usually make a double batch) Good luck :)\r\n\r\nFor one \"medium\" sized apple pie.\r\n\r\n-1 cup shortening\r\n-2 chips flour\r\n-5 jhonnagold apples (other cooking apples will work but jhonnagold is my preferred apple) \r\n-sugar and cinnamon\r\n-a dribble of milk or half and half\r\n\r\nPreheat oven to 350.\r\n\r\nCrust: \r\n-Mix 1 cup shortening, 2 cups flour, 1/2 cup cold water, put in fridge\r\n-getting a perfect consistency takes some practice, but it isn't as absolutely vital as some would make it sound. it should have a very slight shine to it, but not be very sticky. Add more flour if it is sticky, more water if it's not shiny.\r\n\r\nApples: \r\n-skin and slice/chop up apples\r\n-size of chunks of apple is a matter of preference, i make mine fairly small\r\n\r\n-sprinkle some sugar on the apples in a mixing bowl (specific amount is not vital, i promise)\r\n-sprinkle some cinnamon and then \"accidentally\" open the spoon side instead of the sprinkle side and dump \"way too much\" cinnamon on them (I've never had too much cinnamon, but i keep trying)\r\n\r\nPutting it together:\r\n- take half of the dough and roll it out and put it in the bottom of a pie pan\r\n-dump in apples. There should bee a heaping pile of them.\r\n-moisten the outer edge of the crust to get the top crust to stick to it.\r\n-roll out the other half and lay over the top, sticking the edges of crust together.\r\n-dribble some milk or half and half over the top and sprinkle some sugar on it to help it brown.\r\n-cut a fun pattern in the top to let air out (small details well be lost when it cooks)\r\n-cook for around an hour. Juice from the apples should be bubbling, crust should be golden.\r\n-cool, serve\r\n\r\n\r\nDavid Garrison\r\nDbellgar@gmail.com\r\nBellingham, Washington, U.S.\r\n\r\n", [2013, 10, 2]]