["[The Listserve] 300 miles", "Greg", "The drive from Seattle to my home on the border of Idaho takes four and half hours. I've made that trip nearly 60 times in my life. It is  numbing driving through monotonous swaths of field and desert yet there is ample time to think. One's mind opens like the sky, but somehow I end up thinking about mundane things: the grading I needed to do, the crap screenplay I'll never write, how I forgot to clean the litter box before I left for vacation. Never anything profound or life-affirming.\r\n\r\nA few years ago, traveling home with my family, we were the second to arrive at an accident. Law, I believe, mandates we must stop. I asked my family to stay put as I bolted from the car. I was going to show my mettle. I was going to be a hero. Surveying the scene, I noticed the most damaged vehicle belonged to a family with two daughters not unlike my own and my world changed.\r\n\r\nAs I neared the car, time slowed. The first child - young, maybe 4 or 5 - thrown from the car and in shock, sat on the sandy shoulder of the road running her hands across the ground. A young woman, from the car behind mine, wrapped her in a blanket and gentle words. I stopped a few feet from the crushed cars, unable to move further. At the sight of blood and the sound of the parents crying and moaning, I realized that I could do nothing. Another woman rushed to the car and sternly demanded I leave. As I turned I caught a glimpse of the second child in the backseat staring at me blankly. I did not look back.\r\n\r\nThe rest of drive home I fought back tears for that family mixed with the pain of being terribly ashamed of myself. I felt humbled and strangely vulnerable. \r\n\r\nI have traveled the same road many times since that day. Whenever I round that particular corner, I slow down and look to see my girls in the backseat. And for a few miles, I think about that day.\r\n\r\n\r\nGreg\t \r\ngreg.turnerrahman@gmail.com \r\nWashington State, USA\r\n\r\n", [2013, 2, 28]]