["[The Listserve] Nixon and/or soup", "Andy Barr", "Dear all you people:\r\n\r\nDo any of you happen to own, or know somebody who owns, a print of Philippe Halsman's 1955 photograph of Richard Nixon jumping?\r\n\r\nIf so, I would like to buy that print from you, or from that person you know.\r\n\r\nFrankly, if you have any cool Nixon swag, email me.  (Nixon is fascinating to me because he proved that being enormously powerful and being a cripplingly emotionally-flawed person are not mutually exclusive.)\r\n\r\nI realize that using this platform to hunt for political collectibles is an arguably selfish act.  And I don't have any meaningful life advice to offer total strangers.  I don't know any of you people.  Maybe you shouldn't be reaching for the stars.  Who knows?  It's not really any of my business anyway.\r\n\r\nBut perhaps you'll be less mad at me for wasting your time and dismissing well-intentioned affirmations after you've had some soup.  (Based, I admit with some shame, on an Emeril Lagasse recipe.)\r\n\r\n1. Heat some olive oil in a big pot.  Chop the following: 1 large white onion, 4 ribs celery, 4 carrots, 1 poblano pepper, 1 yellow bell pepper.  Put it all in the pot and stir it around until it looks different.\r\n\r\n2. Mince a ton of garlic and a jalapeno pepper.  Leave the damn seeds in.  Don’t be difficult.  In fact, just for getting all wimpy, make it two jalapenos.  Add all that to the pot.\r\n\r\n3. Add some dried oregano, some cumin, some chili powder.  Also mince a couple of canned chipotles and add those, along with a spoonful of the adobo they came canned in.  And then a 14 oz can of diced tomatoes.  Stir it around your kitchen smells good.  Maybe you have a bay leaf lying around?  Throw that in.\r\n\r\n4. Add a shrink-wrapped package's worth of big, quivering, factory-farmed, lazy American boneless skinless chicken breasts and 64 oz chicken stock.  Yes, by all means, use your homemade artisanal stock.  Good for you.  Bring to a boil, reduce to simmer, let it cook until the chicken’s cooked through.\r\n\r\n5. Get the chicken out, let it cool, shred it, and put it back in the pot with an unreasonable amount of lime juice.  Like a third of a cup.  By which I mean a half cup.  Oh, and a bunch of chopped scallions.\r\n\r\n6. Serve with a handful of Tostitos Hint of Lime (yes, the brand matters – these have some kind of weird fake sour cream powder on them, and as the chips soften and dissolve, the soup gets a little creamy) and some cilantro.\r\n\r\n7. Eat the soup.  Do not photograph it.  Do not Tweet about it.  Do not use it as a metaphor for the lessons you’ve learned in your 23 years on this crazy planet including a whole eight months in Peru where you totally found yourself.  Just eat the soup.  And let me know if you have a line on any Nixon stuff.\r\n\r\n-- Andy\r\nandybarr@gmail.com\t\r\nWashington, DC\r\n\r\nP.S.: For more recipes, occasional analysis of current events, and absolutely no inane yearbook-quote life advice, follow me on Twitter: @bustipsover\r\n\r\n", [2013, 2, 4]]