["[The Listserve] The Walls Fell Down", "Dana", "I have an incredibly complicated relationship with the place I came from. But I guess, truthfully, so does everyone. See, I’m from West Virginia. Now, I know for a lot of people that conjures images of “rednecks” and “hillbillies” shooting deer and opossums in the mountains while drinking homemade moonshine on the porch of their log cabins. I kind of feel like I’ve had to carry that assumption my entire life. Most people’s reaction when I say “Oh, yea. I’m from West Virginia!” isn’t “What a beautiful state! With such rich history!” It’s normally “Oh….” Followed by a quick look at the watch and a dash in the other direction. Great for making friends.\r\n\r\nI love West Virginia in the way you might love a senile grandmother. She helped raise you and in general, she’s well meaning, but she also likes to shout racist things in public and can’t help walking outside without clothes on from time to time. I want to be proud of my state in the flag waving way so many people I grew up with are, but I can’t help but only quietly come to her aid when someone starts getting down on some of her more unusual habits.\r\n\r\nBecause in a lot of ways, those criticisms are well founded. There appears to be very little hope of advancement for so many people in the state. Literacy isn’t always a number one priority. Many of the jobs like coal and steel that were instrumental in bringing jobs and commerce to the state have left leaving people unemployed and with little training to be used in other professions. We’re ranked the unhappiest and one of the most obese states in the nation. Poverty is rampant in so many areas of the state and there doesn’t seem too much to be done about any of it.\r\n\r\nAnd therein lies my conflict. I recognize the problems and feel like I should do something to help but my first reaction has always been to run. As soon as I realized how isolated I felt by the state I was supposed to call mother, I mapped out an escape plan ready to leave. And I did. I left. Call it abandonment; call it copping out, but no matter.\r\n\r\nThere’s always one feature that I always come back to, though. It always strikes me when I leave the state how…flat everywhere else feels. When I cross into Ohio over the river on my way to anywhere else, it always feels like the walls fell down. It always seems like I can see for miles and in a lot of ways I feel very exposed. I guess I got used to my Mountain Mama keeping up castle walls to protect me. And I always, always miss the mountains when I leave.\r\n\r\nI think West Virginia is easily the most beautiful state in the Union. Driving through it during the fall is breathtaking. It looks like the hills caught on fire. For me, that’s enough to keep my coming back.\r\n\r\nHere’s hoping your country roads take you wherever you call home.\r\n\r\n\r\nLove,\r\nDana\r\nwheresdana@gmail.com\t\r\nWashington, D.C.\r\n\r\n", [2013, 6, 8]]