["[The Listserve] Go build a fort", "Laura Bailey", "Seriously, forts are great.  We should all build forts more.\r\n\r\nNot all who wander are lost.  In the media, my generation (millennial) gets a lot of crap for not falling into place these days.   A lot of the criticism aimed at this group centers around us not getting and sticking with jobs.  Many of my friends, all recently graduated from college, have been bouncing around various internships and entry level jobs for the past 2-3 years just trying to find something that fits.\r\n\r\nI have wandered in and out of many different jobs, activities, sports, and hobbies in my life and I’ve learned something valuable from each one.  Mostly, I’ve learned that if you don’t stick with something you won’t get good at it, but hey, that one takes a while to sink in. And sometimes, you just know when something isn’t right for you. Like ballet, that one probably isn’t going to happen for me (I was kicked out of gymnastics when younger due to lack of flexibility). Since college, I have grown less and less sure of what I want to do in life, in terms of a career. This insecurity isn't exactly comforting but it has opened my mind to a lot of new possibilities I hadn't considered before.\r\n\r\nI think it’s ok that a lot of us are wandering.  Maybe more of us will actually end up in careers we enjoy and doing what we were born to do.  There’s bound to be a lot of confusion, anxiety, and failure before we figure out what that is.  It may not look like it right now, but I think we’re collectively onto something.  We’ll get there.  Just give us time.\r\n\r\n\r\nMusic Recommendations:\r\n\r\nOcean by John Butler- I was introduced to this piece a while ago and I still think it is one of the most beautiful pieces of musicianship I’ve ever heard- thanks buddy\r\n\r\nSteeldrivers-really solid Nashville folk band\r\n\r\nThe Goat Rodeo Sessions: Yo-Yo Ma, Stuart Duncan, Edgar Meyer and Chris Thile\r\n\r\nOn that note, does everyone else think they sound absolutely amazing when singing alone in the car? I’m just really sure I sound amazing. Every other time I sing is just varying levels of stage fright. I will believe this to be true until I die.\r\n\r\n\r\nKeep it real,\r\nBailey\r\nNew Jersey\r\n\r\nP.S. Thanks Sarah for introducing me/us to the listserve.  You deserve all the credit in the world.\r\n\r\n", [2013, 12, 13]]