["[The Listserve] It's the little things", "Keegan", "When I first received the email saying I won the Listserve lottery, I honestly had no idea what to do. I’ll admit I initially joined the Listserve quite selfishly because I just wanted to read the stories of others. Having read every email that came in, and seeing all the life lessons and creativity pouring from every single one of them, I was left quite dismayed. What could I write about? What could I possibly put into words that others would want to read? I've probably started this about 12 times but I think I know what to say now.\r\n\r\nMy name is Keegan. I am a 4th year college student pursuing a BS degree in Chemistry, graduating in May, 21 years old, caught somewhere between a woman and a girl, and currently writing to you all in the comfort of a blanket fort.\r\n\r\nYou see, I've had kind of a terrible day today. It started out by dropping someone very dear to me off at the airport and, as I’m sure most of you know, that leads to quite the difficult day. Especially when things have been left unresolved and you won’t see them again until July. That, coupled with the fact classes will be starting again soon and not really anyone is back from break yet, has led to some serious moping around.\r\n\r\nNow I’m not really the kind of person to make new years resolutions, but considering I received the email saying I won the Listserve lottery on January 1st, I figured that now seemed like a pretty good time to do so.\r\n\r\nSo here they are: short, sweet, simple.\r\n\r\nBe more confident.\r\n\r\nSmile more.\r\n\r\nEnjoy the little things.\r\n\r\nThat brings me to my current location. I was perusing the internet, scrolling through countless pages and getting to that point of actually being bored with just sitting in bed being upset. I was thinking to myself, what can make me happy? What can get me out of this rut? And then it hit me. Blanket fort. I sat there for about a minute or two just thinking about it saying to myself, “Come on, Keegan. You can’t actually make a fort. Think of something practical.” But then I thought, “Why not?.... Why can’t I? I’m enough of an adult to say that I can do what I want and right now, I want a blanket fort.” And thus, construction began.\r\n\r\nIt took me about 7 minutes to work out my happy place here. My comforter strung from my bed, to my desk, to my bookshelf. A sheet between the footboard and mirror leaning on the wall, forming the tunnel to my escape. Textbooks holding everything down. I added a chair in the middle, creating a sort of tent like appearance and even took my bedside lamps into the fort for lighting. The final touch came in throwing all my remaining blankets and pillows inside and falling into them in pure happiness.\r\n\r\nI felt like a little kid but my night has been instantly better since.\r\n\r\nSo why am I telling all of you this? I want you to think about this when you are feeling down. When you've had a rough day and just feel like you've reached that quitting point. Remember that you should always take a minute or two to just do something for yourself to make yourself happy, because you’ll never be too old for such things. Whether you take the long way home through the park, get an extra scoop of ice-cream, or build yourself a blanket fort, I challenge you to not neglect the little things that will keep you going through 2013.\r\n\r\nPlease email me! Let me know how you've taken up my challenge or even if you just want to talk about anything and everything. I’m always looking for ways to brighten up the days of the people around me. Happy New Year everybody!!\r\n\r\nCheers.\r\n\r\n\r\nKeegan\t\r\nkeegan.listserve@gmail.com\t\r\nRochester, NY\r\n\r\n", [2013, 1, 6]]