["[The Listserve] Lessons from a failed founder", "Srishti", "It’s been little more than a month since my startup failed and I had been working on it for 2 years.\r\n\r\nHere’s some background: I was in pharma marketing and decided to quit my job and build an online travel startup.  Neither my co-founder nor I are technical people.  We put in quite a bit of our savings to do this crazy thing.\r\n\r\nHere’s why I think we failed:\r\n·         We didn’t build a strong team.  Everyone was located all over the world and we never took the time to really get to know people.\r\n\r\n·         We ran it too “corporate”.  Since both my co-founder and I came from the corporate world we had hierarchy and structure when we shouldn’t have.\r\n\r\n·         Spent too much money, too fast.  We spent a bucket load of money on building our website and when we pivoted to a new, much better idea all I saw was all that money being flushed down the toilet.  Lean Startup made a whole lot of sense after that.\r\n\r\n·         We could have been better hustlers (e.g. been more bold).  I think we both had personalities that didn’t really have the gumption to do what needed to get done.\r\n\r\n·         We quit our jobs too early.  We should have continued working and built this thing on the side and once we saw growth, then quit.\r\n\r\n·         We didn’t realize how convoluted the travel industry actually is.  We did tons of research before quitting but we were incredibly naïve about how complicated it was to get something going in an industry where fax is still a common tool for communication.\r\n\r\n·         Don’t get caught up in the echo chamber.  I moved to San Francisco for my startup and it was easy getting caught up in opinions.  VCs think you should do this, other entrepreneurs think you should do that and all this is fed to you constantly.  We definitely got caught up in it.  Ultimately, it’s what your customers want that’s most important.  Nobody else needs a voice\r\n\r\n·         We forgot it’s a business.  Especially with web startups, I see a lot of people think about money way too late.  We did that for the first version of our idea but remembered to think about the revenue model for our second idea.  Too little, too late.\r\n\r\n\r\n\r\nIf you guys have any questions about my startup experience or similar experiences to mine, let’s talk!\r\n\r\nFortunately, I’m not completely removed from the startup world. I get to look over my brother’s shoulder as he works on Lite Bite, a non-profit product.  In developing countries, dentists don’t have powerful lights to see in the mouth.  He and his friends created a low cost dental device that puts a light source directly into the mouth.  It’s 350% more powerful than the flashlights currently being used.  It’s a really cool project and if you want to learn more about it, I’d be happy to talk.\r\n\r\nBest wishes,\r\nSrishti\r\nsrishti.listserve@gmail.com\r\nSan Francisco, California\r\n\r\nP.S. I’m looking for job leads for marketing/market access roles in pharma/biotech (in San Francisco or Bay Area) so if you have any leads, please email me!\r\n\r\n", [2013, 12, 9]]