["[The Listserve] The product of my research and reflections", "Katy", "Upon selection I began to research what I wanted to say. I stumbled across the initial article that alerted me to the existence of The Listserve. This reminder of the lucky circumstance in which I discovered Listserve reminded me of the joy of sharing something of interest with those around me.\r\n\r\nI reread my favourite entries; including the first one I received by Tim Krins. His article was a letter thanking his teachers who shared their passions for life. As a teacher I felt it rather fortuitous to receive this as my first post, especially as it arrived at the end of a busy day. It was something that encouraged me to continue to read.\r\n\r\nI watched the websites video and completed the sentences. It helped me think of some ideas\r\n-    Sometimes I wonder… how far we make our own luck. Can life be understood as a serious of lucky circumstances, or do the lucky circumstances come to those who look for them\r\n-    I noticed recently that… starting the day with a positive thought gives a different outlook for the day. I always found the idea of gratitude journaling a little bit cheesy, but recently I downloaded an app onto my phone and it has been an interesting experiment so far.\r\n-    I just wish I could… find it easy to focus on one thing. I’m easily distracted by lots of different topics. A sense of curiosity about the world is undoubtedly a good thing but at times I do need to remember to rein it in\r\n\r\nI asked people the question “If you had the chance to speak to a 25000 people, what would you say?” Their responses fascinated me. It started some unexpected and captivating conversations. Unusual questions or “thunks” can lead to unexpectedly insightful conversations.\r\n\r\nSuggestions I received included\r\n1. 'Warts and all' account of your life in the style of Studs Turkel\r\n2. Altruism\r\n3. The many flaws of the coalition governments’ policies on the UK economy and society\r\n4. The reduction in basketball spending from the Sports and Culture department (I didn't have a lot to say about that!)\r\n5. Your summer as a Gamesmaker\r\n\r\nAltruism spoke to me most as a topic\r\n\r\n“Giving is more joyous than receiving, not because it is a deprivation, but because in the act of giving lies the expression of my aliveness.” — ERICH FROMM”\r\n\r\nVolunteering culture was all over the news this summer with Olympic Gamesmakers yet I would argue that altruism is a lot more than simply one action. Instead it is a frame of mind, an attitude to cultivate. With that in mind I finish mentioning one of my favourite charities. Postpals is a charity which asks volunteers to send cards to sick children in the UK. It is a commitment of time and a small outlay of cost (stamps etc). I shared this charity with my class recently their sensitivity and compassion warmed my heart. In both sending cards myself and encouraging others to send one themselves I felt some of the joy that Fromm talks about in the above quote\r\n\r\nWould you consider yourself altruistic? What do you give to your world around you?\r\n\r\nHave a good day\r\n\r\n\r\nKaty\t\r\nlistserve84@gmail.com\t\r\nEngland\r\n\r\n", [2013, 2, 5]]