["[The Listserve] Hello.", "Tay", "First of all, check out the band Mideau. They are new and amazing. I’m a fan. Google MideauMusic.\r\n\r\nNow, before I start my message, relax. Whenever I get the Listserv, I’m in midday mode. My face is tense, my shoulders are scrunched, my breathing is short. Maybe this isn’t you. But if it is.\r\n\r\nRelax.\r\n\r\nTake a moment and a deep breath.\r\n\r\n\r\n------\r\n\r\n\r\nThe combination of anonymity, a fleeting power to amplify my voice, and a word limit to simplify it makes me feel both safe and significant for today. I can open up to strangers. I can say something important. I can say the most important thing—if I could only realize and articulate it within 48-hours. But it’s the first weeks of my PhD. So I cant. And in the absence of Best, [though I don’t believe there is one], I leave you something good:\r\n\r\n\r\n“In the center of [the city called] Fedora, that gray stone metropolis, stands a metal building with a crystal globe in every room. Looking into each globe, you see a blue city, the model of a different Fedora. These are the forms the city could have taken if, for one reason or another, it had not become what we see today. In every age someone, looking at Fedora as it was, imagined a way of making the ideal city, but while he constructed his miniature model, Fedora was already no longer the same as before, and what had been until yesterday a possible future became only a toy in a glass globe.\r\n\r\n\r\nThe building with the globes is now Fedora's museum: every inhabitant visits it, chooses the city that corresponds to his desires, contemplates it, imagining his reflection in the medusa pond that would have collected the waters of the canal (if it had not been dried up), the view from the high canopied box along the avenue reserved for elephants (now banished from the city), the fun of sliding down the spiral twisting minaret (which never found a pedestal from which to rise).\r\n\r\n\r\nOn the map… there must be room both for the big, stone Fedora and the little Fedoras in glass globes. Not because they are all equally real, but because all are only assumptions. The one contains what is accepted as necessary when it is not yet so; the others, what is imagined as possible and, a moment later, is possible no longer.” – Invisible Cities, Italo Calvino\r\n\r\n\r\nIf we are not careful, we can spend so much time building the world of our dreams\r\nthat we miss the world around us.\r\nAnd if we are not careful, we can watch the world around us so intently\r\nthat we never enjoy the dream to make it better.\r\n\r\n\r\n\"There must be room both for....Fedora and the...Fedoras in glass globes.\"\r\n\r\n\r\nNow, I treasure passion and purpose. If asked what I see as something beautiful, I would say the sight a person in the act of their passion—be it painting, wandering, debating, laughing... If asked what I feel feeds my depths, I would say the moments that I engage my own passions—but I would also say the knowledge that I am making the world better, even if only for one person. In some ways, these two concepts are Fedora and the Fedoras of the glass globes.\r\n\r\n\r\n---\r\n\r\nInspiration:\r\n\r\nYouTube the black&white version of ‘Shake the Dust‘ (Anis Mojgani).\r\n\r\n\r\nLook at the sky, often.\r\n\r\n\r\nVisit the wordpressblog Tolling. I write about what strikes me as important. I welcome suggestions.\r\n\r\nTay\r\nNorth Carolina\r\ntaylorwhitten@gmail.com\r\n\r\n", [2013, 9, 12]]