["[The Listserve] Words, those little bricks...", "Hannah", "Writing The Listserve is a humbling task akin to standing naked in a room full of strangers, some nervously peeking through their fingers, others turning their head away while a few look on, riveted.\r\n\r\nThis exercise is not unlike the last two years of my life, two years dedicated to pushing through the frequent discomfort of being in order to connect with others.\r\n\r\nWhat if you were stuck on an island in the middle of the ocean – hours away from the nearest landmass – and felt that life was passing you by?\r\n\r\nWhat if you were always surrounded by people yet completely alone despite your linguistic efforts?\r\n\r\nWhat if your only survival tool was words, your one belief kindness and your one wish love?\r\n\r\nWhat would you do?\r\n\r\nTwo years ago, this was me. I was 35, had spent the best part of a decade and a half looking for love in all the wrong places but I still longed for companionship besides that of words.\r\n\r\nWords, those little bricks I was still trying to build a livelihood out of as a freelance journalist and copywriter.\r\n\r\nWords, those little bricks I would occasionally lob at people via a semi-regular newspaper column in a language I was still getting used to.\r\n\r\nWords, those little bricks I often felt stuck in my throat because isolation – be it geographical or cultural – can steal your voice.\r\n\r\nThat's when I decided to make the contents of my head inspectable online and started a blog with a self-explanatory title: The Ideal Wife Giveaway.\r\n\r\nPowered by curiosity and the need to communicate, the blog was going to be a one-off, singular real-life experiment which I hope would resonate with at least one person.\r\n\r\nThe blog became my mirror, reflecting everything I felt at the time of writing.\r\n\r\nI reasoned that true bonds – because my blogging was all about reaching out, romantic considerations notwithstanding – could only stem from authenticity, no matter how difficult, ugly, silly and challenging being oneself can be.\r\n\r\nI eventually left the island, some nomadism ensued and, in November 2011, one blog comment stood out, starting a conversation across the miles.\r\n\r\nOn Christmas Day 2011, I was on a plane.\r\n\r\nOn Christmas Day 2012, my partner and I celebrated our first anniversary. Although digitally-enabled – and geographically-challenged at present although that wasn't always the case – we are very real, as is our love and life as a couple.\r\n\r\nThus, I learnt that combining curiosity and hope can yield extraordinary results. My partner would cringe at being described as extraordinary, but he truly is for not being afraid of embracing a different way of connecting and for loving me the way I am.\r\n\r\nAnd after sharing a moment in time through The Listserve, maybe you and I will continue the conversation too and end up creating something together that wasn't there before, be it a friendship, a project, a story... who knows?\r\n\r\nLastly, wordy bricklaying is my vocation and passion so if you, your organization or anyone you know needs any bridges building, I'd love to help and may even be able to do so bilingually!\r\n\r\nThanks for the opportunity to share a little bit of what makes me me with you, whoever you are.\r\n\r\n\r\nYours curiously,\r\n\r\nHannah\r\nhannahcurious@gmail.com\r\n@HannahCurious\r\nNorth America\r\n\r\n\r\n", [2013, 1, 24]]