["[The Listserve] So This Is A Thing...", "Sara Solano", "When I signed up for The Listserve, it was a subconscious experiment in anonymity. A friend suggested I subscribe and I'm not one to slough off good advice, especially when it comes to accumulating things to read/see on the Internet. I read some submissions during class and deleted others when my inbox became inundated with the morning flood of law school registrar emails, Groupons for spider vein treatments, and reminders that I was going to miss out on bidding on that pair of Lululemon yoga pants I added to my watch list on eBay five days prior and forgot about. I never thought I'd be chosen to submit anything--the odds, I thought, were astronomical. I could just be a passive voyeur to the wisdom of the huddled masses and then get snapped back to reality when I realized I was about to get cold-called in my Property class. \r\n\r\nLo and behold, on the first day of my spring break in which I sat festering in FOMO as my fellow law school classmates sent Snapchats of the hell they were raising in Key West whilst I sat in bed at my parents' house with a cold, I received the email that I was a lucky bleeder for the next round of Listserve emails. \"Welp,\" I thought. \"I better come up with something good.\"\r\n\r\nI haven't been able to, if you haven't noticed. Alas, I'm not in the creative writing mood, which is weird because I consider myself a \"writer\" (a.k.a. I'm a pretentious early-20something with a journalism degree). But I have some pressing things on my mind, if it's a valid excuse: I still don't have a summer legal job, I feel isolated from my friends because I said the wrong things to the wrong people because I was absent on the day in kindergarten when they taught us how human interaction works, living alone is lonely when the novelty of never wearing pants wears off, I'm paranoid I don't understand a damn thing about anything going on in my classes, and I overall absolutely detest the second semester of my 1L year of law school. So you know, I have ridiculously typical problems of someone in my position that are weighing on me like the world on Atlas. \r\n\r\nI never actually read or saw \"The Help\" (whoops?), but I find myself repeating that \"You is kind. You is smart. You is important,\"  mantra in my head to remind myself that for all my transgressions and disappointments and rough learning experiences, I can and will press onward. Even within the microcosm of my meager existence in the heart of a major metropolitan area, on the beautiful, sprawling University of Miami campus, within the quadrangle of the law school, inside the library, within my tiny cubicle on the second floor all the way to the right by men's room...I matter. You matter. We all matter. We're not anonymous, even among 20,000 names on a listserv. And we're all going to be OK. \r\n\r\n\r\nAnd just so this isn't a bunch of self-reflective mumbo-jumbo from some wet-behind-the-ears little punk, I'm gonna share my favorite pumpkin muffin recipe because I mean, if we're all gonna have to try to tough it out in this world, we might as well do it with some bomb-ass muffins that are high in fiber.\r\n\r\nINGREDIENTS: \r\n1 can of Libby's 100% pumpkin puree\r\n1 box of Duncan Hines yellow cake mix\r\n1 teaspoon of cinnamon \r\n\r\nMix that ish up in a bowl (a mixer makes this easier because it's a very thick concoction, but if you've got some guns, go at it with a wooden spoon until it's all stirred up all nice and proper). Pour in muffin tin, but don't fill it up quite to the brim because these things swell up like a Kardashian's ego. Bake on 350 for about 23 minutes. I say 23 because that's what you're just gonna do anyway if I said \"between 20 and 25,\" so there, I cut out the middle man. Remove and let cool. Dust with confectioners sugar and cinnamon. Eat with a Sam Adams Cherry Wheat. Congratulations, it's autumn forever and you'll poop like a dream.\r\n\r\n\r\nCheers,\r\nSara Solano\r\nsaralauren.solano@gmail.com\r\nMiami, FL\r\n\r\n", [2013, 3, 13]]