["[The Listserve] When a philosopher paints, he paints painting itself", "Jean-Baptiste Dayez", "Writing an e-mail to more than 21,000 people one does not know - except that they are open-minded enough to know The Listserve - is both exciting and terrifying... especially because \"you never get a second chance to make a good first impression\" (quote from Will Rogers).\r\n\r\nI first thought to give you some tips to live happily, but I do not think I have the authority to give advice on this topic... I am not yet thirty years old and do not know much about life. I also considered making a list of amazing facts that would have educated you and/or surprised you. But the web is full of such lists, so I abandoned the idea... Finally, I decided to offer you to make a discovery that will perhaps please you. It is about my mother’s work.\r\n\r\nMy mother is a painter. Eager to understand what painting is - a discipline that she has practised from her earliest years -, she took a degree in philosophy during which she became fascinated by the work of Maurice Merleau-Ponty (a French philosopher), which would leave a deep mark on her pictorial work. Her life is made of constant interferences between painting and philosophy, the latter of which she teaches. They are like the two sides of a same approach.\r\n\r\nFor more than ten years, she has painted nothing but folds, out of fascination for their beauty. She paints folds, but she does not intend to \"represent\" them. The total lack of weariness and the passion with which she goes on painting them lead her to believe tha,t for her, the fold has become a language with an endless capacity to signify.\r\n\r\nI am touched by the beauty of her works, and I am happy to share this beauty with all of you. I invite you warmly to discover her works on her website, that you will find with a simple Google search with \"Chariot-Dayez\" terms. Feel free to contact her to tell her what you think!\r\n\r\nI wish you a happy and meaningful life. All the best,\r\n\r\n\r\nJean-Baptiste Dayez\r\nBrussels, Belgium\r\njbdayez@gmail.com\r\n\r\n", [2013, 5, 10]]