["[The Listserve] Sisters", "Susan Grizzard", "Today. May25th, 2013 was our 89th Sisters’ Day adventure!   Almost 7 ½  years ago, my 3 sisters and I realized that even though we all lived close, we didn't see each other often. We have always been a close family, but between work and taking care of our families, we were letting too much time go by between visits. After our mother died in 2003, we all grieved separately, coming together mostly for holidays.  We have always been a family that puts fun on the top of our list, but after mama died, our fun times together became fewer and farther between.\r\nI am not sure who came up with the brilliant idea of setting aside one Saturday a month, come hell or high water, that we would do SOMETHING together.  We really had not formulated a long term plan.\r\nThe first Sisters’ Day outing was in January of 2006.  We started off easy -  with a trip to an Antique Mall and lunch,  A couple of more trips and we discovered our passion…….HIKING!  So the majority our Sisters’ Day have been day trips to State Parks.  When the weather is too cold or too hot we choose something else:  a play, a museum, botanical gardens or a movie.  We have had some wonderful adventures, but whatever we do, we find humor, laugh til we cry (or wet our pants) and sing all the songs we know (and some we don’t!)  Occasionally we even allow our younger brother, Bill, to tag along.\r\nWe have gotten lost on unmarked trails in the North Georgia Mountains, had picnics in the rain, gone to a Kangaroo conservatory, a butterfly Festival, saw some great shows at the Fox Theater, discovered a frozen waterfall on Pigeon Mountain, and climbed to the top of Amicolola Falls. We have hiked countless miles, visited wildlife parks, and corn mazes.  We had a whirlwind trip to the beach…………yes in one day…….we drove 5 hours to Tybee Island, basked in the sun, had a picnic, toured a Fort and drove the 5 hours back.  Our big day trip was to NYC in December of 2008.  We boarded a flight from Atlanta at 5 am, got to New York and hit the ground running!  Top of the Empire State Building, Central Park, Times Square, Staten Island Ferry, Ground Zero then back to Atlanta by 2am.  What a wonderful, exhilarating exhausting day!\r\nNo matter what the “trip of the month is” long or short, we make the most of it. It is not so much WHAT you do or WHERE you go, but the time that is spent with one another.  Don’t let time slip away and the stress of everyday living get in the way of making time for family. It doesn't have to be expensive or time consuming. But you have to make a conscious effort.\r\nNow after 89 trips, countless hours in the car together, hundreds of miles hiked, and dozens and dozens of picnics ………we are still going strong and we are still having fun!\r\nI would love to hear from you and your thoughts or experiences about family and your time together!\r\n\r\n\r\nYours truly,\r\nSusan\r\nsugriz@bellsouth.net\r\n\r\n", [2013, 5, 27]]