["[The Listserve] my list of San Francisco recommendations", "Harsh S", "Hey y’all,\r\n\r\nFor those of you that haven’t been to San Francisco, here is a list of my favorite things to do in the area:\r\n\r\n1. Eat Bi-Rite ice cream in Dolores Park\r\n2. Tan yourself with other hip San Francisco residents at Dolores Park\r\n3. Visit Bi-Rite grocery store in the Mission\r\n4. Visit Golden Gate park and climb to the top of the DeYoung Museum\r\n5. Stare at beautiful art at the San Francisco Museum of Modern Art (“SFMoMA”)\r\n6. Window shop on Valencia St in The Mission - start at 16th and Valencia and walk to 25th and Valencia\r\n7. Visit the Ferry Building Farmers Market (on Saturdays) under the Bay Bridge\r\n8. Take a cable car on the California Line to Pac Heights and meander back down Fillmore St\r\n9. Eat dim-sum in the largest China Town in the USA (Koi Palace in Daly City which is South of San Francisco is considered excellent for this)\r\n10. See a concert at the Great American Music Hall\r\n11. check out the jazz at Yoshi’s\r\n12. Catch the SF Symphony at the beautiful Davies Hall\r\n13. Rent a car and drive south along Pacific Coast highway to Santa Cruz. Or, drive north towards the lighthouse on Point Reyes.\r\n14. Go hiking around Point Reyes\r\n15. Hiking (or cycling) around Mt Tam (Tamalpais)\r\n16. Oyster shucking in Tomales Bay. Because I’m vegetarian, I have no idea, but this is recommended by friends with good taste\r\n17. Hiking around Muir Woods\r\n18. Napa. wine country\r\n19. Sonoma. wine country and fewer tourists.\r\n20. Go to the Tourist Club in Mill Valley -- a German-style beer haus nestled in Muir Woods\r\n21. Attend a sing along at The Castro Theatre\r\n22. Kite surf at Crissy Field (lessons + wetsuit recommended)\r\n23. Surf in Pacifica (lessons + wetsuit recommended)\r\n24. Go road cycling in Marin\r\n25. Yosemite, Yosemite, Yosemite\r\n26. Bike across the Golden Gate Bridge, take the Sausalito ferry back\r\n27. Catch an improv comedy show at BATS Theater around Fort Mason\r\n\r\nTo eat:\r\n1. Ice Cream at Humphry Slocombe (don’t miss this place!)\r\n2. Explore the Ferry Building with little speciality food shops inside\r\n3. Burma Superstar - amazing Burmese food\r\n4. Foreign Cinema in The Mission - Californian cuisine and delicious\r\n5. Nopa in Western Addition - brunch brunch\r\n6. Delfina - very good italian-american fare\r\n7. Flour + Water - specialty is pasta. booked out months in advance\r\n8. Little Star Pizza - good pizza\r\n9. Tartine Bakery - excellent bakery\r\n10. Suppenkuche - German.\r\n11. In-N-Out Burger - the famed burger chain.\r\n12. burritos at Taqueria Cancun in the Mission\r\n\r\nTo drink (bars):\r\n1. Zeitgeist in The Mission\r\n2. Gestalt in The Mission\r\n3. Latin American Club in The Mission\r\n4. City Beer - beer store/bar in SOMA. very wide beer selection. closes early\r\n5. Toronado in the Lower Haight - beer bar\r\n6. Bourbon and Branch - cocktail bar\r\n7. Top of the Mark - classy bar that sits above the city. amazing views. fun live music. pricey.\r\n8. Zoes (24th/Folsom) in The Mission\r\n\r\nif you have any feedback, or end up using this list, send me an email. I’d love to hear about it.\r\n\r\nbest,\r\n\r\nHarsh S\r\nhjslistserv@gmail.com\r\nSan Francisco, CA\r\n\r\n", [2013, 8, 21]]