["[The Listserve] Fluency", "carmel", "What I’m working on right now is fluency. My mother’s language, Hebrew, was my first language, I can speak it without an accent, and thanks to a year of high school in Israel I can discuss most things relevant to a teenager’s life, like schoolwork, crushes, and the political climate, with ease. But I’m not satisfied. What I want is to be able to articulate a thought, any thought, with as little effort as it takes in English, and at the same speed. When I want to write or say something in English, different ways to phrase it gently bob in the air in my head like balloons, waiting for me to pick the one I like best. But in Hebrew, choosing between different expressions of a thought is like trying on pairs of boots that don’t fit until one seems like it’s good enough for gardening (but not for going anywhere nice).\r\n\r\nAnd I want to be able to read, for pleasure. In English I can look at a page and, letting my eyes rove over it briefly, grasp its gist and decide if I want to read it with care. When faced with a Hebrew page my eyes can rove all they want but until I decide, OK, now I’m trying to read, no meaning filters through. My eyes jump ahead to the end of a line when I’ve only read half of it. Are we there yet? No? What about now?\r\n\r\nHere are the things I’m trying: reading aloud, to my mom, over Skype. Reading short stories or books with very short chapters, to quell my frustration with how slowly plots unfold. Stacking books around the house so I can glower at them defiantly. Listening to Hebrew comedy shows on youtube as a reprieve from the hard work.\r\n\r\nWhy does fluency matter to me? I’m not sure. It was once about connecting with my mom, but she recently crossed the threshold of having lived more than half of her life in the United States. Her English is good, and in Hebrew she was always gifted with language (prose and poetry alike), but when we talk she often seems stuck between her two languages: unable to find the word in Hebrew, unsure how to express the thought precisely in English, and no longer able to fluidly switch between the two as needed. When I offer her the word she’s missing, or quietly (but audibly) translate to Hebrew when she switches to English, I feel discomfort, and I believe I make her uncomfortable by calling attention to her limbo state. In trying to be a living vessel of that once-fundamental aspect of her being, am I honoring her? Or being selfish?\r\n\r\nIf my mother's country of origin were not a country perpetually at war, would language matter to me as much? I'm not sure about that, either. Though I think of \"language\" as definitely political, in that it describes and defines what happens in the world, it is also safe and neutral, in that it can create its own worlds (in one's family, or in songs, or books) that are separate and safe from the harsh ugliness of reality, unlike other immigrant longings like \"place\" or \"culture\".\r\n\r\nMy mother’s brother, who didn’t go to college, can’t read the books I also can’t read, and he doesn’t need to. His identity isn’t in question. Do I need to? Who exactly am I trying to pass as? Do I have the right to whatever self-definition I want? I think the answer to the last question is no. What’s more, trying to get to literary and intellectual comfort with a language is arguably a weirdly classist approach to identity. If my mother’s split-self is good enough for her, why am I, as someone who has the privilege of claiming a whole, unbroken all-American identity if I so choose, not content with what I have?\r\n\r\nIf you are not sure who you are, is it ok to try to define yourself through language?\r\n\r\nIf you’ve had a similar experience, I would love to hear about it.\r\n\r\n\r\ncarmel\r\ncarmel.listserve@gmail.com\r\nSan Francisco, CA\r\n\r\n", [2013, 11, 29]]