["[The Listserve] Thank you, Marissa Mayer...", "Joby Mabe", "In the United Kingdom we are asked to make a decision at the age of thirteen that will inform the rest of our lives. The subjects we nominate for our GCSE exams will determine our A-level choices, and then our University nominations and then our careers; which might affect where we live, our financial and social class status, the people we meet and the children we may bear. Asking a thirteen year old to make this decision is reckless. I was told to choose subjects that I was good at and I followed that advice; I studied Mathematics, Electronics and Information Technology, and then I studied Artificial Intelligence and Computer Science before starting my career as a computer programmer in London.\r\n\r\nI lived miserably in London for four years. I never made friends, I had nights out with colleagues and partied with the people I grew up with whenever they visited; I never met anybody serendipitously. I didn’t once take advantage of the city because I was always busy working and commuting. I swapped jobs three years into my time in London and life got better, I had more free time since we didn’t have fixed working hours but then spent my time at home catching up on sleep because the nighttime noise in Camden Town tends to be filled with sirens and drunks; I’m not sure that I ever slept through an entire night whilst I lived in London.\r\n\r\nIn June 2013 I returned to the Welsh countryside, to the hills upon which I grew. I owe it to the sophomoric decision by Yahoo! CEO Marissa Mayer to put an end to remote working. The owner of the company for which I work had read the news when it became public in February and pronounced it as a disaster, my initial reaction was confusion since nobody at my company worked remotely, it’s because nobody had ever asked. I asked.\r\n\r\nAnd now? I’m sitting in a barn and the only noise outside is that of chickens and guinea-fowl. I work remotely, the quality and quantity of my work has increased and I’m almost happy. The happiness is because I visit friends and family with frequency, it’s quiet and dark at night and I can see the stars again, everything I missed when I lived in London has returned to my life and the frustrations of my adolescent years spent in this place are no longer.\r\n\r\nThere’s just one thing. That decision I made with naivety at thirteen still haunts me. I’m a decent computer programmer and I love where I work but this isn’t really how I would like to be spending my time. Despite being a hemophobe with a tremor, I’ve decided to make the effort to go to medical school and right that wrong. Medicine is my mature decision; and until I start in September 2014 I have the quiet of the country to prepare myself. It’s what we do that counts, where we do it doesn’t matter, and a change is as good as a rest.\r\n\r\nYou can find me on Twitter and Medium: @jobymabe\r\nYou can email me too: jobymabe@gmail.com\r\n\r\n\r\nJoby Mabe\t\r\nWales\r\n\r\n", [2013, 7, 8]]