["[The Listserve] An Eye for an Eye", "Deva Niaz", "A few months ago my boyfriend, Alexander, pulled a fairly elaborate prank and convinced me I had won The Listserve lottery.  I wrote a satirical piece on the superfluous things in this world that I love and hate.  After submitting my masterpiece I eagerly waited for its distribution to the masses.  A few hours after my submission I received an email from what I presumed to be The Listserve indicating that my piece needed some editing.  The email referred me to an attachment with suggested revisions.  A bit confused by the situation, I opened the attachment to find a presentation documenting each step of the hoax with colorful commentary provided by my boyfriend.\r\n\r\nOn Monday, I received yet another email claiming I had won The Listserve lottery.  I immediately assumed this was another, albeit uncreative, attempt by Alexander to prank me yet again.  However, after an email exchange with one of The Listserve's co-founders I was able to confirm its authenticity. This time it was the real deal!  My initial thought was to submit the love / hate piece I wrote as victim to the aforementioned prank.  But then, it hit me, this was my chance at retribution!  The interweb gods were giving me a chance to do unto my boyfriend as he had done unto me.\r\n\r\nSo, fellow Listservians, I humbly request your help in assisting me in paying it forward to my lovely boyfriend.  I ask that you send him an email at renzi.alexander@gmail.com with the content of your choosing – the more obnoxious the better, but a blank email will also suffice – and title it “It is what it is”.\r\n\r\nFor those of you interested in what I originally intended to submit, I’ve provided an abridged version below.  Please feel free to email me for the full length.  For those interested in seeing the presentation that set the wheels in motion for this post, send me an email as well.\r\n\r\n** Things I Love and Hate (Abridged Version)**\r\n\r\n1.   Gelato (love) – For a period of time I was taking down two to three cones per week and would occasionally indulge in a full pint.  I’ve come to realize my love for the cold, creamy goodness has entered an unhealthy territory.  The solution – to open up my own gelateria and fully embrace the obsession.\r\n\r\n2.   Pandas (love) – Pandas are amazing because they’re (i) ethnically diverse, (ii) peaceful, bamboo-eating vegetarians and (iii) have a level of dexterity comparable to humans.  I also own far too many panda-related articles of clothing (hats, sweaters, tanks, etc.), which is irrelevant to why pandas are awesome, but completely relevant as to why I am.\r\n\r\n3.   2Chainz (love) – 2Chainz is not a rapper, but rather a poet that speaks eloquently against a high tempo backdrop.  The only rapper even comparable to 2Chainz would be Gucci Mane, not for his ability to create thought-provoking rhymes, but because he has a tattoo of an ice cream cone plastered on the side of his face (I’ve already established why that would merit high praise in my book).\r\n\r\n4. Skele-Toe Sneakers (hate) – Feet are ugly enough on their own, so why wear shoes to further accentuate the ugliness of this appendage.  I’m convinced that anyone who owns these sneakers has no friends or family, no strong desire to procreate and lacks any semblance of respect for themselves or other humans.\r\n\r\n5.   Oysters (hate) – I’ve eaten enough oysters to know that anyone who says they like them is probably lying and should not be trusted.  They have a gross, gelatin-like consistency and taste like a hybrid of saltwater and earwax.\r\n\r\n\r\nDeva Niaz\r\nniazdeva@gmail.com\r\nNew York, NY\r\n\r\n", [2013, 11, 4]]