["[The Listserve]  I hate the Sunshine State", "Irina", "It's interesting that this lottery email found me today, this minute, at this time in my life. Isn't that always the case?\r\n\r\nDo you ever have the overwhelming feeling that picking just one “favorite” is ridiculous? I always had a weird jealousy of people who could pick a favorite color, and it would be their favorite for their entire lives. Buddy, give me the rainbow. There are so many beautiful colors in this world, how could anyone pick just ONE?! My favorite colors have always shifted during different stages of my life.\r\n\r\nDuring a particularly rebellious phase, it was always shades of blue, because I didn’t want to be a girly-girl and was in a heavy tomboy phase (boys are blue, and girls are pink!). Going through several depressed years, it was all kinds of grey, then black. Anxiety has always drawn me to oranges; emerging from the depression, I found hope and fell in love with yellow. When harder times hit, I found my favorites to be pastel yellows and lavendars, offset with steely greys, as I found it well represented my internal battles. Recently, I went through a hyper-extroverted phase, and refused to commit to a “favorite” color at all, instead saying that I loved all neons.\r\n\r\nIf you were to guess that I’m an artist, you would be right. My favorite colors, nowadays, are purple, then yellow. I feel happy and passionate most days, and love how those two work together.\r\n\r\nI’ve spent a few years studying color theory, and how it relates to emotions; isn’t it fascinating that painting a primary shade of red will spark anger and aggression in people? That the awful seafoam green of hospital walls is meant to promote healing and soothing? Moderate, pastel-leaning hues of blue are believed to promote ideas, and aide with thinking. The biggest change one can make to a room is painting it a new color, no joke!\r\n\r\nNow, before you start calling me a crackpot, go hit up the Googles, and do a quick bit of reading. Color has an effect on our brains, whether you believe it or not. Think back to the movie Sixth Sense (anyone here old enough to remember that?), and the glorious use of red. It was fantastic, and subtle, and overwhelming, once you noticed it. What a great depth of meaning given by the use of color.\r\n\r\nThe next time you’re in a gallery, museum, or bookstore, stop and look at the colors. Artists and designers spent hours agonizing over them, just to help you feel a certain way. Pretty wild.\r\n\r\nSo now I’m curious. What’s your favorite color? Does it change? If it does, do you feel like it’s gone along with certain overarching moods that you’ve been in?\r\n\r\nFinally, I have to take a moment for a personal plug, here. I’m a painter in my free time, using color theory to make abstract, emotionally driven pieces, and am trying to get my work out. If you’re at all interested, I’d love to put a piece in your hands, wherever you happen to be. If not, I leave you with my personal motto, and hope you realize that it’s true. “You Are Precious.”\r\n\r\n\r\nIrina\t\r\nlistserve.me@gmail.com\t\r\nJacksonville, FL\r\n\r\n", [2013, 2, 11]]