["[The Listserve] A Light Saber can Light up Your Life", "Mindy", "I want to write about the funniest conversation I have participated in to date.\r\n\r\nMy sister entertains when she doesn’t even mean to. With aspergers syndrome, she is always literal, serious, and takes things exactly as you say them. My sarcastic family doesn’t make life easy for her and yes, I might get a little carried away from time to time, but she has no idea how her unintentional humor lights up our lives.\r\n\r\nShe had just gotten back from her favorite yearly activity – StarFest, where self-proclaimed dorks and geeks gather in a convention style hotel while wearing their favorite fantasy-inspired costume and participate in well, I went once for moral support and I couldn’t really tell you. I’ll relive that if I get this Listserve opportunity again.\r\n\r\nShe was pooped. And cranky. Her whole life she has worn exhaustion on her sleeve like a sweater and her bitchiness was apparent right off the bat that afternoon. (Disclaimer – Mitch, name changed, is her now fiancé)\r\n\r\nMom – “Honey did you not get a lot of sleep last night?”\r\nSister – (loud sigh) “PSH uh, NO”\r\nMom – “I’m sorry why is that?”\r\nSister – “WELL… the guy lying next to Mitch was snoring SO LOUD we couldn’t sleep”\r\nMe – “Um, there was a guy next to Mitch?”\r\nSister – “Yeah. And I elbowed Mitch and was like MITCH. GET HIM TO SHUT UP”\r\nMe – “So, it’s you, Mitch and this guy?”\r\nSister – “Yeah. So Mitch grabs his light saber and starts to poke him, and FINALLY he shut up but it took awhile so I’m really tired”\r\nMe – straight face - “What exactly do you mean by ‘light saber’”\r\nSister – annoyed - “You have to know what a light saber is…”\r\nMom – stopping the train wreck -  “MINDY. Enough.”\r\n\r\nMeanwhile, in a rocking chair a few feet away, my dad’s shoulders are shrugging with laughter while he listens in. The next few minutes involved tales of infuriating Star Trek assholes and uninvited furries; long lines for autographs and admissions of needing to “clean the con-funk” off. (Con-funk is the result of several days of not showering while in close quarters with other costume loving individuals – if you didn’t know that already) What can I say – it was just hilarious. So many conversations I have had with my sister in my life have gone that way.\r\n\r\nThe color she brings with her weirdness is fantastic. I wish all of you at some point have an individual in your lives that brings “different” into your reality, whatever side of the spectrum you are on. I am very lucky to have it- and I’m fairly confident my sister thinks I am ridiculous. Sometimes I think that to her, I am the “different”!\r\n\r\nThanks for reading, and go Broncos.\r\n\r\nMindy\r\nDenver, Colorado\r\n\r\n", [2013, 1, 12]]