["[The Listserve]  \"You've got no compression in your third valve...\"", "Emily Johnson", "Twelve years ago my best friend and I (18 and 19 years old) planned a road trip from Fort Lauderdale to Portland, Maine in her deceased grandfather’s old car. We bought plane tickets to Florida and gave ourselves a week to enjoy the drive back. It was exciting.\r\n\r\nBefore even leaving Fort Lauderdale we had to stop and replace the aged windshield wipers. Our speedy problem solving perhaps gave us a false sense of confidence and ability upon embarking on our first road trip. In theory, flying to Florida to drive a car to Maine does not seem like a unique or major challenge. At least, it shouldn’t.\r\n\r\nWindshield wipers fixed, we merged onto the clear-cut path up I-95 that would take us directly home. Open windows, feet on the dash – we were free! As I attempted to rig a Discman and speakers in the glove compartment, the car, so old that it simply provided an AM/FM radio for listening entertainment, began to shudder. And shake. And rattle. We looked at each other – something wasn’t right.\r\n\r\n“All we have to do is make it to Maine, then we’ll never take you on the highway again,” I thought, pleading with the car to keep moving. We figured out that if we stayed under 60 mph on the highway, the shuddering was undetectable. Good thing we gave ourselves a week to get back.\r\n\r\nAfter a night in Savannah, we took up our slow (yet legally) paced journey north. About three hours down the road, my best friend at the wheel, something gave out. We took the first exit we saw into Florence, South Carolina to look for help. “It’s like we just lost half our momentum,” my friend told the clerk at AutoZone, who directed us northern out-of-towners down the road a few blocks to a mechanic – “Tell him Anita sent you.”\r\n\r\nOur quick windshield wiper fix the previous day gave us hope that we’d be back on the road soon. After leaving the car at the shop we walked to the Piggly Wiggly for supplies, planning road snacks for the next few days. An hour later, we returned to the shop.\r\n\r\n“You’ve got no compression in your third valve,” the lady at the front desk drawled. Blank stares.\r\n\r\nShe clarified: “That’s bad.”\r\n\r\nThe mechanic gave us our options: fix the car for $2500 (more than it was even worth), or drive it until it dies. “It could die in 20 miles or in 5,000,” he said. Another thousand miles to Portland, we opted for the less pricey option, hoping the inevitable failure of the shaky old car would happen closer to the 5,000 mark.\r\n\r\nThe engine gave out about 300 miles down the road in North Carolina. We coasted to a stop in the breakdown lane and sat there in silence. That thick southern drawl echoed through my head: no compression in the third valve – that's bad…no compression…5,000 miles…\r\n\r\nWe had it towed to a Safeway parking lot. After removing the plates and emptying out the trunk, we abandoned the car. Trading our freedom of mobility for bus tickets, we continued to the journey north with subdued spirits, finally reaching Maine two days later.\r\n\r\nI don’t think we really learned any deep life lessons from this experience. We both drive reliable cars now, maybe that’s it. Or, maybe, if you’re car is inevitably going to die, but still running, drive it as far as possible. That way, the time you have to spend on the Greyhound will be as short as possible.\r\n\r\n\r\nEmily Johnson\t\r\nemjo33@yahoo.com\t\r\nSomerville, MA\r\n\r\n", [2013, 2, 23]]