["[The Listserve] What you won't get... and what you will", "Dawn Williamson", "Hi there to everyone on the listserve!\r\n\r\nA little bit about me – I live in New York City, work for an internet startup (Hi, Chartbeat!), and have a Great Dane named Lucy (Lucyfur when she’s bad).\r\n\r\nWhat you won’t get in this email: 1) Wide ranging life advice. Hell, I can’t even figure my out my own life. 2) The first chapter of my unpublished novel.  I can barely finish this email. 3) A list of platitudes. Instead, let’s just go with the flow.  ;-)\r\n\r\nWhat you will get: 1) Random life advice. I can do random! 2) Photos of every situation I mention below. If you go to bit (dot) ly (slash) dawnlistserve or go to flickr and search for the user “dawnlistserve” you can see a picture of everything I talk about below.  3) I’m not sure there is a #3, to be honest. Good karma? Great Dane kisses?\r\n\r\nAnyway, here goes:\r\n\r\nI weigh 105 pounds. My dog weighs 120. Here are some questions you shouldn’t ask a big dog owner:    - Does he come with a saddle?    - Are you walking him or is he walking you?    - How do you like owning a horse? Best question I’ve ever received (from a child):    - Is that your pet cow? Best question I’ve ever received (from an adult):    - Is that a puma?\r\n\r\nTelling your NBA-crazy high school girlfriends that you were chosen from amongst a huge group of people to work courtside for an entire Phoenix Suns season was pretty cool. Explaining to your adult colleagues that you were a really great ‘ball girl’ in high school? Uh, not so much.\r\n\r\nIf you ever visit the FBI building in Washington D.C. and you see an “Exit” sign that doesn’t look quite right and no one else is using it, don’t go through the door. Unless you want to get stuck in a 2- x 3-foot construction barrier for 20 minutes.   But… if this does happen to you, the fastest way to get armed security guards to help you find the real exit is to try to scale the exterior wall, get stuck on the top of it, and rip your pants on the way down.  Seriously, those guys can move pretty fast when they want to.\r\n\r\nIf you ever find yourself in India for a wedding (Hi, Mona!) and you’ve managed to make it the first 11 days of the trip without getting even the tiniest bit sick, don’t get cocky on day 12 and encourage your traveling companion (Hi, Ted!) to drink a glass of freshly squeezed pineapple juice from the hotel breakfast buffet right before the wedding.\r\n\r\nFinally, sometimes you just have to share a photo of your little sister (Hi, Nicole!) with the world so everyone can appreciate it. And I swear the selection has nothing to do with all the years of you teasing, biting, and constantly wanting to hang out with me and my friends.\r\n\r\nThanks for indulging me, everyone! If you write me at dawnlistserve@gmail.com or tweet at me @justsoyouknow, I’ll respond. Pinky swear! xoxo\r\n\r\n\r\nDawn Williamson\t\r\ndawnlistserve@gmail.com \t\r\nNew York City\r\n\r\n", [2013, 1, 5]]