["[The Listserve] Dysfunction and Serenity", "Anonymous", "How would you know if you were dysfunctional - that you had a toxic self image, an inability to have meaningful relationships with others, an obsessive need for control, or some other emotional debility?  If you were in denial about your dysfunction, how would you know it?\r\n \r\nIf you identify with much of the following, called the Laundry List - 14 Traits of an Adult Child of an Alcoholic, then you may have learned dysfunctional coping strategies as a child that you carried with you into adult life.  These coping mechanisms are the laundry list traits below.\r\n \r\nNote that alcoholism is only one of many possible \"family diseases\" that can create abuse and neglect.  Other addictions, mental illness, sexual abuse, extreme religiosity, etc., can also produce adults that identify with the Laundry List.\r\n \r\nThe Laundry List\r\nWe became isolated and afraid of people and authority figures.\r\nWe became approval seekers and lost our identity in the process.\r\nWe are frightened of angry people and any personal criticism.\r\nWe either become alcoholics, marry them or both, or find another compulsive personality such as a workaholic to fulfill our sick abandonment needs.\r\nWe live life from the viewpoint of victims and we are attracted by that weakness in our love and friendship relationships.\r\nWe have an overdeveloped sense of responsibility and it is easier for us to be concerned with others rather than ourselves; this enables us not to look too closely at our own faults, etc.\r\nWe get guilt feelings when we stand up for ourselves instead of giving in to others.\r\nWe became addicted to excitement.\r\nWe confuse love and pity and tend to \"love\" people we can \"pity\" and \"rescue.\"\r\nWe have \"stuffed\" our feelings from our traumatic childhoods and have lost the ability to feel or express our feelings because it hurts so much (Denial).\r\nWe judge ourselves harshly and have a very low sense of self-esteem.\r\nWe are dependent personalities who are terrified of abandonment and will do anything to hold on to a relationship in order not to experience painful abandonment feelings, which we received from living with sick people who were never there emotionally for us.\r\nAlcoholism is a family disease; and we became para-alcoholics and took on the characteristics of that disease even though we did not pick up the drink.\r\nPara-alcoholics are reactors rather than actors.\r\n \r\nRecovery from dysfunction is manifested through self-love, emotional sobriety, and serenity. It literally means to grow up, to go from an adult child to an adult who is a child at heart.\r\n \r\nI have been in recovery for nearly five years. My coping strategies were to isolate and daydream, to blend into the background and become invisible, and to extract love from my family by disappearing.  Deprived of the attention I desperately craved, I unquestioningly accepted abuse and humiliation as the price of being included and learned to deny the terrible feelings that accompanied them. So naturally my biggest fears have to do with being visible, the center of attention, and appearing in any way different from those around me. \r\n \r\nIn recovery I have come to love and value myself. I have found the courage to be myself, to hang in there and ride out the bad feelings, and push back if someone crosses a boundary.  I increasingly know and accept what drives me. I can deal with uncertainty.\r\n \r\nIf the pain of staying the same is greater than the pain of changing, google \"adult children\" and take it from there. Break the cycle!\r\n\r\n\r\nLove to all,\r\n\r\nAnonymous\r\nrealized.serenity@gmail.com (feel free to email with questions, stories, etc.)\r\nNJ, USA\r\n\r\n", [2013, 10, 13]]