["[The Listserve] 22-Year-Old Brain Cells", "Ariel Lani Llorente", "Wow…I won…I never win. I just found out that I won the Listserve…5 days ago. -___- Shame on me. Thank you, Connie Chweh, for introducing me to the Listserve…yes, you should be jealous! I’m so proud of you. I’m so happy that you’re in my life. I love you.\r\n\r\n\r\n\r\nAfter 22 years of existence, this is what my brain cells have to offer:\r\n1) Bullying happens because we let it happen. If you’re a witness to it, put a stop to it. We're basically bullies ourselves if we do nothing about it.\r\n2) Let’s finally shut up about our obsession with appearance and be satisfied already.\r\n3) “In three words, I can sum up everything I’ve learned about life: It goes on.” -Robert Frost\r\n4) I’m below average to poor in math, but according to my calculations, 99% of the time, life always works out. It may not work out how you initially wanted it to, and it may take A LOT of time and “bipolarity” (no disrespect), but it’ll happen if you let it happen and it’ll happen if you make it happen.\r\n5) Weird > Normal. Always. Don’t let anyone tell you otherwise. Ever.\r\n6) Besides a broken heart, there’s nothing more heart-breaking than loneliness. Since graduating college in June and starting a “big girl” job, I have experienced genuine loneliness for the first time. I know that I have people to go to when I’m feeling this way, but sometimes, I just don’t (Sorry, Connie…). Besides that one time I missed the e-mail about winning the Listserve, I’m pretty good about keeping up with my e-mails. If you’re ever feeling lonely, don’t hesitate to send me an e-mail. I know, STRANGER DANGER, but really, I would love to help. And if helping doesn’t go very far…or anywhere at all…know that I have rather large ears.\r\n\r\n\r\n\r\nWould you mind answering these very 22-year-old questions for me? \r\n1) What is *your* definition of love?\r\n2) I constantly wonder why we humans do things that make us so unhappy at times, even though we know we could die at any millisecond. How do you feel about this? How do you feel in general? What makes you happy? (Psychologist wannabe over here…)\r\n3) Favorite quote?\r\n4) Favorite song? (These rather large ears are desperate for new music.)\r\n5) My 23rd birthday is coming up…ish. How should I celebrate? How did you/others you know celebrate this mega milestone…not.\r\n\r\n\r\n\r\nWould you mind doing some very 22-year-old favors for me?\r\n1) Please don’t litter. Maybe even pick up some trash when you see it? I know, EW, but trash that has been sitting there for aeons is more EW than taking a few seconds of your time and throwing it away. 2 words: Hand sanitizer.\r\n2) Please make someone’s—ANYONE’S—day today…or everyday. You won’t only make their day, you’ll make your day too.\r\n3) Please do something a little or a lottle different everyday. Your life will be filled with 365-times the memories.\r\n4) Please just tell me about yourself/provide me with some of that wisdom of yours/vent/anything. \r\n5) Please be a good person. The universe needs more of those. \r\n\r\n\r\n\r\nIf you’re anywhere near Fresno, CA, please send me an e-mail, so we can grab some grub and be friends. \r\nThank you, Listservians, you’ve taught me quite a bit these past few months. I’m looking forward to reading your jackpot. Happy Holidays. I wish you all the absolute best. \r\nHi, Dad. I love you too.\r\n\r\n\r\nAriel Lani Llorente\r\nmellamoariel@aim.com\r\nFresno, CA\r\n\r\n", [2013, 12, 7]]