["[The Listserve]  Some recommendations", "Chris Barth", "An appeal to your senses – if you have some time to follow a stranger's recommendations, here's what I'd suggest:\r\n\r\nHEAR:\r\n\r\n - If you have less than 5 minutes, listen to James Blake's new single \"Retrograde\" because it's phenomenal.\r\n\r\n - If you have less than 20 minutes, search out the Love Club EP by Lorde. She's a 16-year-old from New Zealand and it's awesome pop stuff. Free on Soundcloud.\r\n\r\n - If you have less than an hour, listen to Paul Simon's 'Graceland,' it's the best album ever made.\r\n\r\n - If you have less than two hours, listen to Nicolas Jaar's Essential Mix. It's beautiful, classical stuff. Also free on Soundcloud; go for the Tong-less version.\r\n\r\n - If you have a few hours, go through Sam Cooke's discography. Make sure to stop by the Harlem Club. All Sam goes best with a Sunday morning and a mug of coffee.\r\n\r\nSEE:\r\n\r\n - If you're not watching Bob's Burgers, you totally should. Same with Archer. Plus Breaking Bad and Game of Thrones of course.\r\n\r\n - Cool Runnings is pretty much the best.\r\n\r\n - Read 'American Gods' by Neil Gaiman. 'Old Mr. Flood' by Joseph Mitchell. The Princess of Mars series by Edgar Rice Borroughs. Don't let anyone convince you young adult fiction is for young adults.\r\n\r\nTASTE:\r\n\r\n - Cook Alton Brown's recipe for homemade soft pretzels, they're easy and incredibly tasty.\r\n\r\n - Google 'coffee-rubbed steak nom and glug' and make that. A little self promotion, but the recipe is simple, it's less expensive than you think, and it will impress your friends.\r\n\r\n - Kalimotxos are the ultimate summertime drink. Half cheap red wine, half Coca-Cola, served on the rocks. Sounds horrible and trashy, but it's actually the best thing for a sweaty summer evening.\r\n\r\n  - Dark beer is always the right choice.\r\n\r\nSMELL:\r\n\r\n - Fresh roasted coffee. Chocolate chip cookies in the oven. Wet pavement after it rains. Pine trees. Sauteeing onions.\r\n\r\nFEEL:\r\n\r\n…free to get in touch! Always on the lookout for new recommendations. What should I cook? What should I put on the stereo while I cook it? I'm on Twitter at @BarthDoesThings or at the email below.\r\n\r\nHappy almost baseball season! Go Phillies!\r\n\r\n\r\nChris Barth\t\r\ncbarthrun@gmail.com\t\r\nBrooklyn, NY\r\n\r\n", [2013, 2, 27]]