["[The Listserve] 24Hrs", "Karthik Ramakrishnan", "My colleague, Kuan, wants to put a hit on me. The fact that I joined Listserve less than 10 days ago and won the lottery, has gotten his sense of justice out of whack. He feels wronged - Kuan: sorry buddy, you'll have to find a way to get over it.\r\n\r\nI was not prepared for this. I have not gathered any life lessons here - I'm still putting together the list that I can hand over to my kids. I will recount however what I would consider the most exhilarating time in my life. Here goes.\r\n\r\n-----------------------------------------------------------------------------------------------------------------\r\n\r\nI walked up to the gate agent and handed my passport. Could not contain my excitement - when the plane landed in Toronto, I would be entering my new home. I was migrating to Canada from India - a place I'd visited a couple of times but didn't really know much about. I was just turning 21,starting my Master's research at Concordia University in the fall - life was going to get a whole lot more interesting. I was overwhelmed with excitement and anxiety - I'd never spent any time in the western hemisphere and that too alone.\r\n\r\nI knew something was not going well when the agent frowned - passed my papers around to a few others - checked the computers, all the while giving me furtive looks. In short, I had stayed out too long and my residency papers had expired, they could not let me go through. All i could hear in my head was a big FUUUuuuuuucccccKKKK! An end to the ride - my pessimist side did the whole \"I told you so… it was too good to be true\"…. etc. I guess the agents took pity on the look of utter panic on my face. They were going to request London authorities to see if they would grant me 24Hrs in the city, goto the Canadian Embassy and work this out. The walk to the agent was the longest in my life - again I worked the whole sorry face and he allowed me into the country.\r\n\r\nThe fact that I only had a $100 with 24hrs to face in London complicated matters. Here's how that went. British Airways came through with a hotel, the concierge armed me with 3 maps to get to the Canadian High Commission. $80 left when I got to the embassy, convinced the guy that he had to let me in - double sorry face - paid $60 for a photo and application - came out with $20 in hand.\r\n\r\nI had 1 hour to get back and make my flight - I only had a 12 hours permit to enter Canada. The Ritz, Bond Street, Buckingham Palace, Hyde Park, Paddington Station, Piccadilly Circus  - my mind was blowing up. Imagine if one day you woke up and were in Harry Potter land and it was real OR a 6 year old in Disney Land. That is how I felt. All the stuff I had read about in Wodehouse, Shelock Holmes, the news - they were all real. Sooo cooool! Every little detail from the sights, to the sounds and the smells from that experience are etched in my mind. Swore I would be back.( I did - ended up living there for a year later in life).\r\n\r\nNeedless to say I skipped all food and still had $10 when I boarded the flight - one that 24 hrs before I did not think I would ever make. Learnt a few lessons though. If you care to read it is :\r\n\r\n1. Don't take NO for an answer. You can always find a way to negotiate.\r\n2. You can make any amount of money work for you.\r\n3. If you want something - put yourself in front of it and carpe diem the heck out of it.\r\nI've kinda lived by these till now.\r\n\r\nThanks if you actually read to the end.\r\n\r\n\r\nKarthik Ramakrishnan\r\nkramki@gmail.com\r\nNew York/Toronto\r\n\r\n", [2013, 10, 24]]