["[The Listserve] My World is your World", "Melea Johnson", "So you're casually sifting through your e-mail's at the end of the day, to then stumble upon the one granting you the power to enter 21,440 international inboxes within the next 48 hours... well shoot, now what?\r\nCan't say that I have life inspiring words to share or a heartfelt story to tell, so instead I'll give you a 3 minute insight to the life I live.\r\n\r\nI'm Melea, one of those names you can't remember or enunciate correctly for at least the first 3 or 4 introductions. It's fine, I'm over it. I simple it down to MJ when I'm not in the mood to repeat \"Mah-Leah\" in slow motion multiple times over.\r\nI'm 21, tall, silly, and really good at drinking beer. Gotta make the parents proud somehow ya know?\r\nI have a quality twin brother, 3 sexy sisters and 2 cute parents that never fail to amaze me. The 7 of us have somehow managed to master this casual Brady Bunch vibe, which I can easily pinpoint to the one thing I am most grateful for.\r\n\r\nRunning, piano and travel are the 3 keys to my heart. All of which make keep my soul smiling for all of eternity.\r\nLast year, I  swapped the usual textbooks in for my passport and hit the wide open road. In 10 months I managed to experience 20 countries and was able to shift through all 360 longitudinal degrees this world has to offer. Those few hundred righteous days are a massive collection of the most beautiful moments that I cannot even begin to put into words, and will always be kept at the top of my heart. It's the people you find, and that find you, while experinceing foreign cultures, currencies and countries that make such an unforgettable impact on your life and the way you live it. \r\nIf your stuck being sad, travel.\r\nIf you're bored with things, travel.\r\nIf you're happy, travel. \r\nIt doesn't matter where you start, just start. \r\nA couple months into my trip, I came to the conclusion that backpacking should be a pre-requisite to becoming an adult. It's a lifestyle that you cannot explain to those who haven't, and those who have, get it without any explanation needed. \r\nI was planning on staying on the road for another year, or 4, but learned of my acceptance into Engineering at the University of Calgary mid - July, so I figured it was time to come back home and sort out my education.\r\nBeing back in this strict scheduled school atmosphere has been a struggle to say the least. I've come to the realization that all test writing abilities I'd acquired over my previous 15 years of education, were lost somewhere south of the equator. Shoot, hate when that happens. Attempting to navigate one of the most strenuous degrees I could've enrolled myself into after a year of being lost in the world was a bit presumptuous, my bad. Here's hoping I make it out the other side.\r\nThe single thing keeping my determined head up is the job opportunity after these 4 years. From the 10 short months of foreign living I was lucky enough to experience, I've learned the world is a crucial component I need in my life for the rest of my life. I need a career that allows me to travel to any country at any time for any reason. I need that plethora of opportunity and adventure at every turn, where meeting new friends becomes as innate conversing with old ones.\r\n\r\nSo boys and girls, to sum up; round up a backpack and a couple dollars and hit the world, I'll meet ya there.\r\n\r\nIf any of you happen to be looking for a new up and coming engineer to fit a job outline of ample travel, I'm your lady. \r\nOr if anyone could hook me up with a more intelligent brain so I can cake walk through the next 3 years of this degree, that would be absolutely fantastic. \r\n\r\nI appreciate the few minutes you've given me, and will gladly return the favour when your Listserve stars line up.\r\nUntil next time my darlings, keep it cute.\r\n\r\nMelea Johnson\r\nmelea.johnson@hotmail.com\r\nCalgary AB, Canada\r\n\r\n", [2013, 3, 19]]