["[The Listserve] Lean UX, without skimping on the meat", "anthonydpaul", "Some years ago, I worked for a creative agency moving to a new location, neighboring a known specialty grocery chain. Among the reasons I was excited about the move was the prospect of offsetting my takeout lunch intake with salad bar hopping. On first visit, I surveyed the bar and saw all of the wonderful things, assembling a hodge-podge of covetable ingredients. At checkout, it was a bit steep for lunch, but I scuttled to my desk to enjoy the salad anyway. The trouble was, it was a big letdown. The components were okay together, but somehow it just wasn't as good as picking Joe salad from a menu. However, I wasn't discouraged.\r\n\r\nOn return, I went in planning to make a Greek salad—one of my favorites. Mixed greens, fancy olives, tomato, red onion…no cucumber, but I used zucchini. Feta was missing, but I figured shredded mozzarella would be closer than bleu cheese. No Greek dressing, but Italian worked. Again at checkout, the salad was a bit more expensive than preferred, but it was the healthy choice. The result was just okay. I'm an optimist, so I tried again.\r\n\r\nConsecutively, I built the staples. For caesar, I used Kalamata olives because there were no black. For wedge, ranch dressing with bleu cheese crumbles added. By the time I completed each salad, I'd replaced enough critical ingredients, the salad was no longer the amazing image I held in my head.\r\n\r\nI ended up attributing this experience with the chain's brand. It resulted in disliking the brand that relentlessly teased me with *almost* what I needed, then overcharged me to boot. I refused to attend, when invited by co-workers.\r\nIt was when one of them asked me why, and I reflected on the reason, where I realized this is a perfect metaphor for my job—and why I love what I do.\r\n\r\nBefore I transition, there is another brand that does this well—BD's Mongolian BBQ. Now, I'm not a huge fan of the place for other reasons, but their model is exemplary. Aside from the salad bar spread, they put 1-2-3 recipes on the wall to model from. This performs two functions:\r\n1) It accounts for multiple user types: the intimidated first-timer, the deviator who swaps a couple things, and it doesn't inhibit the balls-out \"do what I want\" customer.\r\n2) More importantly, however, the recipe process audits the content of the salad bar to establish a foundation for creativity—a bare-minimum set of ingredients a salad bar should contain BEFORE adding flare.\r\n\r\nHad the grocery chain performed the same surface-level analysis of their audiences, common tasks, and balanced \"wants\" with \"needs\", their salad bar would've aced every time. They'd be able to look at X-number of bins and quantify the brand experience cost of one flare ingredient against an essential. Suddenly, my salad that's somehow more expensive than the full meal across the street would've surpassed the visage my mind, olfactories, and drool were painting—leaving my pockets emptier, but my brand bond fuller.\r\n\r\n-----\r\n\r\nI used this example to setup a conference talk on structuring personas and use cases to tackle everyday user experience problems. A web designer and developer “unicorn” for some years, I settled into user experience architecture and found my calling. I love (love, love) taking abstract human problems such as this, and breaking them down to find tangible solutions—intersecting art, behavioral science, research, code, and empathy, to facilitate human bonds with non-human things like websites or ideas.\r\nTalk shop with me by Googling “anthonydpaul”. If you're in the Baltimore/DC meetup scene, find me.\r\n\r\n\r\n@anthonydpaul\t\r\nanthonydpaul@gmail.com\t\r\nBaltimore/DC\r\n\r\n", [2013, 6, 11]]