["[The Listserve] Words strung, a story", "Anonymous", "...She walked round the block, from her house to ours, after her chemotherapy treatment. She didn’t wear her kerchief. The morning was light, airy, and blue. Green leaves hung heavily from strong oak branches, and cicadas buzzed heavily from within them, hidden. As Maya trudged over the sidewalk, her legs began to feel lighter and lighter.\r\n\tHer walk was short, and took all of two minutes. By the time she arrived at our yellow house her legs were so light, she began to float. She was in the air; only by a few inches, but not at all grounded. With purposeful movements she opened the wide, white gate to our backyard garden and entered, closing it behind her carefully. She didn’t ring a doorbell or knock. No one, besides herself, knew where she was.\r\n\tThe garden had been watered that morning, and it was still early. Humid air was trapped below the greenery, giving the garden a damp, jungle-like feel.\r\n\tMaya looked over the rows of shrubbery, and the assortment of flowers, and took up the nearby shovel. She started digging up the pink impatiens, then the large, leafy bleeding heart.\r\n\tWe, inside, heard the loud shoveling noise and gathered at the back window. Seeing her, we watched with a sense of dread. What was she doing? Under some spell, we didn’t think to go out and ask; we stayed in, observing, unblinking, chests pounding. Mom called Maya’s mom, told her Maya was up to something; that none of us knew what to do.\r\n\tWe watched as Maya shoveled with regular strong strokes, carefully piling the dirt to the side of the growing hole, which within an hour gaped. Clearly satisfied, visibly tiring, she sat in it and began covering herself; all except her hairless head. It stuck up, surrounded by dirt, severed flowers, and half-leaves. Then she began to yell.\r\n\t“I need water!”\r\n\tWe heard her from our window perch, and so went to the backyard. Arriving at the site, we saw exactly what we had viewed from inside: Maya’s face sticking up out of the dirt. Like a flower, but pale, and plain, and beckoning. I grasped the handle of a watering can.\r\n\t“Water me!,” she cried.\r\n\tThe water from the hose was cold. I ran some into the can, and then positioned it over her head.\r\n\t“Yes!,” she said.\r\n\tWe all took turns watering Maya’s head, and she made clownish faces as the water flowed downwards, over her eyes which blinked and opened wide repetitively, over her mouth which spurted and smiled; over her pale, vein-lined scalp.\r\n\r\n\r\nAnonymous\r\nlistserve.address5@gmail.com\r\nNew York\r\n\r\n(P.S. Many thanks to the listserve and to all who participate for the daily messages.)\r\n\r\n", [2013, 12, 3]]