["[The Listserve] Moments of Gratitude", "Briana", "Last year I watched a TED talk about lollipops (go ahead and watch it) and the impact you can have one someone’s life without even knowing it. I’ve found that a lot of people, myself included, are pretty terrible at expressing gratitude, at letting people know how important they are or how they have helped you to grow. Maybe it’s because we don’t realize the effect they’ve had until long after the interaction.\r\n\r\nAs a part of my job, I organize a staff training program including a safety and security training. Among engaging powerpoints, indoor drills, and one pretty memorable outdoor activity, we also make sure that every person has had the hands on experience of using a fire extinguisher* - the idea is that you have to actually do something to feel comfortable doing it. I feel the same way about expressing gratitude, praise, feedback and more. You have to get in the practice of doing it – and the more you do – the more natural it is.\r\n\r\nSo I’ll it started – “Thank you”\r\n\r\nTo the family I was born to and have found over the years for inspiring me to do better, to learn more, to take risks, to trust, to explore.\r\n\r\nTo the friends I have lost touch with – there is a certain comfort in knowing that you pop in and out of my memories, that one day we’ll reconnect and it will be like no time has passed at all … or a great deal of time and still we’ll reminisce with joy.\r\n\r\nTo the friends I have lost for helping me to see how I’ve grown, where I’ve come from, teaching me to prioritize and make hard choices.\r\n\r\nTo my supervisors in work over the years for giving me so many opportunities to get better, experience different styles, learn, and develop over time. For trusting me.\r\n\r\nTo my mentors, assigned, found, stumbled upon (and those of you who just don’t know how much I look up to you) for taking the time to invest in me and my success – for learning from me and giving to me, for challenging and pushing, and helping me to fly.\r\n\r\nTo the people I’ve worked with in so many different jobs for collaboration, inspiration, funny videos, teaching your skills and making work seem like fun.\r\n\r\nAnd to the people who have worked for me for helping me to grow, offering your knowledge and perspective, and understanding that we are all working with the best intentions.\r\n\r\nThis is vague – I know. I’ll try to be better at acknowledging these realizations as they occur. I only encourage you to do the same. Thank someone, tell them how they influenced you, how they changed you.\r\n\r\nThere were other things I imagined I would want to email to all of you about... they included:\r\n\r\nThe Little Prince (please read it... again)\r\n\r\nSarah Kay (amazing spoken word)\r\n\r\nTravel (do it...it's good for the soul)\r\n\r\nCooking or recipes or something (but there's pinterest, right?)\r\n\r\nSocial Media, Networking, and Connections (It's a little overwhelming really)\r\n\r\nSummer Camp (what an incredible experience for kids to learn how to be kids… good, independent, kind, adventurous, filled with wonder kids)\r\n\r\n\r\nBriana\r\nKirkland, WA\r\nparbba@gmail.com\r\n\r\n* Oh, and really… if you haven’t ever used a fire extinguisher – try it in an empty parking lot once before you need to in a real emergency.\r\n\r\n", [2013, 4, 12]]