["[The Listserve] On Quitting", "The Listserve", "I’m a proud quitter.\r\n\r\nColleges, jobs, lovers, projects, friends, towns, countries, you name it. I would have quit the planet if Mars One had been ready yet. This isn't the part that makes me especially proud.\r\n\r\nIt’s like Brewster’s Millions and I’m the Richard Pryor of quitting: I have a certain amount of Quit to spend each day or I’ll lose it. The turning point for me was discovering that I could chose, in advance, what to quit and not be forced to meet my quota in regrettable meltdowns.\r\n\r\nQuitting isn’t bad in and of itself. Huh. I can’t tell you how freeing this realization has been. I mean, I have become such a good quitter that it’s possibly my superpower--and who wants to relinquish a superpower? No need to when it can be harnessed.\r\n\r\nI searched for things to quit. Didn’t have to look far. Turns out many habits are well worth quitting anyway and take a quitter’s grit. I focused on habits that *I* can’t easily moderate, that--no matter how much I enjoy them--addict me. Everyone would have a different list. Roughly in this order, I've quit:\r\n\r\n * TV\r\n * Tobacco\r\n * News\r\n * Alcohol\r\n * Marijuana\r\n * Caffeine\r\n * Porn\r\n * Masturbation\r\n * Sugar\r\n * Carbs\r\n * Processed Food\r\n\r\nNot everyone can or even should be a quitter, I suppose. But it's worked for me.\r\n\r\nHow does it feel? Rad, yes. It’s no magic bullet, but I am much more comfortable being just me right where I am.\r\n\r\nWhat do I do with the extra juice? I enter waking dreams as often as possible: by playing with kids, by drawing, and by reading and writing fiction.\r\n\r\nIf you’re not getting the mileage you want, why not embrace your inner quitter?\r\n\r\nNext up on my Quit List:\r\n\r\n * Buying New Things\r\n * Making Trash\r\n * Taking It Personally\r\n * Being Quiet About It\r\n\r\nI’m taking suggestions and I’m curious: What would you quit?\r\n\r\n\r\nCheers,\r\n\r\nMike\r\nmichael.carychao@gmail.com\r\nBerkeley, California, USA\r\n\r\nP.S. - My science fiction and slice-of-life short stories are out there as ebooks, if you’re into that kind of thing. Here’s to keeping quit.\r\n\r\n", [2013, 10, 26]]