["[The Listserve] On Rabbit Hair and Doctor Who", "Khai Yen", "A while ago a friend asked: \"What's the purpose of your life?\" and I remember replying \"to help others\" (something which I'm shamefully not doing enough of). Still no satisfactory answer to that question from me yet (hey I'm just 19) but I do have a few stray thoughts, so read on if you would indulge in the naivety of a teen. \r\n\r\n1. In \"Sophie's World\" Gaarder compared the world we live in to a rabbit: \"All mortals are born at the very tip of the rabbit's fine hairs, where they are in a position to wonder at the impossibility of the trick. But as they grow older they work themselves ever deeper into the fur. And there they stay. They become so comfortable they never risk crawling back up the fragile hairs again. Only philosophers embark on this perilous expedition to the outermost reaches of language and existence. 'Ladies and gentlemen,' they yell, 'we are floating in space!'. But none of the people down there care. 'What a bunch of troublemakers!' they say, 'Would you pass the butter, please? How much have our stocks risen today?'\"\r\n\r\nThis passage is stuck in my head; the image of a yelling philosopher clinging on to the end of a rabbit hair keeps coming back to mind. Make whatever of it you would, or go pick up a copy of the book even. But as Albert Knox cautioned Sophie, perhaps Gaarder is just reminding us to remain curious like a child; not to become world-weary.\r\n\r\n2. Camus talks about the absurd - the contradiction between man's search for meaning in life and his failure to find any - and offers three solutions: to escape through suicide, to commit a leap of faith in the transcendent or to just accept the absurd. I don't quite understand Camus yet, but what if he is right in that the purpose of life remains elusive to everyone? How devoid of hope our lives will be, when \"living is keeping the absurd alive; and keeping it alive is, above all, contemplating it\"?\r\n\r\n(I could go on a bit more on Chinese philosophy and the role of pursuing morality in life - is it at all important? - but I think I should probably stop all these philosophical nonsense already)\r\n\r\n3. Spend time with your family and loved ones. Call them. Nothing's more important. \r\n\r\n4. Help others. \r\n\r\n5. Cook and create new dishes! (If you happen to have a Chinese store nearby that sells Laoganma chilli oil, try that with everything. And I mean EVERYTHING)\r\n\r\n6. And watch the latest episode of Doctor Who, of course. Happy 50th anniversary!\r\n\r\nI think I might possibly be the first from my country to win the Listserve lottery (A little wave to my fellow countrymen!) So I'm ending off with a quick introduction of Malaysia:\r\n- Southernmost country on Eurasia mainland\r\n- Beautiful weather\r\n- Delicious food\r\n- Lovely beaches\r\n- Wonderful people\r\nSo come visit us if you're planning a holiday to Asia!\r\n\r\nLive simple, live healthy, live happy :)\r\n\r\n\r\nRegards.\r\n\r\nKhai Yen\r\nhewcab@hotmail.com\r\nSingapore\r\n\r\n", [2013, 9, 30]]