["[The Listserve] The only brave thing that a firefighter does is take the oath, the rest is just duty.", "Dustin Werner", "I became a volunteer firefighter in 2005 in York, Pennsylvania.  I don’t know why I joined, it just seemed like something to do at the time.  Everybody loves a fire truck, and the station was covered in photographs from before my grandparents were even born.  The people had a dry, morbid sense of humor, which seemed to fit my personality.  It seemed like it would be something different to do with my days.\r\n\r\nI passed fire school, got a few years of experience under my belt, and decided that I wanted to do this for a living.  2 years and 3 applications later, I was accepted into the Baltimore City Fire Department in 2008.  I began the fire academy.\r\n\r\nMore push-ups and yelling than I could have ever expected, but I learned all of the quirks that my local county training had never taught me. Baltimore was much different than little old York ever was.  I learned about checking your hydrants for drugs or guns before hooking up and charging supply lines. I learned never to stand directly in front of a door after knocking on it, in case somebody decided to shoot first and ask questions later.  I learned how to survive in a big city.\r\n\r\nMany of our citizens are below the poverty level, and are uninsured or severely underinsured.  Working in Baltimore City means that I became an emergency medical technician in the academy (it’s a requirement). I spend my days cleaning up things that have shown me the worst parts of humanity.  It’s quite easy to become jaded.  Anyone who has ever been to Baltimore knows that it’s rough down here.  We don’t have the arson problem to the extent that Detroit does, but we have no shortage of violence.  I think we could easily compete with Chicago any day.\r\n\r\nThe only thing that we ask of our citizens is to remember us come budget time.  We don’t need much, just fire engines that pump water and medics that don’t break down in the middle of a run.  Right now, I personally have seen patients wait upwards of 1+ hour for an ambulance and I’ve seen engines that wouldn’t pump water at a fire.  Sometimes, it seems like we’re always on the chopping block, and it sucks knowing that someone is dead or a house collapsed because of equipment failure.  I think that without good paramedics and functioning ambulances, our death by homicide rate would be much higher.\r\n\r\nJust a few things you can do:\r\n\r\n·         Remember the ones who lose their lives doing this job.  343 in New York City, 9 in Charleston, 10 in West Texas, 19 in Arizona, and the ones here and there that are all gone because of their bravery.\r\n\r\n·         Visit your local firehouse.  The history there will amaze you, the people will humor you, and it makes a great trip for those of you with children.\r\n\r\n·         Slow down!  If it isn’t fire or heart attacks that kill us, it’s people driving too fast down a highway even after they see the big red truck with the flashing lights.\r\n\r\n·         If you ever go the 9/11 memorial, make sure to visit Engine/Truck 10 right across the street.  Their website tells an incredible story of that morning, and the plaque on the side of the firehouse is incredible and moving.\r\n\r\nJoin.  Many small towns are protected solely by volunteers, and the fire service has a pension for pulling all types of people.\r\n\r\nDustin Werner\r\nlistservefirefighter@gmail.com\r\nDallastown, PA\r\n\r\n\r\n", [2013, 8, 20]]