["[The Listserve] Self-help or hemorrhoids?  You get to choose!", "Rafa D.", "Two facts: 1) I love \"self-help\" books and 2) in high school I was the prom king.\r\n\r\nFor whatever reason, \"self-help\" and \"self-improvement\" have gotten a bad rap.  There seems to be an attitude that a book titled \"The Gifts of Imperfection: Let Go of Who You Think You're Supposed to Be and Embrace Who You Are\" is necessarily a book written for \"losers.\"  It's not.  I promise you.  It's an awesome book filled with real insights.\r\n\r\nAnd there are tons of other books, seminars, blogs, coaches, and therapists that are so wise and so helpful, but we often don't take advantage of them because we don't want to be in the company of the \"losers\" who need those kinds of things.\r\n\r\nMany people would be more comfortable browsing the hemorrhoid treatment aisle in the drug store than the self-help aisle of the library.  \"What if someone SEES me?!\"\r\n\r\nBut when it comes to real relief from pain and the end of discomfort, the self-help aisle is where it's at, homies!\r\n\r\nLife is challenging.  We fail at things.  People disappoint us.  People die.  Relationships don't work out.  We make bad decisions.  Or even worse, we make decisions and then we can't TELL if they're good or bad so we drive ourselves crazy about it all.  Growing up is weird and nobody knows if they're doing it right.\r\n\r\nWhy not get help from really smart, compassionate people who have thought a lot about what makes human beings happy and fulfilled?\r\n\r\nWhy does \"self-improvement\" get the stigma?  I don't get it.  I mean, if we aren't about improving ourselves with the short amount of time we have in the world, then what the heck are we about?\r\n\r\nI buy self-help books and I have an amazing girlfriend.  I've worked with a life coach and I was a college athlete.  I attend self-improvement seminars and I have a job that I love.  These are not mutually exclusive things.  In fact, it is largely BECAUSE OF the self-help stuff and the self-knowledge that comes with it that my life has improved.  And I hope it continues to improve because I'm still too much inside my own head about things.  On a daily basis I still think that I'm not enough, that people don't like me, that I walk funny, that I'm not capable of being a good friend, that something is wrong with me because I'm almost 30 and I still get zits sometimes, especially after shaving.  These are my hangups.  There are more.\r\n\r\nI'm sure you have your hangups too.  The thing is, there are TONS of great books and people out there who can help us live more generous and authentic lives.  And they're available as soon as we ditch this stigma around \"self-help.\"\r\n\r\nSelf-help isn't for losers.  Self-help is for badasses like us who are up to big things.  I get to say that.  Because one time, a plurality of public high school kids said I was the king of their very important dance.\r\n\r\nBooks:\r\nThe Gifts of Imperfection: Let Go of Who You Think You're Supposed to Be and Embrace Who You Are\r\nThe Art of Possibility: Transforming Professional and Personal Life\r\nUncertainty: Turning Fear And Doubt Into Fuel For Brilliance\r\nA Grace Disguised: How The Soul Grows Through Loss\r\nThe Power of Full Engagement: Managing Energy, Not Time, Is the Key to High Performance and Personal Renewal\r\n\r\nSeminars: The Landmark Forum (Seriously guys, this one will change your life.  Well worth every penny.  Check it out!  The world needs your awesomeness!)\r\n\r\n\r\nRafa D.\t\r\nrafalistserve@gmail.com\t\r\nUSA\r\n\r\n", [2013, 8, 10]]