["[The Listserve] Death to Normalcy!", "Rachael Smith", "GISHWHES. The Greatest International Scavenger Hunt the World Has Ever Seen. This year, it started at 9.08 GMT on Sunday 11th August. It’s officially the world’s largest scavenger hunt and it sees thousands of people going about doing crazy creative things for one week. I first took part last year, in the second GISHWHES and have decided that I’m just about recovered enough from last year to do it again now.\r\n\r\nDeciding to join a GISHWHES team was probably one of the best decisions I made last year. I was contributing a little money towards the grand prize fund, and some to a charity that’s linked with the Hunt. GISHWHES joined me and my friends to a group of complete strangers that we had to work with to get the items completed. We ended up working on a 3 foot high dinosaur made of sanitary towels and a 12 foot long scarf.\r\n\r\nThe thing about GISHWHES is not the weird stuff you end up doing, or the slightly freaked out cashier at the till when you buy 20 packs of extra strong sanitary pads, but it’s the way it connected us to other crazy, like-minded people and the way we got to come out of our shells. GISHWHES was and still is a great excuse to just be a little weird every now and then. GISHWHES isn’t about who has the most money or which team has the most creative people; it’s about changing the world for the better and while you’re at it, changing yourself and having fun too.\r\n\r\nWe didn’t win last year, I don’t even think we came very close, but we all had great fun and did things we hadn’t done before. We helped out some people doing a sponsored hitch-hike in return for help completing an item on our list, we met new people and while we didn’t get to take a trip to a haunted Scottish mansion with an actor, we had that week of pure concentrated fun.\r\n\r\nWhen I first found out that I’d won the Listserve lottery, I asked almost everyone I know what they would write about if they were me. My mum said something conveying a ‘carpe diem’ sort of message; my sister said something political; my god parents said women’s rights. I thought I’d tell you about GISHWHES because it’s something I believe in, even if it sounds trivial to say ‘I believe in a media scavenger hunt’. GISHWHES allows you to let out your inner creative genius and enjoy a bit of childish glee.\r\n\r\nI think more people should stop concerning themselves with labels and politics so much and start trying to enjoy life a little more.\r\n\r\nEnjoy your life,\r\n\r\nRachael Smith\r\nRachael.Smith8809@gmail.com\r\nLondon, UK\r\n\r\n", [2013, 8, 19]]