["[The Listserve] On Four-Year-Olds and Freedom", "Olivia Warren", "I hope you all have four-year-olds in your life who ask impossible questions twice a minute.\r\n\r\nI have a nephew.\r\n\r\nTwo weeks ago, while my brother and I drove him to the zoo singing country music at the top of our lungs, my nephew stopped us mid-lyric. \"What's free? You said free?\" Strapped into a car seat, wearing swim goggles, covered in chocolate, peanut shells, cheddar bunnies, and matchbox cars, my nephew had asked a question so fundamental to all of our daily lives that we often forget it's a question at all.\r\n\r\nI pulled the \"I'm-just-the-aunt\" card, and turned to my brother to articulate one of the ideals our nation was founded upon, one of the dreams we are all supposed to hold together. Somehow, with no time to prepare, he boiled down freedom to the perfect level for his son’s current cerebral development. “It’s being able to make choices in your life,” he explained. My nephew processed, nodded, and resumed racing his sticky cars around his sticky seat.\r\n\r\nMy brother didn’t say that freedom meant being able to do absolutely anything you want. He didn’t say that freedom meant having no commitment or responsibility. He defined it as the ability to make choices, and I like that my nephew’s first encounter with this enormous word gave it the weight it deserves.\r\n\r\nI began to feel my own freedom recently, after working closely with a few of the more than two million incarcerated adults in our country. I coordinate a pro bono practice out of a law firm, in which we provide free legal representation to defendants facing violent felony charges. I spend my time in jail, prison, and courtrooms, listening to and advocating for people who may never know freedom again.\r\n\r\nToday was the sentencing of the defendant we represented in my first full jury trial. Any sentence he faced carried a term to life, which means the number would simply be the year eligible to be denied parole. No parole board will ever approve release, and, in his mid-fifties, he is facing death behind bars. The sentence wasn’t about his prison term, but about where and how he will die. Much of what I do in defense begins to feel like end-of-life counseling, helping people understand that they will have almost no choices for the foreseeable future, if not the rest of their lives.\r\n\r\nWalking out and continuing to live my life, free, brings new awareness. I think about the many surfaces I cross, the sounds I hear, the way light reflects on the world around me. Every time I leave Rikers Island, I feel the painful irony that the bridge back to Queens provides the most spectacular view of the New York City skyline, a view and a place that the 12,000 inmates will not see or enjoy for years.\r\n\r\nIn my brief experiences in criminal justice, I see a system that temporarily retains while fostering more hatred, violence, and division. I see judges and prosecutors with their hands tied by obscenely high sentences: three years for a stolen cell phone, eight years for a burgled DVD player. I see my tax dollars adding to the sum total of suffering in this country, instead of developing opportunity.\r\n\r\nMany days I forget the choices I have, the choices I make. I don’t want to forget my freedom. With it, I am going to try to change what prison means in America, because we as a country are better, smarter, and kinder than the injustice we submit our citizens to every day.\r\n\r\nMake good choices.\r\n\r\n\r\nOlivia Warren\r\nolivia.a.warren@gmail.com\r\nNYC\r\n\r\n", [2013, 9, 23]]