["[The Listserve] Our Son, Evenson", "Mike Nagel", "“In Avril, me give you won chick hen.”\r\n\r\nEvenson’s English is getting better. The weekly classes are paying off, but he struggles with proper grammar.\r\n\r\nEvenson is 14 and he’s in the fourth grade. It’s not because he’s unintelligent. He’s actually quite brilliant—he works well his hands and learns quickly. But Evenson is behind in school because most years his family couldn’t afford to send him. He’s the oldest of five, and his father is dead. For several years, his mom raised him and his sister, Ludmia, as a widow. Then she remarried and quickly had three more little ones. Feeding the kids was more important than paying tuition.\r\n\r\nMy wife, Sonja, and I hear his crackly voice come through Skype. He offers us a chicken, and it takes a second for the words—then the profound gesture—to register.\r\n\r\nEvenson has one rooster (kòk) and two hens (poul). Three chickens. And he wants to give us one.\r\n\r\nHis simple gesture grips us and we just melt.\r\n\r\nMelting. That happens often in Haiti. And it happens particularly often with Evenson.\r\n\r\nSonja met him first. We were with a team in Carrefour and Evenson tagged along because following twenty blan was more interesting than not. He spoke enough English to tell her his name, and the two set to drawing pictures in a notebook and learning snippets of each other’s language: tree and pye, dog and chen, car and machin.\r\n\r\nQuickly, they became inseparable. He spent every day glued to Sonja, learning new words and listening to Michael Jackson on her iPod (He loves to sing, and his voice cracks now).\r\n\r\nI melted the first time, I think, when Evenson made a heart from a plastic bottle cap rig and gave it to Sonja. She gave him a hair tie to wear on his wrist.\r\n\r\nWe took him to the beach, and Sonja carried him on her back into the water. I watched the two of them spin and splash in the waves while joy just washed over me.\r\n\r\nWe were only in Haiti for a week, but when we left, tears were shed. And we knew we had to see him again.\r\n\r\nEvenson became the reason that we kept going to Haiti. We go regularly now to do volunteer work, develop relationships with community leaders, visit friends and, mainly, to see Evenson.\r\n\r\nWith less money than we would spend on a weekend getaway, we helped Evenson’s parents start a business. Now Evenson, Ludmia, and his brother Josie go to school. The seven-person family also moved from a small tent to a small room that makes our two-bedroom apartment appear like a mansion.\r\n\r\nYou can’t be in Haiti without being overwhelmed by the poverty. Simple things we take for granted—clean water, electricity, groceries, new shoes—are luxuries out of the reach of most.\r\n\r\nYou also can’t help but be overwhelmed by the passionate generosity. There’s our crippled friend Leonard who insists on standing while you sit on chairs borrowed from the neighbors. Or there’s another friend, homeless since the 2010 earthquake, who brings us more breadfruit than we could possibly eat.\r\n\r\nYour heart just melts. And melts. And melts.\r\n\r\nSonja and I don’t have kids yet, so Evenson is the closest thing we have to a son. We keep going back to Haiti to see him. And to be in a place that feels like home because it is full of more love, joy and generosity than anywhere else I have ever been.\r\n\r\nMike Nagel\r\nDover, NH\r\n@SeeMikeWrite\r\n\r\n", [2013, 4, 2]]