["[The Listserve] My, Would You Look at the Time", "Charles Austin", "I’m reading a book called “Daily Rituals: How Artists Work” that catalogues the daily habits of famous authors, artists, composers, and so on from the past few centuries. It’s got some helpful tips (e.g. this one courtesy of statesman and turkey enthusiast Ben Franklin: make a list of your goals for the day in the morning; at night, ask yourself what you’ve accomplished) but the most striking commonality among these great minds is that most of them had the luxury to devote their entire lives to what they loved.\r\n\r\nI’m 25 now and I’ve spent the better part of three years working the kind of meaningless office job that’s conspicuously absent from most stories in that book. I’m not delusional enough to think I’m on par with Beethoven or Shakespeare or somebody, but I think I can do better than an office job. I’ll admit, I’d love to invent the light bulb, but some guy already did it. And we already have the other stuff that people need, like cotton gins and Angry Birds.\r\n\r\nSo for now, all I can do is make the best use of my time outside the office. The older I get, the more conscious I become about how to spend my time wisely. I try to ask myself whether any activity I’m doing is meaningful to me and why. I’ve spent so much time in my life on passive activities with no value to me. Watching reruns of the Fresh Prince, reading Buzzfeed lists of the 17 Kittens Most Likely to Run for Congress. It all makes me want to regurgitate that one cliché about how time is our most precious resource, but you guys already know that. And actually… Water is probably more important.\r\n\r\nOkay. Sorry, but while we’re on the subject of water, I’m going to make a recommendation and say I’m pretty sure everybody on this list would enjoy reading David Foster Wallace’s “This is Water.” It’s really quick and breezy and you can find it free online.\r\n\r\nDid you read “This is Water”? Okay, good. It’s pretty synonymous with my own thoughts on the importance of being conscious of the little decisions we all make in life. Which brings me back to my main point. While I don’t think I have enough skills or direction to quit my aforementioned office job quite yet, I try to spend my free time in ways that matter to me. Mostly I play music, record music, read, and write longwinded ListServe emails.\r\n\r\nUsing the internet as my guide I’ve gotten alright at recording music—I’ve got Pro Tools and all the usual-suspect cheap mics—SM57s, MXL 990s—but I’d love to learn in a more formalized manner. It seems like kind of a crass request to tack on here, but do you guys know anybody who works in a recording studio in Chicago? I was once an intern for a well-known TV show so I am an expert at running errands, doing chores, and providing unpaid labor in a professional setting.\r\n\r\nIn any case, I hope everybody takes a moment each evening—like Ben Franklin—to think about what they did that was meaningful that day. Most of us will never have our faces on money or sign a Declaration of Independence but hopefully we can make the best of the time we’ve got.\r\n\r\n\r\nCharles Austin\r\ncgoten@gmail.com\r\nChicago, IL\r\n\r\n", [2013, 9, 28]]