["[The Listserve] Change is Awesome!", "Muneera Zaidi", "Hello ListServe community!\r\n\r\nSo EXACTLY a year ago from today my close friend & home girl Layla (Hii Lovely!) forwarded me a ListServe email titled Random Beauty (by Ishita in Kolkata, India, hello to you as well J ). It is such beautiful synchronicity that now, literally to the day, I just won the chance to write to you all! I’ve thought about this day happening since I signed up, but I also believed that something amazing would be in the process of occurring when this lucky moment aligns with my life...  And I’m sitting here laughing to myself because this is probably the first time in my life that I have absolutely nothing concrete/academic or otherwise happening. Well played universe, well played... It’s quite unsettling for me, realizing this and not knowing when things will change, but at the same time knowing they will. Ever get the feeling of knowing something without knowing anything at all?\r\n\r\nI know many people avoid changing, and it’s a shame because change is beautiful if you let it be. About 3 years ago I moved to New York City to pursue a graduate degree in Counseling Psychology at Columbia University, but what I have gained in the process of my education is an evolution of my entire self.  Young, naïve, hopeful and afraid, I eagerly ventured out of my hometown in Houston, TX (what up, Htown!)… I wanted more, to know more, to experience more, and do more. And I still do.  As a counselor, I get to help people re-shift, refocus, and empower their life into a more meaningful experience, but to me, the most special part of that is the relationships I build with people; just connecting with someone. Currently, I’m at a very in between place, or rather in transition I should say. I just graduated with a double Masters (I know, overachiever much…), and finished an amazing yearlong internship as a Family/Couples/Individual Counselor, so what’s next? I can’t wait to find out! Potential employers do feel free to contact me (or look me up on Linkedin) J\r\n\r\nSo coming full circle now, in the initial ListServe email I was forwarded, I learned about a Japanese phrase, Koi No Yokan.  Ishita, you described it as “The feeling you can get when meeting a person for the first time, that you will fall in love with them. Different from \"love at first sight\", as it does not say that love already exists, only the knowledge that it WILL happen later.”\r\nTo me this perfectly describes my relationship with NYC, I didn’t know then that I would fall so deeply in love with this city, but I felt it immediately <3\r\n\r\n---------------------------------------\r\n\"When we make a change, it's so easy to interpret our unsettledness as unhappiness, and our unhappiness as the result of having made the wrong decision. Our mental and emotional states fluctuate madly when we make big changes in our lives, and some days we could tight-rope across Manhattan, and other days we are too weary to clean our teeth. This is normal. This is natural. This is change.\"-- Jeanette Winterson\r\n-----------------------------------------\r\n\r\nAlso, just wanted to send a special hello out there to my Girls (Fizz, Fatimah, Lay, Elvy, Chirstie; love ya ladies), my immediate and extended family (Hey hey… Muneel/Mustufa y’all are probably the only ones that read this...), my soul-mate (somewhere out there; you can show up now), and Justin Timberlake (for obvious reasons, hehe).\r\n\r\nAnd much love to you all over the world! Be brilliant! <3\r\n\r\n\r\nMuneera Zaidi\t\r\nmtzaidi786@gmail.com\t\r\nNew York, NY\r\n\r\n", [2013, 6, 25]]