["[The Listserve] \"This old curiosity shop of a world\"", "Emily Wolfteich", "I’m Emily and I’m newly 21 and celebrated my birthday in Paris next to Canal St. Martin. Things about me—no one can pronounce my last name; my hair might be red or might be blonde but it’s definitely curly; I say y’all; I have a brother and a sister, of whom I am fiercely proud.\r\n\r\nI’m from DC, but have been working in Paris, first with an association that works with African immigrants who have HIV/AIDS. I expected to cry at that job, or to feel pleasantly selfless, but instead I realized the obvious fact that in some places, even Paris, a freckled American girl with a mostly-working knowledge of French doesn’t quite do the trick. Once a man named Jean with a velvet voice tuned for the radio held my hand and cried because he could never go home, and I couldn’t tell him in his own language that it would be okay, because I don’t speak Wolof, and because I knew it wouldn’t be.  Well, that gutted me.\r\n\r\nNow I work with the regional center for AIDS prevention and we talk to high schoolers about prevention and kindness. In some ways, this is easier – I have a rapport with them because of my age, my skin, how society sees me. But still, I’m off to the side, I watch. Perhaps I do even less here.\r\n\r\nI could tell you love stories about Venice and harrowing tales of falling off rocks in Arizona, but I guess for this email I just couldn’t decide which to tell. I want to live on a boat and I want to write beautifully or rawly, and I want to speak five languages but most of all I want to be brave and I want to make a difference, which is a hard thing to plan out.\r\n\r\nIf you want a 21 year old’s advice, it would be to read Eduardo Galeano’s Voices of Time, which is amazing; William Least Heat-Moon’s Blue Highways; and Arturo Perez-Reverte’s The Nautical Chart, which is a flawed book but still a lovely one.\r\n\r\nWhen William Least Heat-Moon interviewed Miz Alice on Tangier Island, she said “Some people sit around and wait for the world to poke them. Right here in this old curiosity shop of a world, they say, ‘Poke me, world.’  Well, you have to keep the challenges coming. Make them up if necessary.” As my mother says, “Suck the marrow out of it.” Adventure is out there.\r\n\r\nPlease write me because I’d love that. Tell me who you are, how you live, and if you have advice for someone who hasn’t yet come up with a genius plan to fix things. If you’re in Paris, on peut prendre une verre; if you’re in DC, let’s hit up the Portrait Gallery courtyard; if you’re elsewhere, see you soon?\r\n\r\nThe world is bright and black and disappointing but I swear it is never empty.\r\n\r\nI am Emily and I want to save the world and write about it, and I love meeting people, and like Hafiz, “I wish I could show you, when you are lonely or in darkness, the astonishing light of your own being.”\r\n\r\nThank you.\r\n\r\n\r\nEmily Wolfteich\t\r\nemily.wolfteich@gmail.com\t\r\nParis\r\n\r\nP.S. If quantum theory is correct, and there are parallel universes where all things that could have happened in our lives did happen, in at least one of them I’d be in that bright kitchen in Venice with Luca and we’d be making breakfast, and I would just like to say that I don’t know if it’s sad or wonderful that somewhere in space it’s possible that we never lose anyone at all.\r\n\r\n", [2013, 7, 7]]