["[The Listserve] The best day.....", "Jennifer Adkisson", "I received the notice that I won The Listserve lottery yesterday morning. I wondered what I would write about all day, but today I got my answer.\r\n\r\nFirst, I'd like to say that I am 39 years old. Really. I am not the most successful person, but I feel very lucky. My life did not turn out like I thought it would. I had bigger dreams and plans. But life got in the way.......\r\n\r\nI am what most in the U.S. consider a 'red neck'. My husband works in the oilfield. He comes home dirty. I hope that his job is limited as we move towards other energy sources. I work as an office manager of a small newspaper that is devoted to ads. It is a limited job due to the Internet. Most people assume we are small minded bigots, in a backward rural community. Those people would be wrong. I have found that deep down all people want the same things, no matter what color, nationality, religion, or upbringing. Some people are more aggressive about getting what they want. Some are happy with less. Some stumble around not knowing what they want, or how to get it. It is usually the people who don't know what they want that cause problems for the rest of us. They think if they get 'a little bit more' they will be happy, and since they can never get what they think they want; they try to take others happiness. I avoid those folks now. I look for the people who are already happy, because they want to share their joy with others.\r\n\r\nOne thing I have always wanted was a Ford Mustang. I didn't need it to be happy. I am very happy with my life now. I have a great family and all our needs and many wants are met. We face set backs and an occasional attack from hateful people, but we are doing well. I still never lost my desire for a Mustang, though. Today I found out that my husband has bought me my dream car. It will be here tomorrow. I'm glad I did not get it sooner, because I would have mistaken it for part of my happiness. It is not, it just adds a little bit to it.\r\n\r\nBTW, feel free to write me! I love \"talking\" to people no matter who they are.\r\n\r\n\r\nJennifer Adkisson \t\r\njenn_adkisson@yahoo.com\t\r\nCushing, Oklahoma, U.S.A.\r\n\r\n", [2013, 2, 13]]