["[The Listserve] Ponies and jokes", "Hailey R.", "To start, here’s a joke:\r\n\r\nA ricecake and a crab are on a beach. A person says “What a cute rice cake! What an ugly crab!” The crab says nothing. A second person says “What a cute rice cake! What an ugly crab!” The crab is upset. He swears he will throw the rice cake in the ocean if another person says that. A third person says “What a cute crab! What an ugly rice cake!” The crab throws the rice cake into the ocean.\r\n\r\n\r\n\r\nAnyway, when I was nine, I entered and won an essay contest that changed my life forever. The prize was a pony - a real, breathing, 7-month-old pony. I could write a novel about training him, learning to ride, and the ups and downs that we faced, but that wouldn’t adequately describe just how much winning this pony changed me (in many ways unrelated to horses). Instead, here are a few brief snapshots of my most memorable times with Sugar (my pony):\r\n\r\n- He had a yoga ball that he loved to play with in the arena. He would push it around with his nose and chase after it in endless circles. However, he started trying to jump on the ball so we took it away from him, fearing that it would pop in his face.\r\n\r\n- I tried to teach him to bow. After many hours and multiple bags of carrots, we reached a mutual agreement that bowing is just not his thing.\r\n\r\n- We were jumping once, and instead of landing on the other side of the fence, we landed on top of it. The pole snapped in half and I fell off, right in front of Sugar's path. Thankfully he managed to scramble to his feet in time to leap over me, though he still clipped me in the head with his hoof. I still have a piece of the jump from that day.\r\n\r\n- Sugar can be a brat sometimes. He knows that his name is Sugar, and he knows to come when I whistle. However, occasionally when I try to call him in from the field, he'll just look up at me, think for a few seconds, then turn and trot off in the opposite direction. I can just imagine him laughing at me as he trots away.\r\n\r\n- I love to ride him bareback. There's this wonderful sense of freedom in just being able to ride around without a saddle at full speed, a sense of joy that's unlike anything else. I keep Sugar at a barn near the ocean, and on particularly windy days galloping around the arena feels like flying.\r\n\r\n\r\n\r\nBecause the first joke wasn’t that great, here’s another one:\r\n\r\nA high school couple is saying goodbye on a beach. They’re going to separate colleges, but they promise to meet back in 4 years, at the same beach, at the same time. They exchange promise rings and leave. Four years pass. The girl arrives back on the beach, same place, same time, and waits for her love. He never shows up. She rips off her ring, throws it in the water, and leaves. However, a few miles down the beach is the boy. He had forgotten the correct place. The girl doesn’t show up, but he decides to wait a while. He pulls out his fishing pole and casts the line. He suddenly feels a tug at the end and, thinking it’s a fish, quickly reels it up. He spins and spins, until it finally breaks the water. He pulls it up and sees...\r\n\r\n\r\n the rice cake.\r\n\r\n\r\nHailey R.\r\nProvidence, RI\r\nPonies and jokes\r\n\r\n", [2013, 10, 1]]