["[The Listserve] My Passion: Changing The Definition of Business", "Jeff Boore", "Like everyone else, I have no idea how to begin. I always tend to be most interested in the ones that share the writer’s passion, so I am going to go ahead with mine.\r\n\r\nI just moved to Chicago a month ago to study Social Entrepreneurship. I am fascinated with the idea that a business can truly be good for everyone. From the consumer, to the business owner, to every worker and even help the environment and others not directly connected. I believe if all businesses can function like this, we can solve a lot of our problems. Think about it, if everyone wins, why aren’t we doing it? Unfortunately, there are very few businesses that function this way, and none on a large scale.\r\n\r\nThis is where we can make a difference. I moved to get my Masters while studying Social Entrepreneurship at DePaul University. While I do so, I also am working at a fairly new clothing company, Trunk Club. Trunk Club is completely changing how men’s clothing is sold. This, along with my classes, will help me to achieve this dream.\r\n\r\nTrunk Club is a great resource that helps men who hate shopping, don’t have time to shop, or just want some help dressing better. It is completely different from normal clothing stores, in that they send you a trunk customized to your wants and needs, you pick what you like, and send back the rest. You only keep what you like, and are only charged for that. It’s been great so far and I’ve already learned a lot. I can’t wait to learn more at this fast growing business.\r\n\r\nIn order to keep this job however, I need to pass my initial trial. It has proved difficult, even with my 12-14 hour workdays this first month. If every person in the United States on here buys anything from Trunk Club through me, that part is a MUST, then I will make my sales goal. If I do this, it will help me get closer to my dream of changing what we think of when we think of “business.” This is exactly where I need to work to learn more about the field. I think if we make these changes with business, we can change the world. Please email me if you would be interested in checking it out and helping at all, either you checking out a trunk or stopping by if you live in/near Chicago, even if you only buy a pair of socks, or if you know of anyone that would be interested. I really appreciate any and all help.\r\n\r\nBy the way this whole winning The Listserve Lotto today is pretty amazing. My trial at Trunk Club ends at the end of June. I was starting to get scared that I would not make it, that I was going to have to find something else, and then I received the “you won” email.\r\n\r\nWith all of this, I want to say thank you to everyone that can help, you do not understand how much I appreciate anything and everything. This does not only mean those that can help with money, I want to thank everyone who has inspired me so often through these emails.  Also, I have to thank my girlfriend for fully encouraging me to move 4 hours away to pursue my dream, I love you.\r\n\r\nBest regards,\r\n\r\n\r\nJeff Boore\r\nboorejeff@gmail.com\r\nChicago, Il.\r\n\r\n", [2013, 6, 23]]