["[The Listserve]", "Shawn Henderson", "What's your favorite place you've ever been to, and why?  My email doesn't dwell on this, but it's one thing I always try ask the people I meet from all over.  Plus I'm curious how many people respond.  (I know I've responded to an email or two, but there are several others I meant to, but never did.)\r\n\r\nI've always been told you can't have your cake and eat it too. But I don't like cake, I've always insisted on having pie on my birthday, and in the game of dessert rock paper scissors, strawberry-rhubarb pie would beat everything.\r\n\r\nI've always wanted to be multi-lingual, but the closest I've ever come to fluency is in gibberish Italian during bouts of severe inebriation.... But trust me, my friend and I knew exactly what we were saying to each other....\r\n\r\nThunderstorms are sexy, I love fall and winter. And spring and summer. The smell of wet autumn leaves and baseball infield dirt. I love the silence of snow and bikes and smiling eyes and smiling lips and every genre of music, and family, friends, and god and philosophical discussions.\r\n\r\nSunset/dusk is  my favorite time of day. Something about the beautiful yet fleeting, transitory nature of the light sets off every excitement sensor in my brain.  It makes me want to just GOGOGO and do everything, all at once, while simultaneously just sitting and watching time slowly drift off. It is the slow slow erosion of one day, but it brings with it night, and all of the possibilities that go with it. Things are coming and going and there is change in the air, and maybe things will get even better.  It's this energy that really keeps me going and striving.  In some way, a sunset is a microcosm of day to day life.  Everyday something beautiful, that will never be here and be the same again. But not too far off, there is another one brewing for tomorrow, different in it's form, but possibly even better than today. Photographing every one I can is my way of stopping time and retaining my current emotion/elation and is my key to the past me, and well and the manifestation of my desire to share this beautiful feeling with as many as possible.\r\n\r\nExuberance is the key to life.  live it up.\r\n\r\nI have no idea where I heard about the listserve, or what convinced me to join.  If any of you know me, don't hesitate to say hi. (I've lived in State College PA, DC/Arlington VA, and HdG MD)\r\n\r\n\r\nShawn Henderson\r\nis.so.1998@gmail.com\r\nHavre de Grace, MD\r\n\r\n", [2013, 7, 30]]