["[The Listserve] woo!!", "Laura", "Durante los últimos años he conocido gente de muchos tipos, de diferentes maneras de pensar o actuar. Pero de la que más me he cruzado es de ese tipo de gente  que no hace nada más allá de lo obligado, que va a la universidad, asiste a sus clases y vuelve a su casa. Es cierto que suelen salir con sus amigos y demás… pero nada que les saque de su rutina, de su camino trazado.  Y me sorprende porque de todo lo que he  vivido hasta ahora, los recuerdos más valiosos que tengo son aquellos en los que salí de lo habitual o necesario.\r\n                De hecho algunos de mis \"momentos\"  favoritos son  de cuando formamos un equipo de fútbol sala. Imaginaros la situación: un grupo de chicas de una escuela de ingeniería (en  las que las mujeres no abundan precisamente) que prácticamente nunca habían tocado un balón, jugando al fútbol sala.  Éramos malísimas. Una vez nos ganaron trece a cero (hay que decir que el otro equipo era de la facultad de deportes) y cualquiera hubiera abandonado en ese mismo instante, pero ahí seguimos nosotras pues porque nos lo pasábamos bien, nos reíamos y éramos un equipo curtido en batallas de cuarenta minutos. Y las pocas veces que conseguimos ganar, la satisfacción y alegría era grandiosa.\r\n                En definitiva lo que intento decir,  es que vale la pena salirse del camino trazado. Vale la pena intentar algo nuevo de vez en cuando, aunque pueda parecer que no vamos a ganar nada con ello o que se nos va a dar horriblemente mal. Vale la pena no ajustarse al mínimo para conseguir sobrevivir.  Vale la pena disfrutar  viviendo porque sí.\r\nY si alguién te pregunta y ¿por qué? o ¿para qué haces eso…?  Responde pues porque sí, porque me gusta. Y a vivir que hay tiempo para todo.\r\n\r\n\r\nTema aparte, me hace ilusión copiaros un trozo de un escritor que me encanta,  a ver si os gusta.\r\n\r\n                \"Tema aparte, me hace ilusión copiaros un trozo de un escritor que me encanta,  a ver si os gusta.\r\n\r\n                Los enamorados más famosos del Disco fueron, sin lugar a dudas, Mellius y Gretelina, cuyos apasionados y encendidos amoríos habrían chamuscado las páginas de la historia si, por un inexplicable capricho del destino, no hubieran nacido con doscientos años de diferencia, en continentes bien alejados el uno del otro. Sin embargo, los dioses se apiadaron de ellos y a él lo convirtieron en una tabla de planchar** y a ella, en un pequeño noray de bronce.\r\n\r\n                ** Cuando se es un dios, no es preciso aportar argumentos.”\r\n\r\n                Mort - Terry Pratchett\r\n\r\n\r\n¡Un abrazo! y que vaya todo bien.\r\n\r\npd.-  si os apetece leer un poco de ciencia ficción os recomiendo el cuento corto de Isaac Asimov  \" La última pregunta\".\r\n\r\n\r\nLaura\t\r\nlra.dlsz@gmail.com\t\r\nValencia, España\r\n\r\n", [2013, 3, 7]]