["[The Listserve] Service to Humanity", "Jessey", "I'll start off with my story and then we'll get into why it matters. I love basketball, but we'll come back to that. Went to college hoping to become a doctor, didn't quite work out. Didn't feel so great about myself for letting my parents down. Met some great people. Some not so great. Both groups were equally important to me. Met this girl, but that ended up like my med school dreams, just slowly drifted away. Missed my little brother a ton, made sure to keep checking up on him. I've always raised him like a son, and he's always seen me as a cool older brother - so it works out for both of us. Decided I'll be joining the Navy Hospital Corps in a year, I'm pretty damn excited about that. I think that sums it up pretty well.\r\n\r\nSo basketball... it's always been my sanctuary. I've been playing since age 4. I love everything about the sport. I can watch it anywhere, anytime, no matter who's playing. Right now I'm coaching a group of middle school  children(~age 12-15) and it's one of the best experiences of my life. They grew up in a tough neighborhood in New York City, so this is a good influence for them. I see myself in them sometimes, because I know they're escaping something to come play this beautiful game.\r\n\r\nIf there's anything I learned from all these different emotions it's that there is not a better feeling in the world than to make others truly happy. To me, it's selfish for me to be upset about not going to med school, or not getting the girl, because I am incredibly blessed and lucky to be where I am today. Whether it's when I'm at the nursing home playing bingo with the residents, or refereeing a Special Olympics Soccer Qualifier - putting a smile on another human's face is the best feeling in the world.\r\n\r\nSo here's what I want to do, if you're still with me up to this point. I want to go to India and start a foundation that gives the opportunity and resources to underprivileged children in order for them to become basketball players. This doesn't necessarily mean pros in the NBA, but just turning them into happy, HEALTHY athletes is enough for me. I don't care how much money they have, because I won't take a penny from them. I don't care how little they know about basketball, because that's what the coaches will be there for. I want to help them achieve their goals through basketball, even if becoming a professional basketball player isn't the final goal. Think of it as a launching pad for their dreams - of sorts. I'll be waiting for a reply from you with your advice or how you can help me out. I am a single person with a big dream and I need your help to put a smile on these kids' faces. Let's make it happen. Please.\r\n\r\n\r\nJessey\t\r\njesseylistserve@gmail.com\t\r\nQueens, NY\r\n\r\n", [2013, 7, 5]]