["[The Listserve] Lost & Not Lost", "Jenn Steele", "When I first joined The Listserve (thanks to Yoav Shapira (hi Yoav!)), I really wanted to win the lottery because, well, I wanted to whine.\r\n\r\nAlthough my goth period was about 20 years ago, I was going through a rough time and I wanted to WHINE about it. I wanted to tell all of you how I was depressed. How following my husband to Seattle and leaving a company (HubSpot) and job I absolutely adored had screwed over my life. How my poor husband felt bad for messing with my career, and how I was soooooooooooooo unhappy.\r\n\r\nThankfully, I didn’t win the lottery at that point. In fact, this has come at a funny time – I was indeed lost, but I seem to have found myself. And I found myself just last week.\r\n\r\nSee, my dream job has always been to be COO of a small to mid-sized company. I have an odd fondness for the blood and guts of a company, and a good personality for #2. This is what I thought I lost.\r\n\r\nI thought I lost my path to my dream job because I’d left my original career path (running IT at law firms) to go to consulting/marketing. And here I am, at a Big Company in Seattle, getting, well, bored with marketing.\r\n\r\nLast week, though, after soul-searching, thinking, and praying, I realized something pretty darn amazing – I’m not lost. In fact, I never was.\r\n\r\nLet’s face it: you can’t go directly from IT to operations. At least, not easily. And my MBA wasn’t filling all the gaps. What has filled the gaps, however, is this crazy sales and marketing thing. Even—no, especially—at the Big Company I work for in Seattle.\r\n\r\nThis doesn’t mean that I’m going to change jobs immediately, but it means that I’ve found my purpose again. I’m not off track, I’m not lonely, and my husband doesn’t have to feel guilty. I know that I want my next job to transition over to operations and that I want to manage people, but I can wait and find the RIGHT job.\r\n\r\nI wish that, when I was depressed, I had realized that I wasn’t off the path. I wish that I had understood that the path was just a heck of a lot more twisty than I anticipated.\r\n\r\nI’d love to hear about other twisting paths. Oh, and if you’d like to read less whiny writing of mine, you can find me by searching for \"Jenn Steele leading geeks\".\r\n\r\n\r\nJenn Steele\r\nSeattle, WA\r\njennsteele+ls@leadinggeeks.net\r\n\r\n", [2013, 5, 15]]