["[The Listserve] The Power of Nerd Camp", "Stephanie Wu", "Hi Listservers,\r\n\r\nAt my day job, I rarely need to turn copy around in less than 48 hours. I’m also a compulsive procrastinator—a high school habit I’ve never been able to shake. So this is going to be an exercise in speed writing.\r\n\r\nBut it’s worth it, because I get to share my five glorious summers at nerd camp with you. First, some background: I grew up in Taipei, where I attended the same school from kindergarten until senior year. In 7th grade, I took the SATs to qualify for a Johns Hopkins-run summer program called CTY, short for Center for Talented Youth. Some of the camp’s more high-profile alumni include Sergey Brin, Mark Zuckerberg, and Lady Gaga. Accepted students take classes in math, science, or the humanities, and essentially complete a semester’s worth of schooling within three weeks.\r\n\r\nBy the time I started CTY, I had already spent 8 years with roughly the same 200 classmates. Like many preteens, I was shy, insecure, and lacked self-confidence. Traveling across the world—from a large city to the small town of Saratoga Springs in upstate New York—to attend summer camp was revelatory. It was the first time I was surrounded by new people and could reinvent myself without any consequences for three weeks. The campus of Skidmore College was the first place that felt like home to me. It’s where I discovered the pleasures of cloud-watching, had my first kiss, learned that the only way to eat cereal is out of a cup (so much easier to drink the milk!), and truly felt comfortable in my own skin. There’s traditionally a day where everyone dresses in drag. (I had many a male friend tell me they could never look at a miniskirt the same way after wearing one for a few hours.) I studied subjects like algebra, psychology, and logic—which I've long since forgotten. What has stayed with me are the incredible friendships, the first 18 digits of pi (a cool party trick), and every single word to American Pie (the last song played at weekly dances).\r\n\r\nParents and would-be parents: This camp is magic. It’s where nerdy kids go to feel normal and discover that like-minded people come in all shapes and sizes. It’s where I embraced the fact that being smart and cool weren’t mutually exclusive. That’s the power of nerd camp.\r\n\r\nI'd love to hear from fellow CTYers. If you're in the New York area, I'm on a committee that plans alumni events, including a dance in May. And if you know me personally, shoot me an email! I'd love to know who's on here.\r\n\r\nStephanie Wu\r\nNew York City\r\nsteph.listserve@gmail.com\r\n\r\n\r\nPS – I couldn’t write to 20,000 people without mentioning my pet project. In my spare time, I run Mochi Magazine, an online publication for young Asian Americans. Check us out and pass along the word to others who may be interested in beauty tips, celebrity profiles, sisterly advice, and more.\r\n\r\nPPS – March 13 was one of the most exciting days of my life, when I found out that a Veronica Mars movie was being made and I could be a part of it. They're hoping to become the biggest Kickstarter project ever and still looking for people to donate as little as $1.\r\n\r\nPPPS – A huge shoutout to my friend Alvin, one of Listserve’s creators, for coming up with this idea.\r\n\r\n", [2013, 4, 7]]