["[The Listserve] The Elephant in the Room", "Christopher Nugent", "Recently a close friend of mine passed away at his own hand. His suicide has haunted me in the past couple weeks. Today I write to you not on the subject I would like, but rather a burden on my heart since I heard of my friend’s passing. Suicide is not a common discussion in society, nor is it a cheery subject to talk about. However, it is a discussion that needs to occur. Increasing suicide awareness and recognizing the warning signs can prevent grief and sorrow.\r\n\r\nWorldwide, suicide is one of the top three leading causes of death among people ranging in the age from 15-44. Suicide rates are climbing and are the highest rate in fifteen years. In the United States alone there were 38,364 suicide deaths in 2010. Ninety percent of those who commit suicide have a diagnosable and treatable condition.  We need to recognize that suicidal thoughts not a character defect, but are typically a sign of a mental condition.\r\n\r\nFifty to Seventy Five percent of people contemplating suicide give some sort of warning to their loved ones. Take some time to learn the warning signs in order to recognize and respond should a loved one display one or more of these behaviors. Below are some warning signs of depression and suicidal tendencies from the American Foundation for Suicide Prevention.\r\n\r\n- Talking about wanting to die or to kill oneself.\r\n- Looking for a way to kill oneself, such as searching online or buying a gun.\r\n- Talking about feeling hopeless or having no reason to live.\r\n- Talking about feeling trapped or in unbearable pain.\r\n- Talking about being a burden to others.\r\n- Increasing the use of alcohol or drugs.\r\n- Acting anxious or agitated; behaving recklessly.\r\n- Sleeping too little or too much.\r\n- Withdrawing or feeling isolated.\r\n- Showing rage or talking about seeking revenge.\r\n- Displaying extreme mood swings.\r\n\r\nIf you or anyone you know shows any of these signs please seek counsel and get professional help. Do not ignore the signs or keep suicidal thoughts in confidence with others. Often those with suicidal thoughts will believe they cannot be helped, be actively involved in helping them seek help including taking them to treatment.\r\n\r\nMy hope is that this raises awareness and could contribute to preventing this loss of life.  I pray that none of you are ever affected by suicide, but always be aware. Please do not be afraid to speak out about suicide. The greater the awareness and the more openness to discussion, the more we can help those in need.\r\n\r\nSincerely,\r\n\r\nChristopher Nugent\r\nKansas, U.S.A.\r\nListservecnugent@gmail.com\r\n\r\n", [2013, 1, 19]]