["[The Listserve] How do you mourn?", "Yasmin Fodil", "CATHEDRAL OF THE WORLD\r\n\r\nI grew up in a family of muslims, catholics and atheists from four different countries. More than anything growing up in this environment made it clear how similar we all are. All of us share universal life experiences and emotions that cross cultural boundaries - we just express ourselves differently based on our own context and culture. When you grow up with so many different kinds of people you can see these behaviors and practices for the social constructs that they are.\r\n\r\nThe \"Cathedral of the World\" metaphor from Unitarian Universalist Forrest Church exemplifies it best for me:\r\n\r\n\"(1) there is one Reality or Truth (\"God\"); (2) this Reality shines through every \"window\" in the \"cathedral\" of the world and out from every perceiving subject; (3) it is never perceived directly; (4) yet it is reflected and refracted in a myriad of meaningful patterns on the floor of the cathedral and by every perceiver; (5) thus, every window illuminates Truth in a different way, leading to different truths.\"\r\n\r\nI love the idea of one true light simply shining through different windows, making it appear different based on where you are perceiving it. This is one of my core beliefs - I think believing in the unity of all things one way of making sense of the multicultural/ethnic experience.  Most importantly, hatred, oppression, and intolerance based on religion, race, ethnicity, sexual orientation or any other \"difference\" simply do not make sense when you see the world in this way.\r\n\r\nI'm on a mission to bring this quote to life, creating a photo book that documents the various ways that different religious, spiritual and human practices reflect this light through different customs and practices.\r\n\r\nThe first practice I am looking at is the universal act of mourning after a loved one passes. I'm starting with death partly because it is universal and also because I think it's something that (at least in our western culture) we have sanitized and tend to ignore. When people are faced with death they are often woefully unprepared to manage their feelings and the experience, and I want to document the ways that different cultures and religious traditions face this part of life.\r\n\r\nHOW DO YOU MOURN?\r\n\r\nI want to invite you to participate in this project.\r\n\r\nSend me a description of how you mourn. It could be a description of your cultural tradition, or a personal experience of how you mourned after the passing of a loved one. It could be an image, a poem, a tweet, a narrative description, video, song or something else entirely.\r\n\r\nI’ll take all of the responses and use them to create a website that I'll share back with anyone who participates.\r\n\r\nIf you don’t have a story to share but would like to be notified when the project is completed, send me a note and I'll make sure to be in touch.\r\n\r\n\r\n<3 Yasmin\r\nyasmin@byoprojects.com\t\r\nNew York, NY\r\n\r\n", [2013, 7, 9]]