["[The Listserve] Fireworks: An Alternative Perspective On A Booming Business", "Peter", "“I've learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.” - Maya Angelou\r\n\r\nFireworks are truly a cross cultural, worldwide phenomenon. Pyrotechnics as we know them today date back all the way to ancient China where they were used to ward off evil spirits. Today however, they are used as a way to celebrate things and events around the world, whether it be a national holiday, religious celebration, or the beginning of a new year.\r\n\r\nBut I'm not here to dwell on the fantastic, awe inspiring beauty, and downright awesomeness that IS the modern day firework. No, rather to draw your attention to the work that goes on behind the scenes, where hardworking men and women come together to put on a spectacular show, literally risking their health and well being doing something that they love.\r\n\r\nPlanning for a show (in the U.S.A. at least) typically begins months in advance with client meetings and gathering of permits. Shows can be specifically choreographed to music if the customer so desires. Costs easily run into the tens of thousands of dollars for a show you might see in your hometown on the 4th of July; basically the more rapidly shells are being launched into the dark night sky, the more money it costs.\r\n\r\nThe day of the show, work beings bright and early with equipment being loaded onto a truck and driven to the show site (usually a big open field with little shade and no bathrooms) where it is quickly unpacked. The \"Head Pyro\" uses a set of printed plans to determine where certain sized shells will be launched from on the field. Fireworks are launched from a tube which is secured inside a wooden rack. Picture what a military mortar might looks like, except 5 to 8 attached side by side pointed vertically. Each wooden rack weighs 20 to 30 lbs (or at least they feel that heavy after a long hot day outside). Wooden cross braces are nailed to each rack to prevent them from tipping over. This process, including loading the actual fireworks into the tube takes the better part of the day.\r\n\r\nExcitement and anxiety builds as showtime nears. The whole crew makes final checks of the tubes, lining up fuses, and checking the stability of racks using only the light from a headlamp or flashlight. Two minutes before the show begins road flares attached to long metal handles, which are used to light the fuses, are ignited, their red glow illuminating both the field and the crew who are dressed head to toe in protective gear. Everyone is ready and more or less silent - eagerly anticipating the go ahead to shoot. Patriotic music builds up in the distance as the call finally comes in...\"FIRE!\" The first shells leave the tubes with a deafening report, a bright flash, and a cloud of white smoke. The show finishes 15 minutes later with special 'smiley face' shaped fireworks as the crowd in the stadium goes absolutely wild. For me that's what it's all about - complete strangers cheering for the show and our hard work.\r\n\r\nTrucks are repacked and everyone departs the show site anywhere from 11pm to 3am depending on size and cleanup. It's been a long day, but completely worth every minute.\r\n\r\nI welcome all feedback, questions, and comments. Nice or mean I'll read them and respond.\r\n\r\n\r\nPeter\t\r\npeterlistserve@gmail.com\t\r\nSomewhere Out West, U.S.A.\r\n\r\nP.S. If anyone has connections to a company that hires Biomedical Engineers I'd especially love to hear from you, being a student and all.\r\n\r\n", [2013, 7, 3]]