["[The Listserve] Music from the Ice", "Cheryl E. Leonard", "During the austral summer of 2008-2009 I spent five weeks at Palmer Research Station on the Antarctic Peninsula via a grant from the National Science Foundation’s Antarctic Artists and Writers Program. I was there to gather materials for a series of musical compositions inspired by Antarctic environments and ecosystems. Each day I set out from the station to explore my surroundings, make audio field recordings, and collect natural objects to use as musical instruments. If the weather was fair, and winds were below twenty knots, I hopped in a zodiac and motored out to neighboring islands or worked directly on the sea. In stormy conditions I investigated the glacier and rocky moraine behind the station.\r\nI often visited Torgersen Island, home to a number of Adélie penguin colonies. I was delighted to discover that the penguins had chosen a very musical island on which to nest, as Torgersen is covered in shards of a dense, sonorous, igneous rock. The Adélies gather the smallest of these stones to build their nests, but even the larger pieces were surprisingly resonant. As the penguins ambled along well-worn paths between colonies and beaches, the stone fragments clinked under their feet creating delicate melodies.\r\nThe southern elephant seals were another one of my favorite subjects. I first heard them in a cove on Amsler Island. As we turned off the outboard motor and slowly drifted across the water, deep alien bellows emerged from the far end of the cove, echoing off the thirty-foot-tall walls of ice on either side of us. There, in the water, a couple of dark shapes tumbled and splashed. Several more massive creatures lay side-by-side on the shore. I quickly pulled out my pocket recorder, but after a few short minutes the seals’ outlandish calls ended abruptly. I returned numerous times hoping to find the “e-seals” howling in the cove’s sheltered waters, but instead I always found them piled up on the shore, fast asleep.\r\nFinally I decided to camp out on the island for a night. I waited for a window of fair weather and then, one balmy evening, was dropped off on Amsler a few hours before sunset. Shortly after my ride departed, I heard it: the faint bawls and bellows, splashes and sputters, of e-seals cavorting in the water. There were over a dozen, sparring in pairs in the shallow cove. I don't know why it hadn't occurred to me before that the elephant seals might be nocturnal. Suddenly it was very clear why they snoozed all day! In the long Antarctic dusk their playful martial dances and eerie roars were mesmerizing. I listened and recorded until, in the wee hours of the night, I could no longer feel my toes.\r\nNear the end of my stay I descended inside two crevasses on the glacier behind the station. From the surface the crevasses didn’t look like much, just ominous cracks in the snow, but inside lay ornate azure caverns adorned with thousands of icicles. Because it was summer and temperatures were above freezing, hanging on a rope inside a crevasse was a lot like taking a shower. First, I recorded just the multitude of water drops, and then I began to play some nearby icicles, cautiously tapping them with superball mallets. Lovely clear pitches emerged. Unfortunately, often the icicles fractured just as I started to get nice resonant tones from them. However, as they fell, shattering in the icy depths beneath me, they produced a spectacular mad-xylophonist cacophony, bouncing and echoing for a surprisingly long time.\r\n\r\n\r\nHappy listening,\r\n\r\nCheryl E. Leonard\r\nantarcticice333@gmail.com\r\nSan Francisco\r\n\r\n", [2013, 12, 4]]