["[The Listserve] Joy and/or Burritos", "Dax Foley", "I told an eighth grader I’d won the Listserve lottery.  Her advice was: “They’re strangers.  It doesn’t matter what they think.” I thought that was a good point for about an hour before I realized she was wrong.\r\n\r\nThere’s a difference between your opinion mattering and me letting it change how I express myself, in any way.\r\n\r\nThoughts have intrinsic value.  They are untarnished by Likes or Retweets. They float through the miasma of the universe, or wherever thoughts go.\r\n\r\nIt DOES matter what you think, even if it doesn't (necessarily) matter to ME.\r\n\r\nNot only does it matter, it’s the MOST IMPORTANT THING.\r\n\r\nVishnu Schist matters to the boatman at the bottom of the Grand Canyon.  He thinks the rock is God’s flesh, practically.\r\n\r\nPoles matter to the blind skier.  He thinks: “I’m already blind and skiing; for Christ’s sake, help me out with some poles!”\r\n\r\nPickled or fresh?  The type of jalapeño I prefer on my Prawn Deluxe burrito matters to the burrito-rolling man.\r\n\r\nIt all matters.\r\n\r\nWE all do.\r\n__\r\n\r\nMy biggest fear is not reaching my full potential.  Not mining every morsel of me.  If my dreams are too small I’ll limit myself.  Fear, false hope, and expectations will creep in and block my path to self-actualization.  But if my dreams are planet-sized, orbiting through an infinitude of lost thoughts, at least I’ll get to find out.  A goldfish grows to fit its bowl.  Pardon me--to fit its tank.\r\n\r\nMy thoughts guide me on a tour of the Quantum field, a New-Age-Neverland, Shangri-La, McDonald’s-When-You’re-Seven-Years-Old kind of field.  I’ll stay here, I think I will, cultivating excellence, spreading joy, and caring about the thoughts of strangers.  Not to steer my ship for me, but to be the stars that move around me.\r\n__\r\n\r\nIt’s 4 AM and I love being alive.  I love the earth and all of its inhabitants.  I fall asleep laughing and wake up smiling.  Life is so perfect I could drink it with two straws.  Love is so amazing I could take a hot bath in it.  And my fingers would never get wrinkly.  If you don’t feel how I feel, JUST START, and then you will.  This is some raw, unadulterated, 100% organic BLISS I am experiencing right now (I’m sober, I promise), and I flat out refuse to let it fade.  Ever.  I’ll stay here, I swear I will, being intensely, intrepidly UNREASONABLE in defense of FUN and JOY, mine and yours.  The dreams, thoughts, and prayers of strangers across the globe form constellations in the sky.  At least one of them looks like a prawn.\r\n\r\nPlease visit me at:\r\n\r\n* FOLEY SPEAKS [DOT] [COM] *\r\n\r\nI have a lot of writing on there—travel stories, essays, humor, commentary, etc.  And some other stuff.  Enjoy!\r\n\r\nShare your thoughts with me:\r\nInstagram: @daxfoley\r\nTwitter: @foleyspeaks\r\n\r\nMy name is David Axelrod, but you can call me Dax.\r\n\r\n\r\nDax Foley\t\r\nhisfoliness@gmail.com\t\r\nSeattle, WA, USA\r\n\r\n", [2013, 6, 14]]