["[The Listserve] The family that \"lists\" together...", "Susan", "It started innocently enough, this family list-making fetish. My husband, two children, and I were having a family conversation after dinner, and someone mentioned that it had been a while since anyone had spent the night with us. Something in me sparked an idea: how many people had indeed slept in our brick rancher over the years? The kiddos began rattling names of their friends while I got pen and paper and began recording. “Justin, Mark, Josh...” our son offered. Our daughter chimed in with “Amy, Ashley, Christine...”. My husband began reciting the names of relatives who have made the trek to visit us here in Alabama. Soon the list grew to over thirty people, which surprised us all. Then our son recalled that we hosted two young men from a visiting church choir one night; add two to the list! Didn't we shuffle beds around to accommodate our neighbor's parents when they paid a surprise visit? Add two more! And so it went, and when we felt we had exhausted all memory cells, nearly sixty names were scrawled on a piece of paper. We sat in the glow of that list, eating ice cream, remembering our visitors with warmth, and we did not know that the “after-dinner-making-a-list” tradition had begun.\r\n\r\nIn the coming years, we made lists short and long: states visited, movies that began with the letter “B”, dogs we had petted, restaurants at which we'd eaten, and types of Oreo's. Names of candy bars, state parks, car manufacturers, brands of toothpaste, and pro football teams. Perhaps we'd be planning a trip to an amusement park, and my son would express his desire to ride the newest coaster called the “Goliath” or some such thing. “What are the names of the coasters we've already ridden?” I'd ask, and, after the initial collective groan from hubby and the kids, we were off and running as names came from all directions: “Blue Streak!” “The Joker!” “Millennium Force!” and the list would grow to accommodate dozens of coaster names. Sometimes the compiling of the list was a sad action, as the death of a friend sparked a listing of “Who have we known and loved and lost?” and we became quiet as names were recorded and the list grew longer than we would have wanted.\r\n\r\nYears went by and we continued with our lists, although as the children grew and spread their wings, the lists became more functional rather than for fun. Lists were made for what to bring to college, for people to contact as possible references, for repairs to be done around the house, for ways to earn income. And when our daughter married, the list of wedding-things-to-be-done achieved an epic level not seen before nor since.\r\n\r\nThe children are off on their own now, but we visit each other when we can. We recently spent four days together over a long weekend, and I felt the “urge” as we talked about board games that we enjoyed and micro-brews we might try. But as we played “Loaded Questions” and drank a flight of summer ales, I was too happy basking in the moment to write anything down. I looked around the room and observed my dear husband, our fun-loving son and his sweet girlfriend, our beautiful daughter and her smart husband, wonderful in-laws, smoked sausages, a bottle of bourbon, a sleeping dog, the sound of rain on the roof, a cozy blanket...wait a moment...could someone please hand me that paper and pencil?\r\n\r\n\r\nSusan\t\r\nsusanandbobj@gmail.com\t\r\nAlabama, USA\r\n\r\n", [2013, 7, 24]]