["[The Listserve] A leap of faith", "Amanda Lynne Ballard", "Preface:\r\n1. I feel like this is a TED talk for email.\r\n2. I think this is one of the scariest things I've ever done.\r\n3. I don't like public speaking.\r\n4. I don't think I'm a very good writer.\r\n5. I'm not apologizing.\r\n\r\nThe Journey:\r\nI took a jump, a leap of faith into the unknown.\r\nA month away from my 30th birthday I am on a plane flying thousands of miles away from all that I know.\r\nI have two suitcases, my phone and a laptop.\r\nThis is only supposed to be for 5 months.\r\n\r\nFor the first time in my life I had no keys.\r\nI had no place to let myself into.\r\nIt was the most unexplainable feeling of freedom.\r\n\r\nI am a sassy, queer urbanite transplanted into the glorious, interior mountains of British Columbia.\r\nFrom a city population of 5.5 million to 90 thousand, including cowboys.\r\nI'm in a town where people my age and younger leave to go to where I just came from.\r\nI live in a place where people my parents age come to retire.\r\n\r\nI know no one.\r\nIt takes me a month to realize that's ok.\r\nI'm still reminding myself that it is.\r\n\r\nIt takes me one month to make a friend.\r\nI forgot how hard it is to make friends as an adult.\r\nI am reminded of the things it takes to be a good friend.\r\nI practice daily.\r\nThere are many days where I am lonely.\r\n\r\nI start challenging the idea of familiarity.\r\nI start challenging the idea of personal space.\r\nA fully furnished 2-story urban apartment to a half-furnished room in a shared house.\r\nI start challenging the idea of ownership.\r\nThe idea of things. My things.\r\nI've learned that they really are just things. Promise.\r\n\r\nIt took me 30 years to realize what matters most.\r\nAnd, yes I assume it will change.\r\nFor both of the above, I consider myself lucky.\r\n\r\nI suppose this was part of a trend in doing things that scare me.\r\nLast year I went on a hot air balloon ride in Turkey.\r\nI still fear falling.\r\nI got a tattoo.\r\nIt's not a very good tattoo.\r\nNext week, for my actual birthday I am going to go shoot a gun.\r\nAnd because it's my birthday, I'm wearing heels.\r\n\r\nThis is not a fear of getting older.\r\nThis is not an escape mechanism.\r\nThis is not to make up for an otherwise ordinary life.\r\nI am not ordinary.\r\nPromise.\r\n\r\nEveryone asks, 'why did you do it'?\r\nAs though taking such a big risk is a bad thing.\r\n\r\nI took a jump, a leap of faith into the unknown.\r\n\r\nI needed to be scared.\r\nI needed a change – something, anything.\r\nIt ended up being everything.\r\nIt is not easy - I don't know why I ever expected it to be anything less.\r\nI listened to my heart, she told me to jump.\r\nAnd for once, I didn't listen to my head as so rarely do I ever let them talk together.\r\n(They almost never agree.)\r\n\r\nA month away from a milestone birthday, I closed my eyes and dreamed I could be somewhere different.\r\nI ended up here.\r\nI changed everything I knew.\r\nThis is not the first time I've done it.\r\nThere's a chance it won't be the last.\r\n\r\nI can never go back to where I was.\r\n\r\nConclusion:\r\nA friend once told me, “You will always regret not doing something, rarely will you regret trying.”\r\nWhat have you done lately that scares you? What are you scared to try?\r\n\r\n@a_mandolin\r\nalb@amandolin.ca\r\n\r\nAmanda Lynne Ballard\r\nalb@amandolin.ca\r\nKamloops, British Columbia\r\n\r\n\r\n", [2013, 3, 31]]