["[The Listserve] An Awkward Life", "Connor A.", "I’m still not sure what the title of my (auto)biography is going to be, but the subtitle will most certainly be An Awkward Life. Perhaps I’m starring on a reality TV show and don’t know it yet, but I find myself in a fair number of truly awkward and comical situations. I’m not sure if it’s my penchant for saying the first thing that comes to mind or just some karmatic effect from a previous life, but regardless, I’ve got a lot of good fodder for my future stand-up comedy routine.\r\n\r\nMy most recent I’m-pretty-sure-the-Universe-is-laughing-at-me moment happened last month when I was en route to what was most certainly going to be a break-up conversation. I was getting out of my car to meet my then boyfriend when I heard the distinct sound of fabric tearing. I looked down to see a hole in the crotch of my pants. The timing couldn’t have been worse, but it did give me a few minutes to laugh at myself before a truly unpleasant conversations. These things happen to me more often than I can count, but I have come to enjoy and embrace the comedic relief it brings to otherwise dull or unpleasant situations.. When I came out to my mom over dinner, she thought I was playing a practical joke for a while. Trying to prove that it wasn’t a joke proved pretty uncomfortable.\r\n\r\nI could fill the rest of this e-mail with some of my favorite stories, but I’ll try and keep it brief. I’d love to hear from you guys on a host of things. I’m a total and complete news junkie who is obsessed with politics and public policy. So, a few things I’d like to hear from you about:\r\n\r\n1) My favorite book at the moment is Nudge by Cass Sunstein. The book basically discusses choice architecture and how we can build a smarter planet to make up for the fact that we humans often make decisions that aren’t in our best long-term interests (think saving for retirement, eating healthy foods, climate change, etc.) If you’ve read Nudge or have an interest or experience in designing better systems of any kind, I’d love to hear about your work.\r\n\r\n2) What are your awkward and comical stories?\r\n\r\n3) I’m interested in how people work, particularly GTD and organizational strategies. Feel free to share some good advice/tips in this arena. I’ll also accept any life advice you’d like to give in general.\r\n\r\n4) I work in fundraising/development, focused primarily in politics and the non-profit world. If you work in these fields, I’d love to connect.\r\n\r\n5) Finally, if you know any single and awesome gay guys in the DC-area, I love awkward first dates. They make for the best stories.\r\n\r\n\r\nThanks for reading, y’all!\r\n\r\n-Connor\r\nigotpickedforthelistserv+e@gmail.com\r\nWashington, D.C.\r\n\r\n", [2013, 11, 11]]