["[The Listserve] A TL,DR; five questions; and smileys", "Ellie T.", "I’m going to split this up into two sections: the first, a “TL,DR” for those who don’t have much time; and the second, a longer, more expanded version of the first.\r\n\r\nIf you’ve only got a couple minutes to spare, here are some questions I want to ask you:\r\n\r\n1.      What sort of advice would you give a young adult?\r\n\r\n2.      What is your favourite book? (Movie, TV show, etc.)\r\n\r\n3.      Where is the best place you’ve lived or visited? Most interesting adventure?\r\n\r\n4.      What is a something I should learn how to do?\r\n\r\n5.      If you haven’t got anything to say to the above, then tell me a story about yourself! Anything at all, don’t be shy!\r\n\r\n\r\nHopefully, that was short and sweet enough! I hope you’ll consider giving me a reply J\r\n\r\nNow if you’ve got a bit more time on your hands, allow me to expand on the above questions.\r\n\r\n1.      Nice to meet you! I am from Vancouver but am currently in Toronto as a second-year university student studying engineering, which means that yes, I am a young adult and yes, I am unabashedly looking for tips on life! I’ve no doubt that there are a wide variety of people reading this, and I wager a fair amount of you all will have lived and experienced more than me. So if you have any sort of advice at all, I’d love to hear it!\r\n\r\n\r\n\r\n2.      I love reading. Love, love, LOVE it! One of my favourite book series’ is Harry Potter, which you might have heard of … it really inspired my love of books. I’m always on the hunt for new ones to read, so if you have a recommendation, please send it my way! Now, I understand that not everyone shares my joy, so if you have a particular movie, TV show, or even song you really enjoy, I’m definitely willing to expand my horizons.\r\n\r\n\r\n\r\n3.      One of my wishes in life is to travel. Unfortunately, with my limited student budget, it’s a bit difficult at the moment, but I would love to hear your adventures. Having only visited a paltry number of countries so far (four … including Canada, where I was born), I would love to hear about some of your experiences, even if it just happened around the corner!\r\n\r\n\r\n\r\n4.      I am always on the lookout to try new things, so I ask you this: has a random skill ever proved useful? Or even something I should learn to do every day that will somehow improve my life? I’d like to know!\r\n\r\n\r\n\r\n5.      Stories. I like telling them, but I love hearing them more. Share with me any experience that you deem worthy – it may have been years ago, or it may have just happened yesterday! Whatever it is, I’m sure I’ll really enjoy reading about it.\r\n\r\n\r\nThat’s it! Thanks for taking the time out of your day from reading an email from someone you don’t even know – it means a lot to me! If this has caught your attention somehow, I’d love to get a response, and I promise that I’ll write back, really!\r\n\r\nWith that, enjoy the rest of your day (or night, as it may be)! J\r\n\r\n\r\nCheers,\r\n\r\nEllie T.\r\nellielistserve@gmail.com\r\nToronto, Canada\r\n\r\n", [2013, 11, 30]]