["[The Listserve] An inconvenience rightly considered", "Matt", "The thing is…I have actually put off writing for a long time.  Much too long in fact.    There has always been some reason to not write.  Some more legitimate than others.  But the desire to put pen to paper has always been there.  And as time and life have progressed, the need to just sit down and dump the weight of my world onto a blank page has become overwhelmingly cathartic.\r\n\r\n I have long felt the need to start some kind of an online journal or blog, not just to share my life but also share in the lives of others.  In the end, I think I just needed something to force me out of my shell, push me over the edge and put myself out there on the interwebs.\r\n\r\n I can’t think of a better opportunity to do so than The Listserve project, and I am grateful for the chance to read about your lives and share a bit about mine.\r\n\r\nIt feels like I have lived more than my share of life in 33 years.  Far more than I can boil down into a 600 word email.  I have traveled the world, married the love of my life, and started a beautiful little family.  I helped start and ultimately ran a nonprofit working with AIDS Orphans in Southern Africa, worked in politics in Washington, and currently have a successful career as a commercial real estate executive.\r\n\r\nI have also been broke, anxious, depressed, and have seen a good bit of tragedy.  I abruptly lost a number of close loved ones, most recently including my wife’s 28 year old brother and my infant son.  I also almost lost my wife, who continues to have health problems that now prevent us from having additional children and may eventually reduce her longevity.\r\n\r\nThe details of these stories will have to wait for another day.  But the thing that I really want to share is the impact that they have had on my life.\r\n\r\nG.K. Chesterton once wrote that “An adventure is only an inconvenience rightly considered.  An inconvenience is an adventure wrongly considered.”  Certainly, a number of these events in my life are far greater in significance than an minor inconvenience, but I think that despite their scale, Chesterton’s words have remained true throughout the highs and lows of my personal journey.\r\n\r\nFor me, enduring the valleys in life and enjoying the peaks, are possible through only the pursuit of proper perspective.  The key has been to focus on the balance between the two and to realize that in most things, the journey really is the destination.  Life is a grand adventure that we travel together, and we would be right to consider it that way.\r\n\r\nI believe that there is value in our individual stories and the relationships they create.  We can glean truth from exploring the journey of others.\r\n\r\nTo that end, I would like to make a request:\r\n\r\nI would love to hear more about you and your travels/passions/losses/failures, etc.\r\n\r\nOn my end, I will commit to begin publishing my story and the lessons I have learned on a new blog.  In exchange, I want to encourage you to put yourself out there and tell your story.  Even if you don’t feel comfortable connecting directly with me or other members of The Listserve, please post it somewhere on the web or somewhere in your corner of the world.  Whether you realize it or not, your experiences and stories can benefit others and bring the perspective and balance that we all desperately need.\r\n\r\nThanks for reading,\r\n\r\nMatt\r\nmatt@rightlyconsidered.com\r\nPennsylvania\r\n\r\n", [2013, 8, 14]]