["[The Listserve] a Dutch girl living in Sweden", "Britt", "Hi there,\r\n\r\nFirst of all; thanks for all those wonderful e-mails I received from you who already won the Listserve-lottery!\r\n\r\nAnd now, this is my story.\r\n\r\nMy name is Britt. When I was fourteen, my parents told me they wanted to emigrate, together with me, my little brother and sister.\r\nA year later, we moved from Holland to Sweden.\r\nIt was such a big step, but after a few years living in this wonderful country, we have learned the language, have contact with a lot of lovely Swedes, feel happy in our house and are going to school and have jobs.\r\n\r\nMy mum, my dad, my brother, sister and me, we did change. In a positive way, I would say. We are more comfortable with unknown situations and like to get to know new people. I am absolutely sure that if we never had left Holland, I still would be that shy girl who I was before.\r\n\r\nSo, with this story, what I want to say to you is JUST DO IT. And yes, that's the slogan of a big sportbrand, but also a very good quote to keep in mind when you want to change your life. Or just little things in life (you have to start somewhere...).\r\nIt is better to regret something you did (and have the experience of doing it) than regretting something you never did. You only get one chance!\r\n\r\nThe last thing I want to share with you are some very good artists, who need some more attention and appreciation. Listen and enjoy!\r\n\r\nTriggerfinger (rock from Belgium)\r\nAnouk (best singer from Holland and she participated in the Eurovision Song Contest for Holland. according to me, her best album is Urban Solitude)\r\nBeth Hart (she is the best and needs more fans!)\r\nHugh Laurie (dr. House and yes, he can sing)\r\n\r\nPlease share your story with me. At what points did you think JUST DO IT? And are you happy you did?\r\nPlease visit my blog by typing \"brittalicious\" on a search engine.\r\n\r\nThanks so much for reading! / Tack för att du läste detta! / Bedankt voor het lezen!\r\n\r\n\r\nAll the best,\r\nBritt.\r\nbrittlistserve@hotmail.com\r\nsomewhere between Holland and Sweden\r\n\r\n", [2013, 7, 14]]