["[The Listserve] Class of 2017", "Anna", "As of March 23 2013, 3:19 PM EST, the Listserve has 21402 subscribers. With that number, it should take approximately fifty nine years for the lottery to get through everybody.\r\n\r\n…\r\n\r\nWhy couldn’t I have been chosen in, say, twenty years? Hopefully, by then I will have been to places and done things really worth sharing. As a high school senior, the most excitement I had this week was piling into a car with a bunch of friends screaming YOLO (ironically….kinda) as we left school mid-day for a Red Mango run.\r\n\r\nThe notification that I had won the Listserve Lottery came shortly after I’d been rejected by a college. By no means was it my dream school, but it still stung a little, and made me a little less confident about the slew of decision letters I will be getting this week.\r\n\r\nAs someone who was raised being told that Harvard, Yale, and Princeton are the only universities in the world, I completely sympathize with all the other seniors out there experiencing admissions jitters. However, my (extremely limited) life experience has led me to believe that all this fuss about rankings and prestige is ridiculous. So is all the drama. College is more about the work you put in once you're actually there than where you're going.\r\nSo, all of you in the same boat as I am, I would advise going out and properly enjoying second semester senior life this spring break. Don’t sit by your computer periodically hitting refresh. For those of you with a couple of or more years to go, really follow your interests. It doesn't matter if that passion doesn't seem like it'll impress the admissions officer gods. Though second semester has not been as relaxing as any of my classmates anticipated, a lot of my friends are taking the post-application opportunity to do things they've always wanted to do, from reading more books to starting hip hop classes. But it makes me wonder, why did all these things have to wait until now? Why did we let school and the possibility of college take over so much of our lives?\r\n\r\nEither way, I wish everyone waiting on admissions the best of luck. The cliche that you will wind up going where you belong is only partially true. The other half comes from how much you will make of the experience. I hope all of this is not too preachy because lord knows I need to heed this advice more than anyone else haha.\r\n\r\nI’m sorry that this email was so demographic-specific. If any of the rest of you have read along this far, this summer I will be travelling to Mumbai, New Delhi, Guangzhou, Hong Kong, and Seoul. Anyone who lives in/has been to those cities, please let me know about places I should definitely see! Preferably sites off the beaten track. To the experienced travelers (I want to be you), please send me any practical tips about traveling smartly in general.\r\n\r\n-  Anna\r\n\r\nP.S. If you haven’t already, make sure to read The Elegance of the Hedgehog by Muriel Barbery. It’s a truly truly special book that will stay with you for a long time.\r\n\r\n\r\nAnna\r\nkimannna@gmail.com\r\nNew York, USA\r\n\r\n", [2013, 3, 30]]