["[The Listserve] Human Nature", "John", "I teach.  My fellow teachers would probably describe me as calm, patient, positive, and disorganized. I genuinely love my job and I enjoy working with students and helping them learn, grow, and succeed. I have a knack for connecting with some of the toughest students to connect with and I pride myself on not judging my students and repeating the mantra of one of my professors from college—hate the problem, love the student. I am always willing to give my time and effort to help a student, fellow staff member, or friend.\r\n\r\nI also, fundamentally, feel that humans are naturally selfish. We are incredibly self-interested. I don’t believe true altruism exists.\r\n\r\nI do believe, however, that selfishness and wickedness are not linked. Rather, I believe that all humans can be taught to be, as I like to call it, selfishly selfless.\r\n\r\nI love my job because it makes me feel valued. I enjoy seeing my students succeed. It brings me pleasure to lead a life of meaning. I am unbelievably selfish. I do what I do because it makes me feel good.\r\n\r\nRather than choosing to fulfill my own selfish desires by personal success and a cutthroat attitude, I choose to find that happiness by helping others. I actively make this choice every morning when I wake up. I’m not perfect—I’m human—I slip up. I have days where I do things I regret. I also wasn’t always like this—I actively made a choice to be this way.\r\n\r\nHow we treat others, how we move through life—that is a choice. We cannot change our nature but we can change how we engage with it.\r\n\r\nI urge you to choose to be selfishly selfless. Choose to be kind to everyone you meet, in the hopes that they will do the same. Choose to advance yourself by making the world a better place for those around you. Choose to create a world that would best suit you by exemplifying what you wish others would be.\r\n\r\nYou may find yourself happier. You may also find yourself getting more of the things you want.\r\n\r\nHave a fantastic day,\r\n\r\n\r\nJohn\r\njohnlistserve1@gmail.com\r\nWilliamsburg, Virginia\r\n\r\n", [2013, 7, 1]]