["[The Listserve] the beach, Longhorns, and my Abuela", "Demaré", "My boyfriend says that to know me, you have to understand 3 things: I love the beach, I live for Texas Football, and above everything else, I love my Abuela.  She is my favorite person in the world.\r\n\r\nFor those of you who don’t know, Abuela is Spanish for grandmother and mine is top notch.  When I was five and my favorite movie was Mary Poppins, Abuela promised me to take me to feed the birds at St. Paul’s Cathedral.  She did so much more – she took me to Spain, England and France on an almost month long and amazing trip. You couldn't feed the birds anymore at St. Paul's Cathedral, but that didn't slow us down.\r\n\r\nWhen I was thirteen, she retired and moved to Austin, where I grew up. I think she knew how much my little brother and I would need her – my parents separated 8 months later and her house, just 2 miles from mine, became a much needed oasis. At 18, I decided to defer college and join AmeriCorps, a decision that wasn’t well received by my parents, but she supported me.  When I was 23 and wanted to move across the country to be with the man I adore, she said “go and be happy.”\r\n\r\nShe taught me that even though people might not treat you well, you should still treat them with kindness and dignity.\r\n\r\nShe taught me patience through knitting and that you can always fix a mistake without taking out the last 10 rows.\r\n\r\nShe taught me how to shuffle a deck of cards and that you don't come to the card table without money.\r\n\r\nShe taught me that Thanksgiving was the best holiday because, it’s not about things, it’s about people and being gracious for what you have. I will always cherish our pre-Thanksgiving Chinese food dinners and how she would turn the AC on in November so my homemade hot chocolate would warm me while we watched the Thanksgiving Day parade.\r\n\r\nShe taught me that good friends were more important than many friends. She always insisted that it was going to be those good friends that get you through the toughest times. She's right. I went home a few weeks ago, after Abuela was diagnosed with Stage 4 Lung Cancer.  She's fighting against some ridiculous odds, but at 84, she's winning.  It's wonderful.  She has the most amazing group of friends helping her and I have a great group supporting me.\r\n\r\nI want to move home to spend time with her, take her to doctor’s appointment, and to be sure someone is there when she needs a hand. I'm excited about this opportunity -- I get to care for my favorite person, but I'm also scared.  I would be leaving my boyfriend of seven years and well-paying job for something unknown.  Any advice?\r\n\r\n\r\nThanks for listening,\r\n\r\nDemaré\r\ndemareatx@gmail.com\r\nmy heart’s in Austin, but I’m in MA\r\n\r\n", [2013, 9, 17]]