["[The Listserve] Running with it?", "Beth", "Hello Listserve!\r\n\r\nI'm just going to let this roll… I'll share a little and I'd love to learn a bit more about you all.\r\n\r\nA bit about me - I have a background in physiology and I love business, people, traveling, photography, medical/science meets business, and relationships/communication. I'm also in the home stretch of an amazing counselling psych program (Clearmind) and I sell my art (They're abstract photos that look more like paintings. You can check them out on flickr \"bethhallphotos\"). Want to trade a piece of art? Can you recommend any great-to-work-for medical device companies?\r\n\r\nMy top 5 values:\r\nConnection/love\r\nFun/Playfulness\r\nAuthenticity\r\nGrowth\r\nCreativity\r\n\r\nAnd I'd love to hear from you...\r\nDo you love salt water taffy? What do you love about it? Where's the best salt water taffy you've ever had? Do you know where I can get a taffy pulling machine so I can make yards of it for people?\r\n\r\nWhat's the most beautiful place you've ever been to? Obvious or obscure.\r\nMost amazing waterfalls?\r\n\r\nWhat's the most meaningful thing you've ever given or received?\r\n\r\nWhat are some of your favourite/beautiful/inspiring movies?\r\n\r\nWhat's your favourite go-to vegetarian or vegan recipe?\r\nAnd the best vegan cake recipe you've come across? (I want to start exploring the vegan world of desserts!)\r\n\r\nWhere's the most romantic place you've ever been?\r\nMost beautiful love story? (Yours or someone you know)\r\n\r\nWhat makes your heart sing?\r\n\r\nRandom ask:\r\nDo you have two shabby chic, contemporary, or reclaimed wood bedside tables you're giving away within 100kms of Vancouver or Seattle? Or a cool, small coffee table (1.5 ft by 3ft -ish) or blocks of wood that would do the trick?\r\n\r\nFinal thought:\r\nWhen sailing to Bora Bora, we don't get there in straight line. The same goes for life. Let yourself get off course and when you notice you're off, tack back.\r\n\r\nLove to you all!\r\n\r\n\r\nBeth\r\nbethh.listserve@gmail.com\r\nVancouver, BC\r\n\r\n", [2013, 3, 29]]