["[The Listserve] Connections and Collaborations", "Brandon", "It’s really easy for me to fall into a way of thinking that keeps me moving in the same direction.  I don’t like how my life feels when I let that happen for too long, so I give myself projects.  This coupled with some mild obsessive compulsive tendencies causes me to fixate on the end goal until I’ve thoroughly exhausted the point of the project.  Sometimes this leaves me very satisfied with what I’ve done/made/experienced and other times I find myself oddly ashamed or empty.\r\n\r\nI don’t expect anyone to necessarily understand any of that, but I know how I feel when I’m in this kind of state and thought it could be helpful if others who might feel that way too knew they weren’t alone.\r\n\r\nI’m working really hard on being vulnerable, too.  It’s a scary concept when you’ve spent your entire life believing (for good reason) that the best way to live is in a constant state of emotional vigilance.  I’m finding, though, that I’m not happy.  So I have made the decision to deliberately open myself up to all of the possibilities that vulnerability offers, both the good and the bad.  I try to remind myself that as painful as circumstances may get, they won’t kill me… and I’ll make my way through the worst.  Also, that it won’t be all bad… that I’m motivated by the good possibilities that I know exist.  It’s a foreign concept to me and difficult to execute throughout my life, but I’m committed to making that discomfort my new normal.\r\n\r\nSpeaking of projects, I have a couple of app ideas for smartphones that I really believe the world would benefit from but I’m not currently a developer.  I’m in the process of learning, but I don’t have the confidence in myself necessary to make these things the way I imagine them.  So, if you’re a developer and are open to partnering with me on one or two ideas, reach out to me and we can discuss how to make that happen.\r\n\r\nI enjoy discussing meaningful topics:  politics, religion, ways to do life better….  I also enjoy a lot of different media, from music to books and shows.  So if you’d like to talk about any of these things and you find that it’s difficult or awkward to find a place to discuss these topics without encountering negative people or experiences, feel free to reach out to me.\r\n\r\nI have no advice for anyone, but I’m happy to collaborate with any of you to make life better for us all.\r\n\r\nBe and Stay Well.\r\n\r\n\r\nBrandon\t\r\nListserve.brandon@gmail.com\t\r\nNew Windsor, MD\r\n\r\n", [2013, 7, 25]]