["[The Listserve] Aucka Paulie", "Jason Bliss", "My Uncle Paul was always a goofball. Growing up he was the one who would horse around with my cousins and me. He loved to go fishing, watch AHL from the front row of the arena while yelling as loud as he could at the opposing players and referees, and coaching his kids sports teams. Growing up my father would always take me to visit him and his son who was a couple years younger than me on the weekends, I knew exactly how long it took to get from our house to his by the time I was about 5.\r\n\r\nThe four of us were the group of guys who started the family tradition of traveling to the Connecticut Lakes every June for a week of fishing, hiking, canoeing and camping without any electricity or running water, about 20 miles from any sort of civilization in our family. He was always the guy who wanted to use the biggest minnow from the trap in the hopes of catching the biggest lake trout.\r\n\r\nMe and Chris (my cousin) would run around the Springfield Civic Center watching the Falcons play amateur hockey while our fathers watched the game. Paul would buy the cheap seats and just go down to some empty seats on the glass as soon as the game started. From minute one until the end he would bang his mini hockey stick on the railing and heckle anyone who dared skate by. At first I was worried about getting thrown out of the arena just for being around him, then I began to think the ushers and security might have thought he was handicapped by the way he acted and the mullet he proudly sported.\r\n\r\nIf I were to put a 1-10 number on Pauls ambition in life I would set him at a 4. He didn't appear to aspire to be any greater than he was and as a janitor in a elementary school no one would consider him professionally successful. My dad told me when they were in high school Paul excelled at metal fabrication, one of the better fabricators he has met and that was as a teenager. Unfortunately the lubricant used in commercial fabrication changed, Paul was allergic to some part of it and his career ended. Maybe that is when his professional ambition ended and his just took what he could get. How many elementary school janitors do you know that have about 20 years in the school system by the time they are in their 40s?\r\n\r\nAs I grew up Paul kind of became my go to if I had some free time and was in his area, as well as being my first to call if I wanted to go on some little fishing excursion. I really loved being a young adult and driving him around, being able to make plans with him to do... whatever there was to do. When I spent the summer before I went into the military doing landscaping work I invited him along every day since he was out of school, when he declined I would just go buy him lunch from the classic diner down the road from his house. After that summer I left for the military and my closeness with everyone back home kind of started to dissipate. Don't get me wrong, I lost none of my love for him and the rest of my family but I spent the 95% of my time over 1000 miles away. I would visit once or twice a year, spread my time across all the friends and family I left behind.\r\n\r\nIn 2008 I had left the military but stayed in the south far from home. I was working in a restaurant when my dad called me repeatedly in the middle of dinner rush, so I stepped outside to talk with him, knowing it was some sort of emergency. I knew he was a mess as soon as he picked up, he was on a business trip but something bad happened at home, he didn't have all the answers but had to tell me what he knew until he could get home on the next flight out of there. Paul had jumped off a bridge into the river, not just any bridge but the South Hadley bridge, probably 100 feet off the water. The real problem was the Dam. Not far down river, maybe 1/4 mile, was Holyoke dam, a massive dam that poured over violently, so violent that when I was young we would go below it and my dad would use it as an example of how dangerous water could be. Paul went over the dam. Someone had spotted his body a ways down river, broken in so many places I don't even want to remember, but alive. It didn't take long to realize it was a suicide attempt, one that should have been successful. He was held in the hospital for the required time but released to go home under the supervision of family. Everyone around crowded around him for support and comfort, and we all wanted to know why he would do something like that, his daughter was in high school, his son had just graduated, his life seemed to be about where he had wanted it for the last couple decades. I finally was able to talk with him the day after he was released, he sounded in pain and very medicated, I asked why he would do that and if there was anything I could do for him, I would do anything in the world for him so he could ask anything of me. He said he was confused and tired, rambled about car trouble for a little while then I had to let him go because it became incoherent. Before we hung up I made him promise me that if he ever thought of something like that again he needed to call me, he was my family and one of my best friends. Shortly after that there was a small unsupervised window while one person had to go to work and the next was coming over. He did it again, only this time it worked.\r\n\r\nOn August 19, 2008 Paul D. Bliss killed himself. He left behind 2 children, 1 wife, a mother and father, 5 brothers and sisters, bunches nephews and nieces, friends, coworkers and people who he never even met but would have been better for being a part of his life.\r\n\r\nI don't tell you this so you go out and tell the people you care about that you love them, I just wanted to talk about Paul. It still hurts to talk about Paul with my family, its hard, so I will tell a bunch of strangers.\r\n\r\nThanks.\r\n\r\n\r\nJason Bliss\t\r\nJbliss27@hotmail.com\t\r\nLittle Rock AR\r\n\r\n", [2013, 7, 31]]