["[The Listserve] A Whole Lot of Somethings, or Nothings", "Jenna", "What I want to get most out of my ListServe opportunity is the chance to connect, so feel free to contact me with whatever’s on your mind (maybe read the rest of this before you do, though...).\r\n\r\nI wanted to write something unique and intriguing, of course, but I’m rarely that creative. Probably tomorrow I’ll think of something fascinating I should have written. There’s a writing ‘experiment’ further in. My introduction is at the end because it is typical and boring.\r\n\r\nTry sunflower butter with honey on rye toast.\r\n\r\nI intended the bulk of this e-mail to be about Tolkien and YouTube (as two separate topics, though now I wonder if there are any good Tolkien-focused YouTube channels?), but I really don’t know what to say about Tolkien other than I am utterly fascinated and enamoured with his creation of Middle-Earth and all that relates to it (I’m going to Oxford at the end of August as a kind of pilgrimage). I have a bit more to say about YouTube.\r\n\r\nI’m always fascinated when people don’t understand YouTube in the same way I do – thinking it’s just for how to guides, silly clips or music videos. I wonder how many of you understand YouTube in this way? I hope you’d be impressed by amount of original quality content created for YouTube by ordinary people, and the communities that grow around that content. I would love for more people to experience this world. Hard to describe with words, just check out some YouTubers instead – for ‘beginners’ I recommend kickthepj and charlieissocoollike. For something a little different, check out hexachordal. (Yes, they’re all popular British male YouTubers but off the top of my head I think they’re a good start). There’s a fantastic series running now called Becoming YouTube; I’m not sure how interesting it would be for someone who’s not already engaged with YouTube but you could check it out.\r\n\r\nOn a related note, shout out to Alan Lastufka, who doesn’t know me, but I’ve been a fan since fiveawesomeguys and he was how I found out about the Listserve.\r\n\r\nYou’ll get no sage life advice or wisdom garnered through travelling from me, but here are some lyrics to keep in mind (“Show Starts Now” by Cloud Cult; Craig’s words help keep things in perspective):\r\n\r\nHold your breath for a better day and you’ll never learn to breathe\r\nYou’re afraid of the dark but that’s where you learn to see\r\nYou’re no good to the living if you’re too afraid to bleed\r\nThat’s why your show starts now\r\n\r\nMessage me (be patient for a reply) if the following is relevant to you, or if you want to know more:\r\n\r\n·         Tolkien fan\r\n\r\n·         Summer in the City\r\n\r\n·         WWOOF\r\n\r\n·         Writing as a personal activity\r\n\r\n·         Music (particularly Depeche Mode/Cloud Cult/AFP/Tom Milsom/Orphaned Land)\r\n\r\n·         Books (particularly Helen Oyeyemi/Cornelia Funke/Haruki Murakami/Catherynne M. Valente)\r\n\r\nSince I wanted to include some type of interactive writing experiment, send me a piece of your writing and I’ll reinterpret/expand and send it back. Ask and I’ll send you a piece of mine.\r\n\r\nI’m yet another Listserve participant who can’t believe they were chosen, can’t belive the timing, and isn’t at all prepared. I left my home on the Canadian prairies to WWOOF in Ireland on June 9, the most extreme experience in my life so far.  I find myself placed me in a position where, for the first time in my life, I have no easy internet access and very little time to spend on the computer. I am writing this in the three hours before it is due.\r\n\r\n\r\nJenna\t\r\ncr2jg@mymts.net \t\r\nNear Bantry, County Cork, Ireland (home in Manitoba, Canada)\r\n\r\n", [2013, 7, 6]]