["[The Listserve] The Clean Fiend", "Kieran", "Everyone has advice to give, mine is this: Do what makes your life happy, even if its just 5 minutes a day.\r\n\r\nAnd to support that cause, I want to pass along a story that my wife has written. 600 words isn’t much, so here is half a story - email me back and I will send along the rest of it! She is working on a book and has other stories already published.\r\n\r\n\r\n\r\nThe Clean Fiend\r\n\r\n\r\n“Go on, Ted, just try a bite. It’s not going to kill you. I mean, come on, you’re already dead!”\r\n\r\n“No, no, I just can’t. It’s so…unhygienic. We don’t even know where that has been. Just think of all the slimy, unsanitary cesspools in this city. Besides, you’re touching it and I know for a fact that you haven’t washed your hands in over a month.”\r\n\r\n“My hands are mostly bone and tendon at this point. What’s to wash?”\r\n\r\n“See, thinking like that just aids in the spread of unsavory diseases. Here, I have an antibacterial spray…”\r\n\r\n“No.”\r\n\r\n“But-”\r\n\r\n“No, Ted. Just…no.”\r\n\r\n“Honestly, I don’t know why you’re so resistant to the idea of basic hygiene. I can only imagine the number of creepy bacterium living inside of you right now. It’s just, ugh, it’s just too vile to contemplate.”\r\n\r\n“Don’t point that at me!”\r\n\r\n “Just let me spritz you on this bit of entrail at least. It can’t be healthy for it to just drag along the ground like that. Or, actually, wait, I think I have some plastic wrap that’ll-”\r\n\r\n“Ted! Stop it. Jesus! First off, that’s horribly invasive. Leave my intestines alone. Secondly, it’s the style, you know. Everyone’s doing it. It helps trip up the fleshies and, you know, it looks cool. Eva digs it. At least, I think she does. She lost her jaw the other week so it’s hard for her to talk now.”\r\n\r\n“Really? Eva? The waitress from Bodie’s Buffet on 3rd?”\r\n\r\n“The one and only, man. The one and only.”\r\n\r\n“I thought you weren’t her type? Because I distinctly remember you asking her out when we went there on New Years before all of this started and she said-”\r\n\r\n“I know what she said, Ted! But she’s gotten to know me now. We’ve been seeing each other pretty steadily over at Bodie’s. He’s still serving up the buffet. Well, the menu has changed a bit, but you know… Stop looking at me like that, man! She’s totally into me. I can tell.”\r\n\r\n“Yes, and I’m sure this has nothing to do with the fact that personal standards might lessen with advanced decomposition.”\r\n\r\n“That kind of tone is totally unnecessary, dude. I’m just trying to… Okay, look, this isn’t about me! This is about your completely neurotic refusal to eat and all of this weirdo germ phobia crap. I mean, what self-respecting zombie carries around a fanny pack of sanitized baby wipes? I mean, seriously!”\r\n\r\n“Look here, I have a legitimate concern. If more people were conscientious about the spread of bacteria none of this would have happened in the first place. And by ‘people’, I mean you! I still remember waking up to you chewing on my leg. That was definitely a violation of trust!”\r\n\r\n“Aw, come on, Ted. How many times do I have to apologize for that?”\r\n\r\n“How many…How many times do you have to apologize for turning me into the rotting undead? Do you seriously have to ask that?”\r\n\r\n~*~\r\n\r\nAuthor: A. Lockhart\r\n\r\nEmail me if you want the rest and to learn about what she publishes next!\r\n\r\nKieran\r\nRaleigh, NC\r\nlockhartbooklist@gmail.com\r\n\r\n", [2013, 4, 8]]