["[The Listserve]  That jerk Simon", "Eric Bogs", "“U Make Me Want To Drink Bleach” by Easyworld reminds me of that jerk Simon I dated in London in 2002.  My friends all told me he was an asshat, but boy did I fall for his posh accent and effort hair.  When he introduced me to his favorite band-of-the-moment, Easyworld, I immediately adopted it as my favorite band-of-the moment.\r\n\r\nA week later, we’re stood outside a venue where they’re playing, and I’m begging passersby for tickets to the sold-out show.  Romantic, right?  After listening to my sob story, their manager comped us a pair of tickets.  Inside the venue, rather than “thanks, Eric!” Simon just looked up and told me, “I’ll take a Jack and Coke”.  I dumped him before the encore.\r\n\r\n--\r\n\r\nI was an exchange student to Brandenburg, Germany in 1993.  Arriving at the train station, I was picked up by a somewhat radical punk-rock-looking loving-our-newfound-Western-freedoms host family with whom I couldn’t yet communicate with due to language barriers.  15yo me (fresh from Indiana) was absolutely terrified.\r\n\r\nWe drove home in silence, until “Master & Servant”—and if you know me, you know how much I love Depeche Mode—came on the East German radio station.  Everyone started singing along: father, mother, sister, brother—I couldn’t believe it.  Ice broken.\r\n\r\n--\r\n\r\nDepeche Mode’s “Photographic” was playing two months later when I stepped into my first discotheque with Lars, my “supercool” host brother who I was secretly in love with.\r\n\r\nInside the disco, throbbing synthpop washed over my body. There were smoke machines and strobe lights and everyone was wearing black denim jean jackets and smoking and drinking beer.  I wanted to stay there forever.  I spent most of my 20s “there”.\r\n\r\n--\r\n\r\nI lived a lonely existence during the dot-com days in San Francisco.  I’ll never forget sitting at home one night after a long day of working too hard on some bullshit website, lights off, windows open, fog rolling into and out of my apartment, with Pet Shop Boys’ “Nightlife” album booming, thinking “why am I wasting my time doing something I hate?”  Years later, seeing their musical “Closer to Heaven” brought me to tears—each number resonating with me in such silly ways.\r\n\r\nWhen I left the software world for a few years to try my hand at journalism, I was lucky enough to interview Neil and Chris.  After the interview backstage at the BBC, they tried to set me up the spot with another journalist.  While there wasn't a spark, we're great friends to this day, and have shared a hundred musical adventures since.\r\n\r\n--\r\n\r\nLast year, I dressed up as a sequined, quaffed Vanilla Ice for Halloween, and danced around the streets of post-Sandy Manhattan.  22 years earlier, \"Ice Ice Baby\" was the first CD single I owned.  My costume was recognized just once, by a handsome lad dressed as a “Book of Mormon” Mormon.  You should see the bizarre (yet adorable!) photo of the two of us.  My costume is safely retired, at least until our wedding reception.\r\n\r\n--\r\n\r\nPlease share some of your musical moments with me!  Pretend that we've just met at a party and we're standing in the kitchen shooting the shit.  Drop me an email or Tweet me @ericbogs.\r\n\r\n\r\nEric Bogs\r\neric@bo.gs\r\nBrookyn, NY\r\n\r\nP.S. I’ve spent the last 6 months working on a new social music iPhone app called Stereotypes, centered around sharing these musical moments with friends.  I’d love for you to try it out when it launches next week—just follow @stereotypesfm.\r\n\r\n", [2013, 2, 16]]