["[The Listserve] don't give up on someone who's bipolar", "Nando Casinelli", "I wasn’t as excited as I thought I would be when I received the email from the Listserve that I had won the lottery to send out a story to thousands of people. I thought about it. I took an hour lunch break away from my cube, made a phone call and took a quick car ride around the block before I realized this was a chance to become another spokesperson in a drowned-out pool of mentally ill awareness advocates. But there can never be enough champions for the mentally ill.\r\n\r\nI, myself, am bipolar. I was diagnosed two years ago after living with the illness since I was 19 years old. It was only when I walked onto a beige tile floor in a pair of hospital socks to a room full of doctors that I was told the diagnosis. I had a bipolar episode and was admitted to a mental unit in the city public hospital. I always knew something was wrong, and although no one wants to hear they’re bipolar, it was a relief to hear an answer to all the pain I had been dealing with.\r\n\r\nAfter I was released from the hospital, I didn’t know how I would pick up the pieces to my life again. This being my fifth or sixth episode, I already knew how hard it would be. I moved out of the house I bought, into my parents’ home. My ex-girlfriend, who I put through years of hell, was gone - her and the dog. How could I blame her, someone who had to deal with someone like me - someone with bipolar - every day to not leave me after all those years of craziness? Alienating the ones you love is always those most painful part of being bipolar. The aftermath is worse.\r\n\r\nSo what exactly is bipolar? It’s different for everyone, but from my experience and what I’ve been told, it’s a mental illness that causes periods of emotional up’s and down’s, manic states – euphoric highs and an out of control state-of-mind - depressive states, uncontrollable actions, and a ton of other ill-fated effects. Coincidentally, those with bipolar have a hard time keeping jobs and relationships, among many other things. Sounds like it could ruin anyone’s life, doesn’t it?\r\n\r\nBut you learn how to manage the best you can as you go along with the right help and love. You’ll constantly have to apologize and clean up all the messes you make when you’re bipolar. I’ve done it many times since diagnosis. I’ve even lost another person that I dearly love. You’ll feel comfortable enough to decide it’s okay to stop taking your medication and/or see your doctors when you’re bipolar. I’ve also done this. Again. And you’ll go to hell and back and back again when you’re bipolar.\r\n\r\nThis is my chance to bring awareness to the mental illness that is bipolar. To bring it to light, so those that don’t know about the struggles of someone with bipolar will understand them with compassion, patience, and most importantly love. It takes a sincerely loving person to become a bipolar’s person loving martyr and partner. And they exist. I would know.\r\n\r\nThank you, and I’m sorry.\r\n\r\n\r\nNando Casinelli\t\r\nnando.casinelli@gmail.com\t\r\nConnecticut\r\n\r\n", [2013, 7, 19]]