["[The Listserve] F*@& Cancer", "Matt Himmelstein", "As I write this email, there is a battle waging in Texas that has far reaching implications.  The State Board of Education is deciding how to deal with evolution in their science text books.  Why do you care, especially if you don't live in Texas?  Well, Texas is a big market for text books.  A text book that can't be sold in Texas is not going to make money, so publishers write books that comply with Texas' guidelines, and then sell those textbooks nationwide.\r\n\r\nWhat are they trying to decide?  If evolution should be challenged in text books.  I am all for rigorous scientific study.  I am an engineer and I graduated from one of the top science institutes in the US.  I am all for teaching students critical thought, we do not do enough of that.  But Texas is trying to hold up creationism (or intelligent design) as a viable alternative to evolution.  In the context of a science class, this is laughable.  If you want to discuss intelligent design, it should be discussed up as an easily disproved and non-scientific argument against evolution.  Teach that element of critical thought.  Using concepts like irreducible complexity or pouncing on slight anomalies in the fossil record is not enough to throw out evolution; a \"theory,\" that can and has been tested rigorously, and can be used to make accurate and correct predictions about the natural world.\r\n\r\nBelieve what you want to believe as a matter of faith.  But don't pretend that that faith belongs in a science class.  I am not anti religion, though I am an atheist (and a Pastafarian [look it up]).  I believe that religion was instrumental in allowing larger societies to form, to evolve if you will, and helped to make us the dominant species.  Religion has inspired art and literature, and has inspired thinkers as far back as there was religion.  It has even been a friend and patron of the sciences throughout history, and it can still be that friend.  Religion should be taught in history and philosophy classes.  It belongs there, not in a science curriculum.\r\n\r\nIf you live in Texas, please let the Board of Education know that you do not support the dismantling of science standards in order to shoehorn in the beliefs and superstitions of a nomadic people written 1,000s of year ago.  If you do not live in Texas, and this does enter into the text books, fight against the adoption in your state of any book that gives equal footing to intelligent design.\r\n\r\nAs for who I am, I am a 46 year old male who has lived his entire life in Southern California.  I ski, mountain and road bike, rock climb and play ping pong and golf (poorly).  I read (not as much as I should) and have pretty much stopped watching TV, mainly because I don't have time for it anymore.  I am married with a daughter in high school, I am a California-registered Professional Engineer, and I work as an environmental consultant, remediating industrial sites.  I am also two year removed from a battle with head and neck cancer due to HPV that I never knew I contracted.  Thankfully, this cancer responds well to treatment, but treatment for head and neck cancer sucks on a level that is hard to describe.  So I urge all of you to vaccinate yourself and your kids against this disease.\r\n\r\nIf you have interest in contacting me about what I have written here, or about any other issue, please email me at MSHListserve@gmail.com\r\n\r\n\r\nMatt H.\r\nmattsh@sbcglobal.net\r\nSouthern California (Orange County)\r\n\r\n", [2013, 10, 9]]