["[The Listserve] WTF I actually won?!", "Ashley", "They say that timing is everything. The thing about this is that 9 times out of 10 we can’t control when things happen in life. Those few times that things happen at that perfect moment, life feels amazing; however for every time something doesn't happen at the perfect moment there is usually some other emotion evoked. Winning the Listserve lottery this week initially didn't strike me as perfect timing. I never thought I would get picked so had absolutely no idea what I would write about and haven’t recently experienced anything momentous or exciting to share with everyone.\r\n\r\nSo the first thought that comes to mind is why the hell is this happening now? After sitting on this for a night the conclusion I came to is that you don’t need to experience something momentous or exciting to make life feel meaningful.\r\n\r\nI ran in the San Diego Rock n Roll half marathon this weekend. While I knew a few people doing the race I decided to actually run this one on my own. The whole theory that adrenaline gives you an extra 3-4 miles on the day of the race is definitely no joke. I run a few times a week and never feel the high that I felt after crossing the starting line. After about 3 miles into it I started to realize how amazing this whole thing was. With the thousands of people running this and the hundreds cheering along the sidelines the entire 13 miles it hit me that this wasn't just something to say I've done. If you know me you know this isn't an exaggeration but this definitely gave me major goosebumps. Running isn't for everyone but even if you decide to walk the whole way I recommend participating in one of these in your lifetime. They have them all over the world now and it’s definitely an amazing feeling to be part of something like this.\r\n\r\nBecause of the lack of having something else inspirational, thought evoking, or just plain interesting to share with you guys I figure I would give you a list of the little things in life that make me happy. Hopefully some of these interest people and they can add them to their list of little things J\r\n\r\n-         Las Vegas – because it’s the adult Disneyworld\r\n\r\n-          Naps – that moment after you wake up from a really really good one\r\n\r\n-          Laughing until it hurts or you pee your pants – pretty sure everyone has this on their list already\r\n\r\n-          Getting dressed up for something fancy – maybe it’s because I’m a girl but you forget how much fun this can be\r\n\r\n-          Dancing – even if you think you can’t do it, do it\r\n\r\n-          Sneezing – never stop someone from sneezing; it’s a fact that it’s a 1/8th of an orgasm\r\n\r\n-          Seeing a really good movie – it can make you laugh, cry, or just think about life… either way you can’t deny it’s a good feeling\r\n\r\n-          A good cry – even though at the time it’s usually because of something sad the way you feel after is indescribable\r\n\r\n-          Making a new friend – you never know what it could turn into but the excitement of that is half the fun\r\n\r\nThere’s a ton more that I could list but I’m running out of space so I will have to end it on that one. I always love to make new friends so feel free to shoot me an email and let me know what little things you have on your list!\r\n\r\n\r\nAshley \t\r\nbabywhale05@gmail.com\t\r\nLos Angeles, CA\r\n\r\n", [2013, 6, 9]]