{
    "2012-09-25": [
        "[The Listserve] Against Drift", 
        "Kat Lau", 
        "I was raised in a very Catholic household, but lately a bit of my once-strong Catholic identity has been peeling away. I haven't been to church since May, I'm questioning my thoughts on a lot of the Church's social doctrines, and I don't pray nearly as often as I used to.\r\n\r\nI got some bad news from home recently about a friend, and only several days later did I even think to pray. Realizing that I had forgotten that astounded me, because in other times that would have been my first instinct. Trying to pray, however, felt no better. I felt weird asking for God's help--like a friend who hasn't called you back in months but suddenly needs a place to crash. I ended up calling my mom and asking her to pray, because I feel like my prayers have by now lost whatever potency they may have ever held.\r\n\r\nIf I'm going to be a lapsed Catholic, I want it to be a product of reading and honest questioning, investigating the philosophical arguments for Catholicism, really narrowing down what I agree with. Basically, I want to have done the legwork—not just have gotten lazy, which is pretty much what happened with going to church. Religion's a tricky thing. I know a lot of people struggle with this, and I'd love to hear about experiences from all sides of the argument. If you have any thoughts, stories, book recommendations, or anything else to share, I'd love to hear from you (or if you'd like me to share whatever recommendations I receive!). Thanks so much for reading.\r\n\r\n\r\nKat Lau\r\nkat.a.lau@gmail.com\r\nNew Haven, CT\r\n\r\nP.S. If you're ever folding many sheets of paper (to make programs, for example), fold several at once, then separate them, stack them on top of each other, and press down on all of the folded edges together at once to make the initial crease sharp. Though it saves time, many people avoid trying to fold many sheets at once because the folds on the outer edge are never as crisp as you'd like them. But this technique gives you the best of both worlds: speed and sharpness.\r\n\r\n", 
        [
            2012, 
            9, 
            25
        ]
    ], 
    "2012-09-26": [
        "[The Listserve] Artificial Life in Tokyo", 
        "Nathaniel Virgo", 
        "You've caught me at an interesting time. I'm about to pack my bags to start a new job in Tokyo. I've never been to Japan before.\r\n\r\nAt some point in the distant past, there was no life on this planet. Now there is not just life but hugely diverse ecosystems and complex human societies. Some scientists believe that what happened in between was a series of highly unlikely coincidences, one of which resulted in the formation of the first cells. But I prefer a hypothesis that everything we see around us is just sort of what happens when the conditions are right. That when there is a source of energy and the right chemical nutrients, the progression from non-life to life, from simple to complex, is a gradual but almost inevitable one. That the deep interrelationship between life and its planetary environment (sometimes called Gaia theory) is as old if not older than life itself; that life did not cause Gaia so much as arise from it.\r\n\r\nIn Tokyo my job will be to work out some of the details of how complex, life-like phenomena can arise from non-living physical systems. The aim is not to create life but to understand something about it by studying things that are similar but simpler. For me, understanding nature on a deep and mathematical level is a way to unlock and appreciate its beauty. I am very lucky to have a job that allows me to follow this passion.\r\n\r\n\r\nNathaniel Virgo\t\r\nnathaniel.virgo+listserve@gmail.com\t\r\nEngland\r\n\r\n", 
        [
            2012, 
            9, 
            26
        ]
    ], 
    "2012-09-27": [
        "[The Listserve]  Choosing", 
        "Marie Cooper", 
        "This month marks the seventh anniversary of finding out I had multiple sclerosis.  I was stunned.  Irrationally, I was certain that I had already been through enough hard stuff, so I shouldn't have to deal with any more.  I lost an eye in a childhood accident.  I was widowed at the age of 39 and raised four children by myself.  But I worked my way to a lucrative career and we thrived.  Nothing kept me down.  Now, surely, this was my time of reward for surviving all those struggles.\r\n\r\nWell, as we all know, life does not work like that.  There is no cosmic balance sheet of adversity vs. good fortune.  It was just my time to face another bad thing.  But I didn't want to, damn it!\r\n\r\nThe disease progressed and I started a downward spiral.  My high powered career and life began to crumble.  Loss mounted upon loss.  And I was consumed by bitterness and anger.\r\n\r\nDevastated by my deterioration, I became virtually homebound.  Everything I loved was slipping away.\r\n\r\nFull of resentment, I was tired of picking myself up.  But so many sources were sending me the same message: pray.  And if you can't pray, just say \"Give me strength\" over and over.  To not make the effort seemed like a slap in the face to all the people who love me and give me credit for being braver than I really am.  I knew I had to choose to pick myself up once again.\r\n\r\n\r\nMarie Cooper\r\nnourishblog@optonline.net\t\r\nJersey Shore, United States\r\n\r\n", 
        [
            2012, 
            9, 
            27
        ]
    ], 
    "2012-9-10": [
        "[The Listserve] A tip to boost (or awake) your superpowers", 
        "Alexander Demenshin", 
        "Sometimes, we cannot recall things which we want to recall, and we cannot see a full picture due to missing details.\r\n\r\nWe are afraid to make a decision since we don't know the outcome, and all this leads to mistakes that we prefer to avoid.\r\n\r\nIt would be great if our memory was like a hard drive, so we could store and recall anything any time, and if we could correlate all events from the past and see all connections.\r\n\r\nThis way, we could make no mistakes and precisely forecast the future.\r\n\r\nBut... our memory is not a hard drive, thus, it cannot work that way.\r\n\r\nHowever, there is something that we can do to improve this:\r\n\r\n- When you are preparing to sleep, lying in the bed, try to recall all events of the past day, exactly in the order as they happened, with all details. - If you are finished and still awake - try previous day, and so on. - Next morning, after waking up, briefly recall previous day.\r\n\r\nIn the end, you will feel the boost. Your memory will improve, you will begin to see the future, you will intuitively avoid mistakes.\r\n\r\nBut please, be patient - it could take days, weeks or even months, this is very individual, so don't panic if nothing happens quickly - eventually, it will - or money back :)\r\n\r\nJust be persistent.\r\n\r\n\r\nAlexander Demenshin\t \r\nal.dem@nk7.net\t\r\nDuesseldorf, Germany\r\n\r\n", 
        [
            2012, 
            9, 
            10
        ]
    ], 
    "2012-9-11": [
        "[The Listserve] ¡Hola!", 
        "Jonathan Youngblood", 
        "In two weeks, I'm getting on a plane with my best friend Haley and we're going to southern Spain (Seville, specifically). We have a few places in particular we're planning to visit (Granada, Cadiz, Ronda, Lisbon), but we've got seven whole weeks to see and do, well, pretty much whatever.\r\n\r\nSo I was wondering what you guys thought. Have you been to any places in western Europe that you'd adamantly recommend? Cities, beaches, specific bars or shops, fishing villages...whatever, really. What do you think is cool?\r\n\r\nAlso, if you live in a cool place in western Europe and maybe want to meet up for coffee or cervezas or something, you should email me. Let's have a time!\r\n\r\n\r\n- Jonathan Youngblood \r\nhi@jonathanyoungblood.com \r\noklahoma city, ok (us)\r\n\r\nPS: You should also know that I am the owner of over twenty turtles, including one internet-famous Sulcata tortoise (his name is Kevin...Google it).\r\n\r\n", 
        [
            2012, 
            9, 
            11
        ]
    ], 
    "2012-9-12": [
        "[The Listserve] Make a damn phone call", 
        "Benson", 
        "Call home; whether it’s the physical building you grew up in or where you went to school, just call home. Call your fraternity brothers or sorority sisters. Call your childhood best friend. Call your mother, father, and siblings. I am still fairly young but as I’ve aged, I’ve realized how easy it is to let relationships fade and to forget your roots. All of my successes and achievements are the results of many people over the years. I am the product of countless acquaintances and deep friendships. Every person I have met has had some effect on the knowledge I hold, my outlook on life, and the steps I have taken to end up where I am. Whether the encounters were positive or negative, I have to thank them all because I am pretty happy with the way things turned out.\r\n\r\nSo take the time to reflect on where you are and how you got here. Think about the people that have mattered to you throughout this journey; then reach back. Maybe the phone call will not be as satisfying as you anticipated but who knows? That call might in fact be just what the other person needed to uplift them from a rough week. Saying hello is easy and goes a long way.\r\n\r\nJust do it, right now, go ahead.\r\n\r\n\r\nBenson\r\nStanford, CA\r\n\r\n", 
        [
            2012, 
            9, 
            12
        ]
    ], 
    "2012-9-13": [
        "[The Listserve] Changing my name", 
        "James Madera", 
        "When we were planning our wedding, Kristen and I talked about names. I started from the assumption that she would be taking mine; she started from the assumption that we would make that decision together.\r\n\r\nSo I told her that I had always believed my wife would take my name, that it seemed natural. That I would feel awkward otherwise. She talked about giving up that part of her identity and I pretended like I understood. I waxed on about starting a new family and how we would want to have the same name.\r\n\r\nHere is the thing, though. On a really fundamental level the person that wants to have a conversation is always correct. She knew I was being an asshole (are cusses okay on this list? I waffled on the terminology but I was a real dick about the name thing) but instead of getting angry she kept talking to me, and I got it through my head that just because something is socially common doesn't mean it's not a burden.\r\n\r\nWe picked a new name, for our new family, and that's how we became the Maderas.\r\n\r\n\r\nJames Madera \r\njamesm.madera@gmail.com \r\nHarrisburg PA\r\n\r\nps i'm not telling you how to live your life but if you're going to do this get his name changed before the wedding so it's free to change hers after, otherwise changing names is hundreds of dollars\r\n\r\npps i'm seriously not defending my behavior through that process, I'm still a little ashamed of my baseline assumption, but I figured it's worth acknowledging because I guarantee a lot of decent people have struggled with that, feel free to email me with whatever thoughts you have on the subject!\r\n\r\n", 
        [
            2012, 
            9, 
            13
        ]
    ], 
    "2012-9-14": [
        "[The Listserve] The Grand Experiment", 
        "Zach Napolitano", 
        "I’d like to use this grandest of forums to attempt this grandest of experiments: to launch the new company I’ve been incubating for the past several weeks.\r\n\r\nPresenting... The Listserve Launch:\r\n\r\nWithout patronizing the Listserve user and explaining the crucial role social media plays in a company’s survival, I will just mention that there are thousands of businesses shelling out exorbitant fees for the right to have a behemoth of a consulting firm manage their Twitter and Facebook communities.\r\n\r\nBottom line: I’ve created a lean company, built around a small team of savants whose greatest acumen rests in nurturing vibrant online communities. We’ve worked for national brands and hot VC-backed startups. And since our overhead is basically nonexistent, our full-service social media platform is available for a pittance of what one of the bloated agencies would charge.\r\n\r\nIf you know someone who could use our services, help us at Silicon Alley Social gain a little positive momentum and pass our name along. We’ll be sure to reward anyone who helps us propel this social media pirate ship.\r\n\r\nThanks for being a part of our Listserve Launch!\r\n\r\n\r\nZach Napolitano\r\nzach@siliconalleysocial.com\r\nNYC\r\n\r\n", 
        [
            2012, 
            9, 
            14
        ]
    ], 
    "2012-9-15": [
        "[The Listserve] Nanni", 
        "Talia Klein", 
        "My grandmother is my best friend. I call her Nanni. Most people aren’t as lucky as I am to have such a special person in their life, but I am and she is kind, wise, beautiful, intelligent, perfect. I am not telling her that I’m writing this about her because she is so selfless that she would probably talk me into writing about something else, like Obama or art or women’s health or exercising one’s right to vote – all important things that she would want to share with 22,000 listeners. Nanni is a renaissance woman. She can do anything, but I’m going to tell you some things that Nanni has taught me, and I live my life by these principles:\r\n\r\nBe passionate.\r\nDon’t let anyone’s opinion stand in the way of doing what you want.\r\nIf you care about something, fight for it.\r\nIf you love someone, tell them.\r\nIf you want to do something, the world is yours and you can do it.\r\nCommit to something and follow through.\r\nYou daresn’t let anyone hold you back.\r\nEmbrace struggle and do what you can with the resources you’ve got.\r\nLife is short.\r\nAlways try clothes on - they never look the same on your body as they do on the hanger.\r\nBeing unhappy is a choice, accepting failure and defeat isn't.\r\nAsk questions, read a lot, travel, stay organized and informed.\r\nIf you don’t think you can, try harder.\r\n\r\nGrandparents are really special people. Don’t forget to call yours and tell them you love ‘em.\r\n\r\n\r\nTalia Klein\r\ntaliak91@gmail.com\r\nNew York, NY\r\n\r\n", 
        [
            2012, 
            9, 
            15
        ]
    ], 
    "2012-9-16": [
        "[The Listserve] Stand up for science!", 
        "Brendan O'Brien", 
        "It is interesting to me how science is largely misused, misquoted, and misunderstood by the vast majority of people around the world. We haven’t even come that far in our scientific understanding of the world, yet it seems to me that we are in danger of slipping back toward the times when scientists were feared and derided for their ideas, and churches and warlords made the decisions for us all.\r\n\r\nI see it now all around: anti-vaccination movements, and anti-fluoridation movements, for example. Conspiracy theories and junk-science are beginning to over power public and private discussion. Even the very notion of intellectualism is no longer a desirable trait.\r\n\r\nI’m thinking of Neil deGrasse Tyson, the astrophysicist, who at one point said at that he isn’t worried so much about today’s children. Instead, it is the adults we need to worry about; the adults whom are afraid of the number 13, read horoscopes, and insist schools stop using Wi-Fi connections.\r\n\r\nI have three requests for everyone:\r\n\r\n    Don’t believe everything you hear or read, but be willing to trust the evidence of experts.\r\n    Be willing to stand up against unfounded and unreasonable claims made by pundits, crack-pots, and the delusional.\r\n    Enjoy and embrace the idea that we, as humans, don’t have all the answers, yet.\r\n\r\n\r\nBrendan O'Brien\r\nb.tk.obrien@gmail.com\r\nAlberta, Canada\r\n\r\n", 
        [
            2012, 
            9, 
            16
        ]
    ], 
    "2012-9-17": [
        "[The Listserve] A diddle of advice?", 
        "Matt", 
        "So as a recently turned 21 year old, I feel I don't know as much as almost everybody else here on the listserve. I have no wise words, no humbling story, but by no means do I live an unfulfilled life. I’ve found in my short, but fun filled existence that if you want to do something then you should never let things hold you back.\r\n\r\n             I know there are certain circumstances which don’t allow you to fulfil goals and objectives, but surely there’s a way around them? A lot of the time we’re creating our own barriers that hold us back because were too comfortable in what we know. So I challenge you, the reader to go out there and do something different, something that gets you one step further to what you want out of life, and do it with a smile on your face, because as a drunken man once said to me “Why are you young ones so angry?”\r\n\r\n             Another thing I’ve learnt so far is never to be jealous of others. It’s the easiest way to bring yourself down. Just be comfortable with what you can, or even can’t do and take solace in the fact that somebody will be jealous of you at some point.\r\n\r\n\r\nMany thanks for reading, Matt.\r\nmattymoomoomoo@hotmail.co.uk\t\r\nU.K\r\n\r\nP.S If anybody out there knows of any theatre comedies that aren’t well known, please feel free  to send them my way, as I am very. VERY stuck for a script to use in my final year of University J\r\n\r\nP.P.P.S. Go team GB in the Paralympics!\r\n\r\n", 
        [
            2012, 
            9, 
            17
        ]
    ], 
    "2012-9-18": [
        "[The Listserve] Hello, from Brooklyn", 
        "Josette", 
        "Everyday I am fascinated by the Listserve responses. Although I assume it is filtered to protect against hateful, sexual, prejudicial, racial, etc. emails, I am fascinated by what wonderful things people can squeeze into about 200 words.\r\nI am no poet or philosopher so I can only offer you these words of wisdom : Don't allow yourself to become stuck in an endless cycle of negativity. Things will not change unless you change them. Stop and ask yourself, 'Do I really want to go down this road again?'. Only you can change the path you walk in life.\r\n\r\nJosie's To-Do List\r\n1) Love your family. Remember the first friends you have in life are your family.\r\n2) If you're ever in NY don't forget to ride the subway and definitely visit Brooklyn. I have lived here all my life and its a beautiful place.\r\n3) Read. & by reading I don't mean magazines. Grab a book and turn the pages.\r\n4) Have a 'Me' day. Preferably a weekend day. Get a haircut, drink some wine, check into a hotel solo. Take care of yourself.\r\n5) Learn to cook your favorite meal(s).\r\n6) Lastly, take lots of pictures and tell the ones you love you love them as often as you can.\r\n\r\nFeel free to share some insight on your country or city. I am a Tourism & Hospitality major and I would like to learn about new cities around the globe. Starting with the US and beyond.\r\n\r\n\r\nHave a very lovely day :)\r\n-xx\r\nJosette\r\npinkloveelace@yahoo.com\r\n@ohjosie_\r\nBrooklyn, NY\r\n\r\n", 
        [
            2012, 
            9, 
            18
        ]
    ], 
    "2012-9-19": [
        "[The Listserve] Simple Life", 
        "Michelle", 
        "- Be nice to someone today and everyday. \r\n\r\nI work in sales and deal with angry people everyday and all I ever think is, why? Why do you feel the need to belittle me when I'm trying to help you? You're made to feel like you're  two inches tall, that everything (even the things you had nothing to do with) is with) is somehow your fault. The reason for someone's action isn't always clear but treating someone horribly because you've had a bad day is just inexcusable.  So if you feel like flying off the handle and screaming at someone please stop, take a breath, and imagine if you were in their position. You just might change your tone. \r\n\r\n-Handmade and from the heart. \r\n\r\nIn today's world everything is automated, digitized, prepackaged, almost everything is done for you. It's amazing what a handmade card or a made from scratch cookie can do to brighten up someones day. Plus the fact that you made it with your own hands gives you a feeling of self satisfaction that you just can't beat. \r\n\r\nI've learned so much from the other ListServers thus far and I know what I have to say isn't profound but it's nice to be able to speak my mind. \r\n\r\n\r\nMichelle \r\nPunkgirl2138@yahoo.com \r\nMy comfy little corner with my love and my two wonderful kitties. \r\nOxnard, CA   USA\r\n\r\n", 
        [
            2012, 
            9, 
            19
        ]
    ], 
    "2012-9-20": [
        "[The Listserve] The real problem with electric cars", 
        "Richard Mignogna, Ph.D., P.E.", 
        "Much has been written in the popular and technical press lately about the emerging electric vehicle, both pro and con.  In spite of wishful thinking, don't expect significant penetration any time this decade.  There is probably a role for EVs but it is not the widespread consumer market.  Rather, it is more likely to be various fleet applications such as delivery vehicles or limited urban transit applications.  For all but the most dedicated clean energy afficionados and hobbyists, or those who can afford a third vehicle, how many consumers can afford to pay the prices being charged for a vehicle with such limited capability?  Most cannot.  Second, there is still the issue that, in most places, the electricity used to recharge an EV will come predominantly from coal.  So, the environmental benefits, at best, are muted. But, cost and performance aside, there is another difficulty with an electric transportation infrastructure that few seem to speak about.  If you loved Big Oil, you will really love Big Monopoly Electric Utility extending its dominance to the transportation sector.  Gasoline prices have at least been shown to be sufficiently elastic that they respond to consumer demand.  And, within a limited range, consumers still have a choice of providers.  Hence, there is at least some semblance of a free market at play -- even if it is an oligopoly.  In contrast, a consumer's only choice for recharging that overpriced EV is the local monopoly utility and to pay whatever its regulator-approved rate is.  Good luck there.  So, there is a use for electro-motive transportation.  It just isn't the one everyone is talking about.\r\n\r\n\r\nRichard Mignogna, Ph.D., P.E.\r\nGolden, Colorado\r\n@RichMignogna\r\n\r\n", 
        [
            2012, 
            9, 
            20
        ]
    ], 
    "2012-9-21": [
        "[The Listserve] Skill and fear", 
        "Margaret Trauth", 
        "I used to work at Spümcø, the studio responsible for \"Ren & Stimpy\". There were a lot of great cartoonists there.\r\n\r\nFor a while, I was assisting Jim Smith. Jim's favorite thing to draw is big muscly guys, a subject I'm normally not very interested in- but Jim combines his knowledge of every single muscle in the human body with an astonishing sense of grace and flow; his musclemen are things of beauty.\r\n\r\nLooking closely at his drawings for an extended period of time, I despaired ever being that good. Until one day he brought in some ancient drawings from when he was a teenager. It was... not good. I looked at it, and something went *click* in my head. This art was pretty much EXACTLY as bad as the stuff I was drawing at that age. Except this drawing from 15-year-old Jim was a few years older than ME. And he'd been drawing EVER SINCE. He'd BETTER be able to draw rings around me.\r\n\r\nThat day, I quit looking at other people's artwork and thinking \"I could never draw that\". There are still things I can't draw, techniques I'm pretty useless at. But I know that if I really want to, I can spend a few years practicing, and I'll have it. I started getting a lot better after that realization.\r\n\r\nOf course, I've been lucky to have the time and finances to pursue this. But that's a whole other message, isn't it?\r\n\r\n\r\n- Margaret Trauth\r\negypt@urnash.com\r\nSeattle, WA\r\n\r\n", 
        [
            2012, 
            9, 
            21
        ]
    ], 
    "2012-9-22": [
        "[The Listserve] Say Yes to Music", 
        "Carlton Lion", 
        "Thought I would share with you the year I said Yes to every music concert I came across. Needless to say it was a very expensive year but also incredibly rewarding and the spirit of musical adventure has stayed with me.\r\n\r\nIt started with a simple wish for this little IT Geek to get out more. I have a love of music – not just one style but the very thought of music fills me with joy. To that end I decided to go to every concert that I came across or heard about.\r\n\r\nI went to music festivals, choral works, musical theatre and opera; to see blues and rock bands at pubs, country and western stampedes, jazz in the park, saw Leonard Cohen under the stars and cried as I heard Barber’s Adagio for Strings played live for the first time.\r\n\r\nWhat did I learn? I learned to listen. Not just to music but to atmosphere, to the joy of those around me, to wonder at the incredible gestalt that can form between artist(s) and the audience and to rejoice in the ability to allow sound to fill your heart until you are sure you must glow with radiance.\r\n\r\nTo this day I still say Yes to music with three more events added over the weekend.\r\n\r\nI hope that this email may inspire you to say Yes to a new experience in your life. The cuisine of the world is my next adventure.\r\n\r\n\r\nSmiles and thanks for reading.\r\nCarltonLion\r\nCarltonLion@yahoo.com\r\nAustralia\r\n\r\n", 
        [
            2012, 
            9, 
            22
        ]
    ], 
    "2012-9-24": [
        "[The Listserve] A Story of Understanding", 
        "Julia", 
        "When I was 18, my mother discovered that my stepfather had installed a small pinhole camera in my bathroom.\r\n\r\nHe was given several misdemeanors but I did *not* press charges despite the overwhelming pressure from everyone to do so. Actually, seven years later, I'm still in contact with him.\r\n\r\nVery few people understand this decision. They think I should have sued him for all he's worth and destroyed his life. \"Why do you still talk to that pervert?\" they ask.\r\n\r\nMy answer is this: Because I understand what hate will do if I grab hold of it. It will lodge itself in every corner of my mind and soul and I will go through life believing I'm a victim and that things are happening TO me. I'll focus on what I don't have instead of what I do.\r\n\r\nI must instead focus on the good and the love. My stepfather wasn't abusive, verbally or physically, in any way and, in fact, he was a damn good stepfather most of the time.\r\n\r\nWe are who we are not based solely on who we decide to be in any given moment but what society, people around us, and our environment TEACH us to be. Don't jump to conclusions about others. Rather, take the time and energy to understand why they do what they do and how they got to be who they are.\r\n\r\nLook inward. Forgive yourself, forgive others, and put love out into the world.\r\n\r\n\r\nLove to you all, \r\nJulia \r\njulials219@gmail.com\r\nSeattle, WA\r\n\r\n", 
        [
            2012, 
            9, 
            24
        ]
    ], 
    "2012-9-4": [
        "[The Listserve] \tThe Cooper Union", 
        "Ben Davis", 
        "\"My story today is not my own: it is Peter Cooper’s.  He died in 1883, but his legacy is just as important now as it was then.  He believed that education is a public good - that it should be available to anyone, regardless of their ability to pay, gender, race, religion, social class, or political beliefs.  This may not seem like a huge thing now, but it was then.\r\n\r\nThe reason I bring it up now is because the institution he founded, The Cooper Union for the Advancement of Science and Art, is in trouble.  It has been a full-scholarship college for art, architecture, and engineering students since 1902 but it will run out of money in 2015 unless it gets significant help.\r\n\r\nI’m not soliciting donations (I doubt there are a lot of rogue billionaires on this list anyway. . .) but I would like you to take 10 seconds to Google “Cooper Union” and learn about Peter Cooper’s dream for education.  It has become my dream as well (I’ve taught there since 2009) and it makes me sad that its future is in jeopardy.\"\r\n\r\n\r\nBen Davis\r\nbdavis@cooper.edu\r\nNew York, NY\r\n\r\n\r\n", 
        [
            2012, 
            9, 
            4
        ]
    ], 
    "2012-9-6": [
        "[The Listserve] Under Pressure", 
        "Jennifer Cox", 
        "Yesterday, I was exhausted.\r\n\r\nI'm on year six of raising my children alone. Eight are still at home. For years I languished. Stuck. Broken. But my kids kept growing. All these dreams I've had for us, for me, didn't end because my marriage ended, or I couldn't finance them or find time to breathe life into them. They ended because I gave up on them; resigned myself to the fact that life was always going to be hard. So, I put my dreams on paper and figured out what I needed to do to make them happen. I wrote down what it would feel like to accomplish them. I'm not talking about buying stuff or jetting around the world. I'm talking about living!\r\n\r\nAnd yesterday, exhausted, I almost gave in and slept. Then I saw this pinned to the board above my desk: “Don't give up what you LOVE most for what you WANT now.” My bucket list contains one item: I want to live someplace beautiful. Everything else will fall into place from there. Taking a nap in the miserable heat won't get me there. But knocking out that research paper; boxing up clutter to sell/give away; and snuggling with my kids, talking about our first winter in the snow gets me closer. Going to bed early last night with the kids helped, too.\r\n\r\n'Love dares you to change the way you care about yourself.'\r\n\r\n“Under Pressure” Queen\r\n\r\n\r\nJennifer Cox\r\ndiscoveringpeace@gmail.com\r\nFt. Worth, TX\r\n\r\n", 
        [
            2012, 
            9, 
            6
        ]
    ], 
    "2012-9-7": [
        "[The Listserve] Wise words, set to music", 
        "Jeff Robson", 
        "Whenever it comes to finding the right words for a situation (such as now), I often find myself unable to say something clear enough, powerful enough, or smart enough. Luckily, I can always find a songwriter who can do it for me. When I need words of hope or wisdom, or when I need to feel like someone else has felt the same pain and frustration as me, I look for it in song. It seems that here’s always someone who can speak my heart and mind better than I can. Sometimes I need a bit of energy, motivation, a good laugh, or just some entertainment. I find it all in music.\r\n\r\nLook up these writers; I know they’ll give you something that speaks to you. You know how & where to find them. Their songs have done so much for me; the least I can do for them (and for you) is to hope that someone will discover them and enjoy their work, as I have. In no particular order:\r\n\r\nDel Barber\r\nChristina Martin\r\nLeeroy Stagger\r\nJohn K Samson/The Weakerthans\r\nJim Bryson\r\nWillie P Bennett\r\nTownes Van Zandt\r\nPaul Kelly\r\nDavid Francey\r\nMatthew Ryan\r\nRon Hawkins/The Lowest of the Low\r\nThe Warped 45s\r\nThe Blue Shadows\r\nLynn Miles\r\nNQ Arbuckle\r\nShannon Lyon\r\nRose Cousins\r\nOh Susanna\r\nThe Damnwells\r\n\r\nThese are just a few. Without these writers, I might not be alive today. I certainly wouldn’t be able to get by as well as I do. Let them move you.\r\n\r\n\r\nJeff Robson\r\ntellthebandtogohome@gmail.com\r\nWinnipeg, Manitoba, Canada\r\n\r\n", 
        [
            2012, 
            9, 
            7
        ]
    ], 
    "2012-9-8": [
        "[The Listserve] it's not the destination but the journey", 
        "Jackie Lightfield", 
        "A long time ago in a public school system far away, I learned stuff that would never appear on a standardized test, wrote reams of essays covered with red ink and wondered what the future held. It was the dawn of the digital age, and while I could clearly see how computers would change everything, everything about education did not. Yet the most valuable thing I learned was how to learn and how to fail. The easiest path to failure is to take risks. Everyday I try to do different things, to take a different path, to read something on a topic I've never explored. Today I am a serial entrepreneur. I'm on my seventh start up, an idea I conceived almost six years ago, and one that is all about exploring a journey instead of settling for a destination. Whatever stage of life you find yourself in, take an hour today and do something new. Whether its reading a random book, or walking around a new neighbourhood.  Then keep on doing that every day. Before long you will be your learning journey. Who knows what you'll discover. Follow mine at @turfgrrl.\r\n\r\n\r\nJackie Lightfield\r\nchief problem solver Pocket Tour Guide--Fresh Travel Guides for Independent Travellers\r\n@turfgrrl\r\nturfgrrl@gmail.com\r\nconnecticut\r\n\r\n", 
        [
            2012, 
            9, 
            8
        ]
    ], 
    "2012-9-9": [
        "[The Listserve] What you’ve always heard, and why it isn’t true", 
        "Jared", 
        "Politicians, pundits, and religious figures say the Bible dictates how you should vote on certain issues. Unfortunately, much of it is not true.\r\n\r\nAbortion: It’s not murder, and the penalty for causing a miscarriage against the will of the mother can be a simple fine (Exodus 21). Sometimes God calls for pregnant women (and the fetus) to be put to death (Genesis 38).\r\n\r\nContraception and masturbation: The Bible is silent on these issues. God killed Onan for coitus interruptus (“spilling his seed”), as punishment for refusing to impregnate his brother’s widow (Genesis 38).\r\n\r\nHomosexuality: The Bible says all sex outside of a marriage is wrong and does not differentiate for homosexual acts. But in the same places it also prohibits eating shellfish, tattoos, divorce, wearing gold, wearing clothes made of two different cloths, and other rules absurd to modern society that the church ignores (e.g. Leviticus 11). Why aren’t they protesting retailers and seafood restaurants?\r\n\r\nMarriage: While you may hear that the Bible defines marriage as “one man, one woman” (it doesn’t), it actually has examples of “one man, many women”, “a rapist and his victim”, “a soldier and prisoner of war”.\r\n\r\nWealth: Jesus says it’s hard for the rich to get into heaven, and people should give away all of their possessions. Not tax cuts for the rich.\r\n\r\nBible’s literal truth: Our modern Bible has thousands of changes from the original texts (read any Bart Ehrman book).\r\n\r\nDon’t let people cynically manipulate you for their personal gain or prejudice.\r\n\r\n\r\nJared\t\r\ngoogoljared@gmail.com\t\r\nAtlanta, GA (USA)\r\n\r\n", 
        [
            2012, 
            9, 
            9
        ]
    ]
}