{
    "2012-9-10": [
        "[The Listserve] A tip to boost (or awake) your superpowers", 
        "Alexander Demenshin", 
        "Sometimes, we cannot recall things which we want to recall, and we cannot see a full picture due to missing details.\r\n\r\nWe are afraid to make a decision since we don't know the outcome, and all this leads to mistakes that we prefer to avoid.\r\n\r\nIt would be great if our memory was like a hard drive, so we could store and recall anything any time, and if we could correlate all events from the past and see all connections.\r\n\r\nThis way, we could make no mistakes and precisely forecast the future.\r\n\r\nBut... our memory is not a hard drive, thus, it cannot work that way.\r\n\r\nHowever, there is something that we can do to improve this:\r\n\r\n- When you are preparing to sleep, lying in the bed, try to recall all events of the past day, exactly in the order as they happened, with all details. - If you are finished and still awake - try previous day, and so on. - Next morning, after waking up, briefly recall previous day.\r\n\r\nIn the end, you will feel the boost. Your memory will improve, you will begin to see the future, you will intuitively avoid mistakes.\r\n\r\nBut please, be patient - it could take days, weeks or even months, this is very individual, so don't panic if nothing happens quickly - eventually, it will - or money back :)\r\n\r\nJust be persistent.\r\n\r\n\r\nAlexander Demenshin\t \r\nal.dem@nk7.net\t\r\nDuesseldorf, Germany\r\n\r\n", 
        [
            2012, 
            9, 
            10
        ]
    ], 
    "2012-9-6": [
        "[The Listserve] Under Pressure", 
        "Jennifer Cox", 
        "Yesterday, I was exhausted.\r\n\r\nI'm on year six of raising my children alone. Eight are still at home. For years I languished. Stuck. Broken. But my kids kept growing. All these dreams I've had for us, for me, didn't end because my marriage ended, or I couldn't finance them or find time to breathe life into them. They ended because I gave up on them; resigned myself to the fact that life was always going to be hard. So, I put my dreams on paper and figured out what I needed to do to make them happen. I wrote down what it would feel like to accomplish them. I'm not talking about buying stuff or jetting around the world. I'm talking about living!\r\n\r\nAnd yesterday, exhausted, I almost gave in and slept. Then I saw this pinned to the board above my desk: “Don't give up what you LOVE most for what you WANT now.” My bucket list contains one item: I want to live someplace beautiful. Everything else will fall into place from there. Taking a nap in the miserable heat won't get me there. But knocking out that research paper; boxing up clutter to sell/give away; and snuggling with my kids, talking about our first winter in the snow gets me closer. Going to bed early last night with the kids helped, too.\r\n\r\n'Love dares you to change the way you care about yourself.'\r\n\r\n“Under Pressure” Queen\r\n\r\n\r\nJennifer Cox\r\ndiscoveringpeace@gmail.com\r\nFt. Worth, TX\r\n\r\n", 
        [
            2012, 
            9, 
            6
        ]
    ], 
    "2012-9-7": [
        "[The Listserve] Wise words, set to music", 
        "Jeff Robson", 
        "Whenever it comes to finding the right words for a situation (such as now), I often find myself unable to say something clear enough, powerful enough, or smart enough. Luckily, I can always find a songwriter who can do it for me. When I need words of hope or wisdom, or when I need to feel like someone else has felt the same pain and frustration as me, I look for it in song. It seems that here’s always someone who can speak my heart and mind better than I can. Sometimes I need a bit of energy, motivation, a good laugh, or just some entertainment. I find it all in music.\r\n\r\nLook up these writers; I know they’ll give you something that speaks to you. You know how & where to find them. Their songs have done so much for me; the least I can do for them (and for you) is to hope that someone will discover them and enjoy their work, as I have. In no particular order:\r\n\r\nDel Barber\r\nChristina Martin\r\nLeeroy Stagger\r\nJohn K Samson/The Weakerthans\r\nJim Bryson\r\nWillie P Bennett\r\nTownes Van Zandt\r\nPaul Kelly\r\nDavid Francey\r\nMatthew Ryan\r\nRon Hawkins/The Lowest of the Low\r\nThe Warped 45s\r\nThe Blue Shadows\r\nLynn Miles\r\nNQ Arbuckle\r\nShannon Lyon\r\nRose Cousins\r\nOh Susanna\r\nThe Damnwells\r\n\r\nThese are just a few. Without these writers, I might not be alive today. I certainly wouldn’t be able to get by as well as I do. Let them move you.\r\n\r\n\r\nJeff Robson\r\ntellthebandtogohome@gmail.com\r\nWinnipeg, Manitoba, Canada\r\n\r\n", 
        [
            2012, 
            9, 
            7
        ]
    ], 
    "2012-9-8": [
        "[The Listserve] it's not the destination but the journey", 
        "Jackie Lightfield", 
        "A long time ago in a public school system far away, I learned stuff that would never appear on a standardized test, wrote reams of essays covered with red ink and wondered what the future held. It was the dawn of the digital age, and while I could clearly see how computers would change everything, everything about education did not. Yet the most valuable thing I learned was how to learn and how to fail. The easiest path to failure is to take risks. Everyday I try to do different things, to take a different path, to read something on a topic I've never explored. Today I am a serial entrepreneur. I'm on my seventh start up, an idea I conceived almost six years ago, and one that is all about exploring a journey instead of settling for a destination. Whatever stage of life you find yourself in, take an hour today and do something new. Whether its reading a random book, or walking around a new neighbourhood.  Then keep on doing that every day. Before long you will be your learning journey. Who knows what you'll discover. Follow mine at @turfgrrl.\r\n\r\n\r\nJackie Lightfield\r\nchief problem solver Pocket Tour Guide--Fresh Travel Guides for Independent Travellers\r\n@turfgrrl\r\nturfgrrl@gmail.com\r\nconnecticut\r\n\r\n", 
        [
            2012, 
            9, 
            8
        ]
    ], 
    "2012-9-9": [
        "[The Listserve] What you’ve always heard, and why it isn’t true", 
        "Jared", 
        "Politicians, pundits, and religious figures say the Bible dictates how you should vote on certain issues. Unfortunately, much of it is not true.\r\n\r\nAbortion: It’s not murder, and the penalty for causing a miscarriage against the will of the mother can be a simple fine (Exodus 21). Sometimes God calls for pregnant women (and the fetus) to be put to death (Genesis 38).\r\n\r\nContraception and masturbation: The Bible is silent on these issues. God killed Onan for coitus interruptus (“spilling his seed”), as punishment for refusing to impregnate his brother’s widow (Genesis 38).\r\n\r\nHomosexuality: The Bible says all sex outside of a marriage is wrong and does not differentiate for homosexual acts. But in the same places it also prohibits eating shellfish, tattoos, divorce, wearing gold, wearing clothes made of two different cloths, and other rules absurd to modern society that the church ignores (e.g. Leviticus 11). Why aren’t they protesting retailers and seafood restaurants?\r\n\r\nMarriage: While you may hear that the Bible defines marriage as “one man, one woman” (it doesn’t), it actually has examples of “one man, many women”, “a rapist and his victim”, “a soldier and prisoner of war”.\r\n\r\nWealth: Jesus says it’s hard for the rich to get into heaven, and people should give away all of their possessions. Not tax cuts for the rich.\r\n\r\nBible’s literal truth: Our modern Bible has thousands of changes from the original texts (read any Bart Ehrman book).\r\n\r\nDon’t let people cynically manipulate you for their personal gain or prejudice.\r\n\r\n\r\nJared\t\r\ngoogoljared@gmail.com\t\r\nAtlanta, GA (USA)\r\n\r\n", 
        [
            2012, 
            9, 
            9
        ]
    ]
}